<H2 id=scheduler-activations><SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> Implementing threads : Scheduler activations</SPAN></FONT></H2>
<P>In both the many-to-many model and the two-level model there must be some way for the kernel to communicate with the user level thread manager to maintain an appropriate number of kernel threads allocated to the process.</P>
<P>&#20063;&#23601;&#26159;&#35828;&#35843;&#24230;&#22120;&#28608;&#27963;&#23454;&#38469;&#19978;&#26159;&#20869;&#26680;&#29992;&#26469;&#21644;&#29992;&#25143;&#32423;&#32447;&#31243;&#31649;&#29702;&#32773;&#36827;&#34892;&#20132;&#20114;&#30340;&#26041;&#24335;&#65292;&#26412;&#36136;&#26159;&#20026;&#20102;&#30830;&#23450;&#38656;&#35201;&#20026;&#36827;&#31243;&#20998;&#37197;&#22810;&#23569;&#20010;&#20869;&#26680;&#32447;&#31243;&#65288;&#20063;&#23601;&#26159;&#34394;&#25311;&#22788;&#29702;&#22120;&#65289;&nbsp;&#65292;&#24403;&#28982;&#65292;&#38656;&#35201;&#26159;&#22810;&#23545;&#22810;&#20197;&#21450;&#20004;&#23618;&#35843;&#24230;&#27169;&#24335;&#25165;&#38656;&#35201;&#21644;&#29992;&#25143;&#32423;&#32447;&#31243;&#31649;&#29702;&#22120;&#36827;&#34892;&#20132;&#20114;</P>
<P>This mechanism is called<SPAN>&nbsp;</SPAN><STRONG>scheduler activations</STRONG>.</P>
<P>The kernel provides the application with a set of kernel threads (virtual processors), and then the application has complete control over what threads to run on each of the kernel threads (virtual processors). The number of kernel threads (virtual processors) in the set is controlled by the kernel, in response to the competing demands of different processes in the system.<SUP id=fnref:scheduler-activations class=footnote-ref><A class=highlight href="http://www.it.uu.se/education/course/homepage/os/vt18/module-4/implementing-threads/#fn:scheduler-activations"><FONT color=#0066cc>1</FONT></A></SUP></P>
<P>&#20869;&#26680;&#20250;&#20026;&#24212;&#29992;&#31243;&#24207;&#25552;&#20379;&#19968;&#31995;&#21015;&#30340;&#20869;&#26680;&#32447;&#31243;&#65288;&#34394;&#25311;&#22788;&#29702;&#22120;&#65289;&#24212;&#29992;&#31243;&#24207;&#33021;&#23436;&#20840;&#25511;&#21046;&#22312;&#36825;&#20123;&#20869;&#26680;&#32447;&#31243;&#19978;&#31350;&#31455;&#36816;&#34892;&#21738;&#19968;&#20010;&#12289;&#20197;&#24590;&#26679;&#30340;&#35843;&#24230;&#26041;&#24335;&#36816;&#34892;&#29992;&#25143;&#32447;&#31243;&#30340;&#20195;&#30721;&#12290;&#32780;&#20869;&#26680;&#32447;&#31243;&#30340;&#20010;&#25968;&#23454;&#38469;&#19978;&#23601;&#26159;&#36890;&#36807;&#20869;&#26680;&#19982;&#29992;&#25143;&#32423;&#32447;&#31243;&#31649;&#29702;&#22120;&#36890;&#36807;&#35843;&#24230;&#22120;&#28608;&#27963;&#30340;&#26041;&#24335;&#65292;&#26681;&#25454;&#29992;&#25143;&#36827;&#31243;&#30340;&#38656;&#27714;&#30830;&#23450;&#19979;&#26469;&#30340;</P>
<P>The kernel notify the user-level thread manager of important kernel events using<SPAN>&nbsp;</SPAN><STRONG>upcalls</STRONG><SPAN>&nbsp;</SPAN>from the kernel to the user-level thread manager.</P>
<P>&#20869;&#26680;&#20250;&#20351;&#29992;&#35832;&#22914;&#19978;&#34892;&#35843;&#29992;&#30340;&#26041;&#24335;&#65292;&#24403;&#26576;&#20123;&#20869;&#26680;&#20107;&#20214;&#21457;&#29983;&#26102;&#36890;&#30693;&#29992;&#25143;&#32423;&#32447;&#31243;&#31649;&#29702;&#22120;</P>
<P>&#36825;&#37324;&#30340;&#20869;&#26680;&#20107;&#20214;&#21253;&#25324;&#65306;&#29992;&#25143;&#32447;&#31243;&#25191;&#34892;&#31995;&#32479;&#35843;&#29992;&#12290;&#31995;&#32479;&#35843;&#29992;&#36820;&#22238;&#12289;&#20869;&#26680;&#20026;&#24212;&#29992;&#31243;&#24207;&#20998;&#37197;&#26032;&#30340;&#20869;&#26680;&#32447;&#31243;&#12289;&#20869;&#26680;&#22238;&#25910;&#26576;&#20010;&#20998;&#37197;&#30340;&#20869;&#26680;&#32447;&#31243;&#31561;</P>
<P>&nbsp;Examples of such events includes a thread making a blocking system call and the kernel allocating a new kernel thread to the process.