<STRONG><FONT color=blue>Implementing threads : User-level thread scheduling : </FONT></STRONG>
<H3 id=preemptive-scheduling-of-user-level-threads><SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> Implementing threads : User-level thread scheduling : Preemptive scheduling of user-level threads</SPAN></FONT></H3>
<P>The preemptive model is similar to multitasking (aka time sharing). Multitasking is a logical extension of multiprogramming where a timer is set to cause an interrupt at a regular time interval and the running process is replaced if the job requests I/O or if the job is interrupted by the timer. This way, the running job is given a time slice of execution than cannot be exceeded.</P>
<P>&#22810;&#20219;&#21153;&#23454;&#38469;&#19978;&#26159;&#22810;&#36947;&#31243;&#24207;&#31995;&#32479;&#30340;&#36923;&#36753;&#25299;&#23637;&#65292;&#35328;&#19979;&#20043;&#24847;&#23601;&#26159;&#65292;&#22810;&#21040;&#31243;&#24207;&#31995;&#32479;&#23454;&#38469;&#19978;&#26159; cooperative &#30340;&#65292;&#30452;&#21040;&#25191;&#34892; yield &#25110;&#32773; IO &#25805;&#20316;&#20043;&#21069;&#37117;&#19981;&#20250;&#25918;&#25163;</P>
<P>&#32780;&#22810;&#20219;&#21153;&#30456;&#27604;&#20110;&#22810;&#36947;&#31243;&#24207;&#31995;&#32479;&#30340;&#25299;&#23637;&#20043;&#22788;&#23601;&#22312;&#20110;&#21152;&#20102;&#19968;&#20010;&#35745;&#26102;&#22120;&#65292;&#20801;&#35768;&#35843;&#24230;&#22120;&#22312;&#21512;&#36866;&#30340;&#26102;&#20505;&#65288;&#20026;&#20102;&#30830;&#20445;&#20844;&#24179;&#30340;&#36164;&#28304;&#20998;&#37197;&#65289;&#25191;&#34892;&#36827;&#31243;&#20999;&#25442;&#65292;&#22240;&#27492;&#23454;&#38469;&#19978;&#22810;&#20219;&#21153;&#31995;&#32479;&#37319;&#29992;&#30340;&#35843;&#24230;&#26041;&#24335;&#26159;&#25250;&#20808;&#20013;&#26029;</P>
<P>&#25152;&#35859;&#25250;&#20808;&#35843;&#24230;&#27169;&#24335;&#25351;&#30340;&#23601;&#26159;&#65292;&#35745;&#26102;&#22120;&#21487;&#33021;&#20250;&#26681;&#25454;&#35843;&#24230;&#25919;&#31574;&#36873;&#25321;&#26159;&#21542;&#25250;&#20808;&#26576;&#20010;&#32447;&#31243;&#30340;&#25191;&#34892;&#65292;&#28982;&#21518;&#35753;&#20854;&#20182;&#29992;&#25143;&#32447;&#31243;&#20351;&#29992; CPU</P>
<P>In the preemptive model, a timer is used to cause execution flow to jump to a central dispatcher thread, which chooses the next thread to run. In the below figure a many-to-one system with preemptive user-level threads is shown.</P>
<P><A href="http://www.it.uu.se/education/course/homepage/os/vt18/images/module-4/preemptive.png?height=333px" data-featherlight="image"><img style="HEIGHT: 263px; WIDTH: 410px" alt="" src="http://www.it.uu.se/education/course/homepage/os/vt18/images/module-4/preemptive.png?height=333px" width=632 height=439></A>