What is the reason of using<SPAN>&nbsp;</SPAN><B>write</B><SPAN>&nbsp;</SPAN>rather than<SPAN>&nbsp;</SPAN><B>printf</B>? It is because<SPAN>&nbsp;</SPAN><B>printf()</B><SPAN>&nbsp;</SPAN>is "buffered," meaning<SPAN>&nbsp;</SPAN><B>printf()</B><SPAN>&nbsp;</SPAN>will group the output of a process together. 
<P></P>
<P><SPAN class=extract>&#20026;&#20160;&#20040;&#25512;&#33616;&#22312;&#28041;&#21450;&#21040;&#36827;&#31243;&#30456;&#20851;&#30340;&#25171;&#21360;&#20219;&#21153;&#26102;&#20351;&#29992; wirte &#32780;&#19981;&#26159; printf &#21602;&#65292;&#26412;&#36136;&#19978;&#26159;&#22240;&#20026; printf &#20250;&#23558;&#19968;&#20010;&#36827;&#31243;&#30340;&#36755;&#20986;&#32531;&#23384;&#36215;&#26469;&#65292;&#30452;&#21040;&#26576;&#20123;&#26465;&#20214;&#35302;&#21457;&#32531;&#23384;&#28165;&#31354;&#20043;&#21518;&#25165;&#23558;&#32467;&#26524;&#20104;&#20197;&#25171;&#21360;</SPAN></P>
<P>While buffering the output for the parent process, the child may also use<SPAN>&nbsp;</SPAN><B>printf</B><SPAN>&nbsp;</SPAN>to print out some information, which will also be buffered. As a result, since the output will not be send to screen immediately, you may not get the right order of the expected result.</P>
<P><SPAN class=extract>&#36825;&#26679;&#23601;&#23548;&#33268;&#20102;&#19968;&#20010;&#38382;&#39064;&#65292;&#20351;&#29992; printf &#25171;&#21360;&#30340;&#39034;&#24207;&#21487;&#33021;&#19981;&#26159;&#30495;&#27491;&#35843;&#29992; printf &#30340;&#39034;&#24207;&#65292;&#27492;&#22806;&#65292;&#19981;&#21516;&#36827;&#31243;&#30340;&#32531;&#23384;&#20063;&#21487;&#33021;&#20250;&#20197;&#19968;&#31181;&#22855;&#24618;&#30340;&#26041;&#24335;&#32416;&#32544;&#22312;&#19968;&#36215;&#12290;&#24635;&#30340;&#26469;&#35828;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#20351;&#29992;&#19981;&#20250;&#32531;&#23384;&#25968;&#25454;&#30340; write &#20250;&#22909;&#35768;&#22810;&#65306;<BR>sprintf(...)<BR>write(...)</SPAN></P>
<P>Worse, the output from the two processes may be mixed in strange ways. To overcome this problem, you may consider to use the "unbuffered"<SPAN>&nbsp;</SPAN><B>write<BR></B><FONT size=2>sprintf(buf, "This line is from pid %d, value = %d\n", pid, i);<BR>write(1, buf, strlen(buf));