<STRONG><SPAN class=extract><STRONG>loadusersymbols</STRONG> You can also use GDB to debug a user program running under Pintos. To do that, use the <STRONG>loadusersymbols</STRONG> macro to load the program&#8217;s symbol table:<BR><BR><FONT size=3 face="Ubuntu Mono">loadusersymbol program</FONT> 
<P></P>
<P>Where <STRONG>program</STRONG> is the name of the program&#8217;s executable (in the host &#64257;le system, not in the Pintos &#64257;le system). For example, you may issue:</P>
<P><FONT size=3 face="Ubuntu Mono"><BR>(gdb) loadusersymbols tests/userprog/exec-multiple <BR>add symbol table from file "tests/userprog/exec-multiple" at .text_addr = 0x80480a0</FONT></P>
<P>After this, you should be able to debug the user program the same way you would the kernel, by placing breakpoints, inspecting data, etc. </P>
<P>&#22914;&#26524;&#24819;&#35201;&#22312; Pintos &#20013;&#36816;&#34892;&#20027;&#25805;&#20316;&#31995;&#32479;&#20013;&#30340;&#26576;&#20010;&#31243;&#24207;&#30340;&#35805;&#65292;&#39318;&#20808;&#38656;&#35201;&#20351;&#29992; loadusersymbols &#23558;&#35813;&#31243;&#24207;&#30340;&#31526;&#21495;&#34920;&#21152;&#36733;&#21040; GDB &#20013;&#12290;&#20043;&#21518;&#25165;&#33021;&#20687;&#35843;&#35797;&#20869;&#26680;&#19968;&#26679;&#35843;&#35797;&#31243;&#24207;</P></SPAN></STRONG>
<P>&nbsp;</P><SPAN class=extract>
<P>Your actions apply to every user program running in Pintos, not just to the one you want to debug, so be careful in interpreting the results: GDb does not know which process is currently active (because that is an abstraction the Pintos kernel creates). </P>
<P>&#21478;&#22806;&#65292;&#19968;&#20999;&#22312; GDB &#20013;&#25191;&#34892;&#30340;&#34892;&#20026;&#37117;&#20250;&#20316;&#29992;&#20110; Pintos &#20013;&#30340;&#25152;&#26377;&#29992;&#25143;&#31243;&#24207;&#65292;&#32780;&#19981;&#20165;&#20165;&#26159;&#24403;&#21069;&#27491;&#22312;&#35843;&#35797;&#30340;&#29992;&#25143;&#31243;&#24207;&#12290;&#20063;&#23601;&#26159;&#35828; GDB &#24182;&#19981;&#30693;&#36947;&#24403;&#21069;&#27491;&#22312;&#36816;&#34892;&#30340;&#26159;&#21738;&#19968;&#20010;&#36827;&#31243;</P></SPAN><SPAN class=extract>
<P>Also, a name that appears in both the kernel and the user program will actually refer to the kernel name. (The latter problem can be avoided by giving the user executable name on the GDB command line, instead<BR>of kernel.o, and then using <STRONG>loadusersymbols</STRONG> to load <STRONG>kernel.o</STRONG>.) </P>
<P>&#27492;&#22806;&#65292;&#21516;&#26102;&#20986;&#29616;&#22312;&#20869;&#26680;&#19982;&#29992;&#25143;&#31243;&#24207;&#20013;&#30340;&#31526;&#21495;&#20250;&#34987;&#20248;&#20808;&#35748;&#20026;&#26159;&#22312;&#25351;&#20195;&#20869;&#26680;&#20013;&#30340;&#31526;&#21495;&#65288;&#20294;&#26159;&#36825;&#37324;&#32473;&#20986;&#30340;&#35299;&#20915;&#21150;&#27861;&#26159;&#21542;&#23601;&#26159;&#23558;&#31616;&#21333;&#23558;&#36825;&#20004;&#32773;&#30340;&#20851;&#31995;&#32763;&#36716;&#20102;&#21602;&#65289;</P></SPAN><STRONG><SPAN class=extract>
<P><STRONG>loadusersymbols</STRONG> is implemented via GDB&#8217;s<STRONG> add-symbol-file</STRONG> command.</P>
<P>loadusersymbols &#26159;&#36890;&#36807; GDB &#30340; add-symbol-file &#23454;&#29616;&#30340;</P>
<P></SPAN></STRONG>