&#9632;allow 
<P></P>
<P>
<P>1. &#34920;&#31034;&#8220;&#20801;&#35768;&#8221;&#26102;&#65292;&#30452;&#25509;&#23486;&#35821;&#21487;&#20197;&#26159;&#20154;&#25110;&#34892;&#20026;&#65288;&#29992;&#21517;&#35789;&#25110;&#21160;&#21517;&#35789;&#34920;&#31034;&#65289;&#65292;&#21487;&#20197;&#34920;&#31034;&#30636;&#26102;&#30340;&#34892;&#21160;&#65292;&#25110;&#26159;&#24310;&#32493;&#30340;&#29366;&#24577;&#12290;&#29992;&#34987;&#21160;&#35821;&#24577;&#26102;&#20063;&#22914;&#27492;&#12290;&#20294;&#26080;&#35770;&#20027;&#21160;&#34987;&#21160;&#65292;&#22914;&#26524;&#34987;allow&#32773;&#26159;&#20154;&#25110;&#26159;&#20869;&#23481;&#19981;&#26126;&#30830;&#30340;&#20107;&#29289;&#65292;&#21017;&#24517;&#39035;&#34917;&#19978;to inf.&#65292;&#21542;&#21017;&#24847;&#20041;&#19981;&#23436;&#20840;&#65288;&#27880;&#24847;&#65292;let&#21518;&#38754;&#30340;inf. &#19981;&#35201;to&#65292;allow&#21017;&#26080;&#35770;&#20027;&#21160;&#34987;&#21160;&#65292;&#21518;&#38754;&#30340;inf. &#24517;&#39035;&#26377;to&#65289;&#12290;&#12304;&#20363;&#22914;&#12305;Smoking is not allowed here. &#27492;&#22788;&#31105;&#27490;&#21560;&#28895;&#12290;/ Allow me to introduce to you my friend Mr. Jones. &#35831;&#20801;&#35768;&#25105;&#21521;&#24744;&#20171;&#32461;&#25105;&#30340;&#26379;&#21451;&#29756;&#26031;&#20808;&#29983;&#12290;/ You are not allowed to use a flash in this museum. &#26412;&#21338;&#29289;&#39302;&#20869;&#19981;&#20934;&#20351;&#29992;&#38378;&#20809;&#28783;&#12290;/ <SPAN class=extract>The further this process is allowed to go, the more difficult it will be to reverse. &#36825;&#20010;&#23616;&#38754;&#36234;&#26159;&#20219;&#20854;&#21457;&#23637;&#19979;&#21435;&#65292;&#20170;&#21518;&#35201;&#25197;&#36716;&#23601;&#36234;&#26159;&#22256;&#38590;&#12290;</SPAN><SPAN class=extract>&#20294;&#22914;&#26524;&#19981;&#26159;&#34920;&#31034;&#8220;&#20801;&#35768;&#8221;&#32780;&#26159;&#8220;&#25509;&#32435;&#8221;&#65292;&#21017;&#25351;&#20154;&#30340;&#30452;&#25509;&#23486;&#35821;&#21487;&#20197;&#21518;&#38754;&#27809;&#26377;to inf.&#12290;&#12304;&#20363;&#22914;&#12305;The club doesn't allow women members. &#20465;&#20048;&#37096;&#19981;&#25509;&#32435;&#22899;&#24615;&#20250;&#21592;&#12290;</SPAN> 
<P></P>2. <SPAN class=extract>&#34920;&#31034;&#8220;&#20801;&#35768;&#8221;&#65292;let&#26159;&#26368;&#26222;&#36890;&#30340;&#29992;&#35789;&#65307;permit&#30340;&#20027;&#35821;&#26159;&#26377;&#27492;&#26435;&#21147;&#32773;&#65292;&#36739;&#20026;&#27491;&#24335;&#65307;allow&#21017;&#20171;&#20046;&#20004;&#32773;&#20043;&#38388;&#65292;&#29992;&#20110;&#36890;&#24120;&#26377;&#31036;&#35980;&#30340;&#20132;&#38469;&#22330;&#21512;&#12290;&#19968;&#33324;&#26469;&#35828;&#65292;allow&#26159;&#20027;&#35266;&#26377;&#24847;&#30340;&#34892;&#20026;&#65292;&#20294;&#26377;&#26102;&#20063;&#21487;&#20197;&#34920;&#31034;&#26080;&#24847;&#30340;&#30095;&#24573;&#65288;&#21152;to inf.&#65289;&#12290;&#12304;&#20363;&#22914;&#12305;allow a cake to burn&#25226;&#34507;&#31957;&#28900;&#31946;&#20102; / Some evidence had been allowed to spoil. &#26377;&#20123;&#35777;&#25454;&#24050;&#32463;&#22240;&#20445;&#31649;&#19981;&#21892;&#32780;&#25439;&#22351;&#12290;&#22312;&#36825;&#31181;&#24847;&#20041;&#19978;&#65292;&#21482;&#33021;&#29992;allow&#65292;&#19981;&#33021;&#29992;permit&#12290; </SPAN>
<P></P>
<P>
<P>3. <SPAN class=extract>allow&#20063;&#21487;&#20197;&#26377;&#21452;&#23486;&#35821;&#65288;&#38388;&#25509;&#23486;&#35821;&#26080;to&#65292;&#20808;&#20110;&#30452;&#25509;&#23486;&#35821;&#65289;&#65292;&#34920;&#31034;&#8220;&#20801;&#35768;&#26576;&#20154;&#20139;&#26377;&#26576;&#20107;&#29289;&#8221;&#12290;&#12304;&#20363;&#22914;&#12305;She allowed her son only two hours of television on a week. &#22905;&#27599;&#21608;&#21482;&#35753;&#20799;&#23376;&#30475;&#20004;&#23567;&#26102;&#30340;&#30005;&#35270;&#12290;/ He allows himself no sweets. &#20182;&#25106;&#39135;&#31958;&#26524;&#12290;&#22312;&#36825;&#20010;&#24847;&#20041;&#19978;&#65292;&#21487;&#20197;&#26377;&#34987;&#21160;&#35821;&#24577;&#65292;&#32780;&#19988;&#36890;&#24120;&#20197;&#38388;&#25509;&#23486;&#35821;&#21464;&#20026;&#20027;&#35821;&#65292;&#21407;&#26469;&#30340;&#30452;&#25509;&#23486;&#35821;&#19981;&#21464;&#12290;&#12304;&#20363;&#22914;&#12305;The royal prisoner, allowed unusual privileges, seemed to enjoy his captivity. &#36825;&#20301;&#38054;&#29359;&#20139;&#21463;&#30528;&#19981;&#23547;&#24120;&#30340;&#29305;&#26435;&#65292;&#20284;&#20046;&#22312;&#22234;&#31105;&#20013;&#33258;&#24471;&#20854;&#20048;&#12290;</SPAN> 
<P></P>4. &#21516;order&#30456;&#20284;&#65292;allow&#34920;&#31034;&#8220;&#20801;&#35768;&#65288;&#19981;&#26126;&#35328;&#30340;&#20154;&#65289;&#23545;&#26576;&#29289;&#26045;&#21152;&#26576;&#34892;&#21160;&#8221;&#26102;&#65292;&#21487;&#20197;&#20197;&#26576;&#29289;&#20026;&#30452;&#25509;&#23486;&#35821;&#65292;&#23558;&#35813;&#34892;&#21160;&#29992;&#34987;&#21160;&#35821;&#24577;&#34920;&#31034;&#65292;&#20197;to be pp&#24418;&#24335;&#25918;&#22312;&#30452;&#25509;&#23486;&#35821;&#21518;&#38754;&#65288;&#20294;order&#26159;&#30636;&#26102;&#21160;&#35789;&#65292;allow&#21017;&#21487;&#20197;&#26159;&#30636;&#26102;&#20307;&#25110;&#24310;&#32493;&#20307;&#65289;&#12290;&#12304;&#20363;&#22914;&#12305;The real aim is to persuade the government to allow the chief executive and the legislature to be elected by universal suffrage after 2007. (The Economist, July 13, 2003) &#20182;&#20204;&#30340;&#30495;&#27491;&#30446;&#26631;&#65292;&#26159;&#35201;&#35828;&#26381;&#25919;&#24220;&#20801;&#35768;&#39318;&#24109;&#34892;&#25919;&#23448;&#21644;&#31435;&#27861;&#26426;&#26500;&#22312;2007&#24180;&#20043;&#21518;&#32463;&#26222;&#36873;&#36873;&#20986;&#12290;/ ... federalism allows many functions to be farmed out by the central government to the states or provinces. &#8230;&#32852;&#37030;&#21046;&#20801;&#35768;&#25226;&#35768;&#22810;&#32844;&#33021;&#30001;&#20013;&#22830;&#25919;&#24220;&#21253;&#24178;&#32473;&#21508;&#20010;&#24030;&#25110;&#30465;&#20221;&#12290;&#19982;allow&#21516;&#20041;&#30340;permit&#20063;&#21487;&#20197;&#37319;&#21462;&#36825;&#26679;&#30340;&#25645;&#37197;&#12290;&#12304;&#20363;&#22914;&#12305;King Henry VIII of England permitted these properties to be privately owned by Protestants, or followers of the new English Church. &#33521;&#26684;&#20848;&#22269;&#29579;&#20136;&#21033;&#20843;&#19990;&#20801;&#35768;&#20102;&#26032;&#25945;&#24466;&#20134;&#21363;&#26032;&#30340;&#33521;&#22269;&#25945;&#20250;&#36861;&#38543;&#32773;&#21344;&#26377;&#36825;&#20123;&#22320;&#20135;&#12290; 
<P></P>
<P>
<P><SPAN class=extract>5. allow X for Y&#65288;X&#26159;&#37329;&#39069;&#12289;&#29289;&#36164;&#25110;&#26102;&#38388;&#65292;Y&#26159;&#26576;&#19968;&#21487;&#33021;&#30340;&#24773;&#20917;&#25110;&#39033;&#30446;&#65292;&#29992;&#21517;&#35789;&#25110;&#21160;&#21517;&#35789;&#34920;&#31034;&#65289;&#26159;&#8220;&#20026;Y&#36825;&#31181;&#24773;&#20917;&#39044;&#30041;X&#8221;&#12290;&#12304;&#20363;&#22914;&#12305;allow fifteen minutes for fueling&#39044;&#30041;&#21313;&#20116;&#20998;&#38047;&#20316;&#20026;&#21152;&#27833;&#30340;&#26102;&#38388; / allow a gallon for leakage&#39044;&#30041;&#19968;&#21152;&#20177;&#20316;&#28431;&#20986;&#37327; / allow 5 percent for cash payment&#39044;&#23450;&#20854;&#20013;&#30334;&#20998;&#20043;&#20116;&#21487;&#20197;&#29992;&#29616;&#37329;&#25903;&#20184;&#12290;&#20063;&#21487;&#20197;&#21482;&#26377;for Y&#32780;&#27809;&#26377;X&#65292;&#20063;&#26159;&#8220;&#39044;&#20808;&#20272;&#35745;&#21040;&#8221;&#12289;&#8220;&#25226;&#26576;&#20010;&#21487;&#33021;&#21457;&#29983;&#30340;&#24773;&#20917;&#20272;&#35745;&#36827;&#21435;&#8221;&#30340;&#24847;&#24605;&#12290;&#12304;&#20363;&#22914;&#12305;allow for the unexpected&#25226;&#39044;&#35745;&#19981;&#21040;&#30340;&#24773;&#20917;&#31639;&#22312;&#20869; / buy a large one to allow for shrinkage. &#20080;&#20214;&#22823;&#30340;&#65292;&#20197;&#38450;&#23427;&#26085;&#21518;&#32553;&#27700;&#12290;/ Allowing for traffic delays, we should leave at 7:30 at the latest. &#25226;&#20132;&#36890;&#32829;&#25601;&#30340;&#26102;&#38388;&#20063;&#31639;&#22312;&#20869;&#65292;&#25105;&#20204;&#26368;&#26202;&#20063;&#24471;&#19971;&#28857;&#21322;&#20986;&#21457;&#12290;</SPAN></P>
<P>
<P>6. allow&#38500;&#20102;&#8220;&#20801;&#35768;&#8221;&#20043;&#22806;&#65292;&#36824;&#21487;&#20197;&#34920;&#31034;&#8220;&#25215;&#35748;&#8221;&#12289;&#8220;&#21516;&#24847;&#8221;&#65292;&#21518;&#38754;&#21487;&#20197;&#25509;&#19978;that&#20174;&#21477;&#25110;&#26159;&#8220;&#21517;&#35789;&#25104;&#20998; + to inf.&#8221;&#65288;&#20294;&#26159;&#36825;&#20010;inf. &#30340;&#21160;&#35789;&#24212;&#35813;&#26159;&#19981;&#33258;&#20027;&#30340;&#24310;&#32493;&#29366;&#24577;&#65292;&#22914;&#26524;&#26159;&#30636;&#26102;&#30340;&#33258;&#20027;&#34892;&#21160;&#65292;allow&#23601;&#20173;&#28982;&#26159;&#8220;&#20801;&#35768;&#8221;&#30340;&#24847;&#24605;&#65289;&#12290;&#12304;&#20363;&#22914;&#12305;One has to allow that she has talent. &#24212;&#35813;&#25215;&#35748;&#22905;&#26159;&#26377;&#25165;&#21326;&#30340;&#12290;/ Mrs. Hurst and her sister allowed it to be so. (Jane Austen, Pride and Prejudice, Chapter IV) &#36203;&#26031;&#33073;&#22826;&#22826;&#22992;&#22969;&#21516;&#24847;&#36825;&#31181;&#30475;&#27861;&#12290;/ Mr. Darcy had at first scarcely allowed her to be pretty... (ibid., Chapter VI) &#35828;&#21040;&#36798;&#35199;&#20808;&#29983;&#65292;&#20182;&#24320;&#22836;&#24182;&#19981;&#35748;&#20026;&#22905;&#24590;&#20040;&#28418;&#20142;&#8230;</P>
<P>
<P>7. allow of&#19982;admit of&#21516;&#20041;&#65292;&#21487;&#20197;&#20114;&#29992;&#65292;&#37117;&#26159;&#24310;&#32493;&#20307;&#30340;&#29366;&#24577;&#21160;&#35789;&#65288;&#19968;&#31867;&#21160;&#35789;&#65289;&#65292;&#34920;&#31034;&#8220;&#21487;&#20197;&#23481;&#35768;&#23545;&#33258;&#24049;&#32473;&#20104;&#65288;&#26576;&#31181;&#35780;&#20215;&#65292;&#26576;&#31181;&#24453;&#36935;&#65289;&#8221;&#65292;&#21487;&#20197;&#29992;&#19968;&#33324;&#29616;&#22312;&#26102;&#65292;&#20027;&#35821;&#36890;&#24120;&#26159;&#29289;&#19981;&#26159;&#20154;&#12290;&#12304;&#20363;&#22914;&#12305;His remarks allow / admit of no other interpretation. &#20182;&#30340;&#37027;&#20123;&#35805;&#19981;&#21487;&#33021;&#26377;&#21035;&#30340;&#35299;&#37322;&#12290;