In a Pintos linked list, each list element contains a &#8220;<STRONG>struct list_elem</STRONG>&#8221;, which contains the pointers to the next and previous element. Because the list elements themselves have enough space to hold the <STRONG>prev</STRONG> and <STRONG>next</STRONG> pointers, we don&#8217;t need to allocate any extra space to support our linked list. Here is an example of a linked list element which can hold an integer: 
<P></P>
<P>Pintos &#20013;&#30340;&#38142;&#34920;&#26159;&#21452;&#21521;&#38142;&#34920;&#65292;&#38142;&#34920;&#30340;&#20803;&#32032;&#23454;&#38469;&#19978;&#21576;&#29616;&#23884;&#22871;&#20851;&#31995;&#65306;&#22806;&#23618;&#26159;&#33258;&#24049;&#22768;&#26126;&#30340;&#19968;&#20010;&#32467;&#26500;&#20307;&#65288;struct int_list_elem&#65289;&#20854;&#20803;&#32032;&#20010;&#25968;&#24517;&#28982;&#20026;&#20108;&#12290;&#35813;&#32467;&#26500;&#20307;&#30340;&#39318;&#20010;&#20803;&#32032;&#23601;&#26159;&#38142;&#34920;&#30340;&#25968;&#25454;&#31867;&#22411;&#65288;int value&#65289;&#65292;&#35813;&#32467;&#26500;&#20307;&#30340;&#31532;&#20108;&#20010;&#20803;&#32032;&#23601;&#26159;&#29992;&#20110;&#32500;&#25252;&#38142;&#34920;&#32467;&#26500;&#20307;&#30340;&#39592;&#26550;&#65288;struct list_elem elem&#65289;</P>
<P><SPAN class=extract>Pintos &#20013;&#22768;&#26126;&#38142;&#34920;&#20803;&#32032;&#30340;&#26102;&#20505;&#38656;&#35201;&#27880;&#24847;&#20004;&#28857;&#65306;&#65288;1&#65289;&#20803;&#32032;&#30340;&#20540;&#23383;&#27573;&#24517;&#39035;&#20316;&#20026;&#32467;&#26500;&#20307;&#30340;&#39318;&#20010;&#23383;&#27573;&#65292;&#21517;&#31216;&#20026; value&#65292;&#65288;2&#65289;&#20803;&#32032;&#30340;&#31532;&#20108;&#20010;&#20803;&#32032;&#65292;&#20063;&#26159;&#26368;&#21518;&#19968;&#20010;&#20803;&#32032;&#24517;&#39035;&#26159;&#8220;struct list_elem elem&#8221;</SPAN><BR><BR><FONT size=2 face="Ubuntu Mono">/* Integer linked list */ <BR>struct int_list_elem {<BR>&nbsp;&nbsp;&nbsp; int value; <BR>&nbsp;&nbsp;&nbsp; struct list_elem elem; <BR>};