<B>EXAMPLE: </B>Is a kernel interrupt handler a thread? 
<P></P>
<P><STRONG>ANSWER: No, an interrupt handler is not a thread. </STRONG>A kernel interrupt handler shares some resemblance to a thread: it is a single sequence of instructions that executes from beginning to end. </P>
<P>&#20869;&#26680;&#20013;&#26029;&#22788;&#29702;&#22120;&#24182;&#38750;&#32447;&#31243;&#65292;&#23613;&#31649;&#23427;&#30830;&#23454;&#19982;&#32447;&#31243;&#20849;&#20139;&#26576;&#20123;&#29305;&#24615;&#65288;&#20174;&#22836;&#25191;&#34892;&#21040;&#23614;&#30340;&#25351;&#20196;&#24207;&#21015;&#65289;</P>
<P>However, an interrupt handler is not independently schedulable: it is triggered by a hardware I/O event, rather than a decision by the thread scheduler in the kernel. Once started, the interrupt handler runs to completion, unless preempted by another (higher priority) interrupt. &#9633; </P>
<P><SPAN class=extract>&#20869;&#26680;&#20013;&#26029;&#22788;&#29702;&#22120;&#24182;&#38750;&#32447;&#31243;&#65292;&#26412;&#36136;&#21407;&#22240;&#26159;&#20013;&#26029;&#22788;&#29702;&#22120;&#24182;&#38750;&#29420;&#31435;&#21487;&#35843;&#24230;</SPAN>&#65292;&#23427;&#20026;&#30828;&#20214; IO &#20107;&#20214;&#39537;&#21160;&#32780;&#38750;&#20869;&#26680;&#20013;&#30340;&#32447;&#31243;&#35843;&#24230;&#22120;&#25152;&#39537;&#21160;&#12290;<SPAN class=extract>&#19968;&#26086;&#21551;&#21160;&#65292;&#20013;&#26029;&#22788;&#29702;&#22120;&#23601;&#20250;&#19968;&#30452;&#36816;&#34892;&#30452;&#21040;&#25191;&#34892;&#23436;&#27605;&#65292;&#38500;&#38750;&#34987;&#20854;&#20182;&#26356;&#39640;&#20248;&#20808;&#32423;&#30340;&#20013;&#26029;&#25250;&#20808;&#25191;&#34892;</SPAN></P>
<P><SPAN class=extract>&#32447;&#31243;&#29420;&#31435;&#21487;&#35843;&#24230;&#30340;&#24847;&#24605;&#26159;&#21487;&#20197;&#38543;&#26102;&#34987;&#35843;&#24230;&#22120;&#25171;&#26029;&#65292;&#23558; CPU &#35753;&#32473;&#20854;&#20182;&#32447;&#31243;</SPAN></P>
<P>&#35328;&#19979;&#20043;&#24847;&#23601;&#26159;&#65292;&#32447;&#31243;&#24517;&#39035;&#29420;&#31435;&#21487;&#35843;&#24230;&#65292;&#20063;&#23601;&#26159;&#33021;&#34987;&#32447;&#31243;&#35843;&#24230;&#22120;&#38543;&#26102;&#25171;&#26029;&#20854;&#25191;&#34892;&#36807;&#31243;</P>
<P><SPAN class=extract>&#20026;&#20160;&#20040;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#24182;&#38750;&#29420;&#31435;&#21487;&#35843;&#24230;&#65311;&#22240;&#20026;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#20026;&#20013;&#26029;&#32780;&#38750;&#35843;&#24230;&#22120;&#25152;&#39537;&#21160;</SPAN>