The mechanism for delivering UNIX signals to user processes requires only a small modification to the techniques already described for transferring control across the kernel-user boundary. For example, on a timer interrupt, the hardware and the kernel interrupt handler save the state of the user-level computation. To deliver the timer interrupt to user level, the kernel copies that saved state to the bottom of the signal stack, resets the saved state to point to the signal handler and signal stack, and then exits the kernel handler. The iret instruction then resumes user-level execution at the signal handler. When the signal handler returns, these steps are unwound: the processor state is copied back from the signal handler into kernel memory, and the iret returns to the original computation 
<P></P><SPAN class=extract>
<P>&#22914;&#26524;&#24819;&#35201;&#22312;&#35745;&#26102;&#22120;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#25191;&#34892;&#26399;&#38388;&#21521;&#36827;&#31243;&#21457;&#20986;&#20449;&#21495;&#65292;&#37027;&#20040;&#20869;&#26680;&#20570;&#22914;&#19979;&#36825;&#20123;&#20107;&#24773;&#65306;</P>
<UL>
<LI>&#23558;&#36827;&#31243;&#29366;&#24577;&#36801;&#31227;&#21040;&#20449;&#21495;&#26632;&#20013;&#65307; 
<LI>&#23558;&#20013;&#26029;&#26632;&#20013;&#25152;&#20445;&#23384;&#30340;&#29366;&#24577;&#35774;&#32622;&#20026;&#20449;&#21495;&#26632;&#21644;&#20449;&#21495;&#22788;&#29702;&#22120;</LI></UL>
<P>&#37027;&#20040;&#24403;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#36864;&#20986;&#24182;&#25191;&#34892; iret &#24674;&#22797;&#22788;&#29702;&#22120;&#29366;&#24577;&#26102;&#65292;&#23601;&#20250;&#24674;&#22797;&#21040;&#20449;&#21495;&#22788;&#29702;&#31243;&#24207;&#32780;&#19981;&#26159;&#21407;&#36827;&#31243;&#20013;&#12290;&#31561;&#21040;&#20449;&#21495;&#22788;&#29702;&#31243;&#24207;&#20063;&#25191;&#34892;&#23436;&#27605;&#65292;&#20351;&#29992; iret &#24674;&#22797;&#29366;&#24577;&#26102;&#25165;&#20250;&#24674;&#22797;&#21040;&#21407;&#36827;&#31243;<BR></P>
<P></SPAN>