<STRONG><FONT style="BACKGROUND-COLOR: #7be1e1" color=blue>&#38142;&#36335;&#23618; : &#20132;&#25442;&#26426;&#32593;&#32476; : </FONT></STRONG>
<H3 id=vlan><FONT style="BACKGROUND-COLOR: #7be1e1">VLAN</FONT></H3>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#20132;&#25442;&#26426;&#23618;&#32423;&#32467;&#26500;&#25351;&#30340;&#26159;&#20808;&#29992;&#19968;&#20123;&#20132;&#25442;&#26426;&#23558;&#32456;&#31471;&#35774;&#22791;&#36830;&#25509;&#36215;&#26469;&#65292;&#26500;&#25104;&#19968;&#20010;&#20132;&#25442;&#26426;&#24335;&#30340; LAN&#12290;&#38543;&#21518;&#20877;&#20351;&#29992;&#21478;&#22806;&#30340;&#20132;&#25442;&#26426;&#23558;&#36825;&#20123; LAN &#21644;&#20854;&#20182;&#26381;&#21153;&#22120;&#36830;&#25509;&#36215;&#26469;&#65292;&#36825;&#31181;&#32593;&#32476;&#32467;&#26500;&#30340;&#38382;&#39064;&#65288;&#25110;&#32773;&#35828;&#20351;&#29992; VLAN&#30340;&#20248;&#28857;&#65289;&#21253;&#25324;&#20197;&#19979;&#20004;&#28857;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220314165111699 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/2.&#38142;&#36335;&#23618;.assets/image-20220314165111699.png"></FONT></P>
<OL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#32570;&#23569;&#27969;&#37327;&#29420;&#31435;&#24615;&#65306;&#32771;&#34385;&#21040;&#26576;&#20010;&#23616;&#22495;&#32593;&#20013;&#30340;&#24191;&#25773;&#27969;&#37327;&#65288;&#25110;&#32773;&#35828;&#26412;&#24212;&#24191;&#25773;&#32473;&#35813; LAN &#20013;&#25152;&#26377;&#35774;&#22791;&#30340;&#25968;&#25454;&#24103;&#65289;&#20250;&#32463;&#30001;&#19978;&#23618;&#30340;&#20132;&#25442;&#26426;&#20256;&#36882;&#32473;&#20854;&#20182; LAN&#65292;&#36825;&#19981;&#20165;&#20250;&#23545;&#25972;&#20010;&#32593;&#32476;&#30340;&#24615;&#33021;&#26377;&#25439;&#32791;&#65292;&#26356;&#37325;&#35201;&#30340;&#26159;&#25968;&#25454;&#23433;&#20840;&#24615;&#19981;&#33021;&#24471;&#21040;&#20445;&#35777;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#29992;&#25143;&#31649;&#29702;&#38382;&#39064;&#65306;&#22914;&#26524;&#38656;&#35201;&#23558;&#29992;&#25143;&#20174;&#19968;&#20010; LAN &#36801;&#31227;&#21040;&#21478;&#19968;&#20010; LAN &#20013;&#65292;&#24517;&#39035;&#37325;&#26032;&#25554;&#25300;&#21452;&#32478;&#32447;&#65307;</FONT></LI></OL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#20197;&#19978;&#38382;&#39064;&#21482;&#38656;&#35201;&#20351;&#29992; VLAN &#23601;&#33021;&#31435;&#21051;&#24471;&#21040;&#35299;&#20915;</FONT></P>
<H4 id=vlan-&#30340;&#24037;&#20316;&#26041;&#24335;><FONT style="BACKGROUND-COLOR: #7be1e1">VLAN &#30340;&#24037;&#20316;&#26041;&#24335;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#25903;&#25345;<SPAN>&nbsp;</SPAN><U>VLAN</U>&#65288;<EM>virtual local area network</EM>&#65289;&#30340;&#20132;&#25442;&#26426;&#20801;&#35768;&#29992;&#25143;&#23545;&#20854;&#31471;&#21475;&#21152;&#20197;&#21010;&#20998;&#65292;&#20351;&#36825;&#20123;&#31471;&#21475;&#65288;&#21450;&#19982;&#20043;&#30456;&#36830;&#30340;&#35774;&#22791;&#65289;&#20998;&#23646;&#19981;&#21516;&#30340; VLAN&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220314165241625 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/2.&#38142;&#36335;&#23618;.assets/image-20220314165241625.png"></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">VLAN &#30340;&#20351;&#29992;&#22312;&#24456;&#22823;&#19968;&#37096;&#20998;&#31243;&#24230;&#19978;&#35299;&#20915;&#20102; LAN &#20013;&#21407;&#26412;&#23384;&#22312;&#30340;&#38382;&#39064;&#65306;</FONT></P>
<OL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">VLAN &#26412;&#36523;&#23601;&#24418;&#25104;&#20102;&#19968;&#20010;&#20855;&#26377;&#20005;&#26684;&#38480;&#21046;&#30340;<U>&#24191;&#25773;&#22495;</U>&#65288;<EM>broad cast</EM>&#65289;&#65292;&#20219;&#20309;&#20854;&#20182;&#24191;&#25773;&#22495;&#20013;&#30340;&#24191;&#25773;&#27969;&#37327;&#37117;&#19981;&#33021;&#20256;&#36882;&#21040;&#26412;&#24191;&#25773;&#22495;&#20013;&#65292;&#26412;&#24191;&#25773;&#22495;&#20013;&#30340;&#20219;&#20309;&#24191;&#25773;&#27969;&#37327;&#20063;&#19981;&#33021;&#20256;&#36882;&#21040;&#20854;&#20182;&#24191;&#25773;&#22495;&#20013;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#22914;&#26524;&#32593;&#32476;&#31649;&#29702;&#21592;&#24819;&#35201;&#23558;&#26576;&#20010;&#29992;&#25143;&#26356;&#25913;&#21040;&#21478;&#19968;&#20010; VLAN &#20013;&#65292;&#26080;&#38656;&#31227;&#21160;&#21452;&#32478;&#32447;&#65292;&#20165;&#20165;&#21482;&#38656;&#20462;&#25913; VLAN &#30340;&#37197;&#32622;&#21363;&#21487;&#65307;</FONT></LI></OL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#19981;&#36807;&#65292;&#34394;&#25311;&#23616;&#22495;&#32593;&#20165;&#20165;&#21482;&#26159;&#23616;&#22495;&#32593;&#25552;&#20379;&#32473;&#29992;&#25143;&#30340;&#19968;&#31181;&#26381;&#21153;&#65292;&#24182;&#19981;&#26159;&#19968;&#31181;&#26032;&#22411;&#30340;&#23616;&#22495;&#32593;</FONT></P>
<H4 id=&#36328;-vlan-&#36890;&#20449;><FONT style="BACKGROUND-COLOR: #7be1e1">&#36328; VLAN &#36890;&#20449;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#37027;&#20040;&#65292;&#19981;&#21516; VLAN &#20043;&#38388;&#35201;&#22914;&#20309;&#23454;&#29616;&#36890;&#20449;&#21602;&#65311;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#35753;&#20998;&#23646;&#19981;&#21516;&#30340; VLAN &#30340;&#31471;&#21475;&#22806;&#25509;&#36335;&#30001;&#22120;&#12290;&#27492;&#26102;&#65292;&#20174; VLAN A &#21040; VALN B &#30340;&#25968;&#25454;&#25253;&#24517;&#39035;&#32463;&#30001;&#27492;&#31471;&#21475;&#20256;&#36882;&#21040;&#36335;&#30001;&#22120;&#20013;&#65292;&#20877;&#30001;&#36335;&#30001;&#22120;&#23558;&#35813;&#25968;&#25454;&#25253;&#36716;&#21457;&#22238; VLAN B</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#19981;&#36807;&#24456;&#24555;&#65292;&#20132;&#25442;&#26426;&#21378;&#21830;&#23601;&#23558;&#36335;&#30001;&#22120;&#21644;&#20132;&#25442;&#26426;&#38598;&#25104;&#36215;&#26469;&#65292;&#22240;&#27492;&#20063;&#23601;&#19981;&#38656;&#35201;&#22806;&#25509;&#36335;&#30001;&#22120;&#20102;</FONT></P>
<H4 id=&#36328;&#20132;&#25442;&#26426;&#36890;&#20449;><FONT style="BACKGROUND-COLOR: #7be1e1">&#36328;&#20132;&#25442;&#26426;&#36890;&#20449;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#29616;&#22312;&#65292;&#20301;&#20110;&#19981;&#21516;&#20132;&#25442;&#26426;&#19978;&#20294;&#20998;&#23646;&#20110;&#21516;&#19968; VLAN &#30340;&#35774;&#22791;&#20043;&#38388;&#35201;&#22914;&#20309;&#36827;&#34892;&#36890;&#20449;&#65311;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#23454;&#29616;<SPAN>&nbsp;</SPAN><STRONG>VLAN &#20013;&#32487;</STRONG>&#65288;<EM>VLAN trunking</EM>&#65289;&#30340;&#20132;&#25442;&#26426;&#20013;&#30041;&#26377;&#19968;&#20123;<STRONG>&#20013;&#32487;</STRONG>&#65288;<EM>trunk</EM>&#65289;&#31471;&#21475;&#65292;&#36825;&#20123;&#31471;&#21475;&#26159;&#19987;&#38376;&#29992;&#26469;&#21644;&#20854;&#20182;&#20132;&#25442;&#26426;&#30456;&#36830;&#30340;&#65292;&#20219;&#20309;&#25968;&#25454;&#37117;&#20250;&#32463;&#30001;&#27492;&#31471;&#21475;&#20256;&#36882;&#32473;&#20854;&#20182;&#20132;&#25442;&#26426;<SUP class=md-footnote><A href="about:blank#dfref-footnote-31" name=ref-footnote-31>31</A></SUP>&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220314165417681 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/2.&#38142;&#36335;&#23618;.assets/image-20220314165417681.png"></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#37027;&#20040;&#65292;&#20854;&#20182;&#20132;&#25442;&#26426;&#26159;&#22914;&#20309;&#21028;&#26029;&#20986;&#32463;&#30001;&#20013;&#32487;&#31471;&#21475;&#20256;&#36882;&#36807;&#26469;&#30340;&#25968;&#25454;&#24103;&#24212;&#24403;&#36716;&#21457;&#21040;&#21738;&#20010; VLAN &#20013;&#30340;&#21602;&#65311;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">IEEE &#20026;&#27492;&#25299;&#23637;&#20102;&#20197;&#22826;&#32593;&#24103;&#30340;&#26684;&#24335;&#65292;&#24182;&#23558;&#36825;&#31181;&#36328; VLAN &#20013;&#32487;&#31471;&#21475;&#20256;&#25773;&#30340;&#25968;&#25454;&#24103;&#31216;&#20026; 802.1Q &#24103;&#12290;&#30456;&#27604;&#20110;&#20197;&#22826;&#32593;&#24103;&#65292;&#36825;&#31181;&#25968;&#25454;&#24103;&#30340;&#22836;&#23383;&#33410;&#20013;&#34987;&#39069;&#22806;&#28155;&#21152;&#20102;&#29992;&#20110;&#26631;&#35782; VLAN &#30340;<SPAN>&nbsp;</SPAN><STRONG>VLAN &#26631;&#35760;</STRONG>&#65288;<EM>VLAN tag</EM>&#65289;&#19968;&#20123;&#25968;&#25454;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220314165445545 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/2.&#38142;&#36335;&#23618;.assets/image-20220314165445545.png"></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">VLAN &#26631;&#35760;&#20250;&#34987;&#21457;&#36865;&#26041;&#20132;&#25442;&#26426;&#28155;&#21152;&#21040;&#24103;&#20013;&#65292;&#24182;&#34987;&#25509;&#25910;&#26041;&#20132;&#25442;&#26426;&#35299;&#26512;&#24182;&#31227;&#38500;&#35813;&#26631;&#35760;<BR><BR></FONT></P><FONT style="BACKGROUND-COLOR: #7be1e1">