<P width=0><SPAN class=sidebar_name><B><I><SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> Why is it necessary to turn off interrupts during thread switch?</SPAN></I></SPAN></P>
<P width=0><SPAN class=sidebar_name><I><SPAN class=RefText></SPAN></FONT></I></B></SPAN>Our implementation of thread_yield&nbsp;defers any interrupts that might occur during the procedure, until the yield is complete. This might seem unnecessary: after all, even if the thread context switch is interrupted, the state of the switch will be saved onto the stack. Eventually the kernel will re-schedule the thread, restore its state, and complete the thread switch. </P>
<P width=0>&#36825;&#37324;&#35848;&#21040;&#20102;&#32447;&#31243;&#33258;&#24895;&#20999;&#25442;&#19978;&#19979;&#25991;&#30340;&#26102;&#20505;&#38656;&#35201;&#31105;&#29992;&#20013;&#26029;&#30340;&#21407;&#22240;</P>
<P>However, a subtle inconsistency might arise. Suppose a low priority thread (e.g., the idle thread) is about to voluntarily switch to a high priority thread. It pulls the high priority thread off the ready list, and at that precise moment, an interrupt occurs. Supppose the interrupt moves a medium priority thread from WAITING&nbsp;to READY. Since it appears that the processor is still running the low priority thread, the interrupt handler immediately switches to the new thread. The high priority thread is in limbo! It is ready to run, but unable to do so until the low priority thread is re-scheduled. And that may not happen for a long time. </P>
<P>Of course, this sequence of events would not occur very often, but when it does, it would be difficult to locate or debug.</P>
<P>&#20026;&#20160;&#20040;&#22312;&#32447;&#31243;&#20027;&#21160;&#20999;&#25442;&#30340;&#26102;&#20505;&#35201;&#31105;&#29992;&#20013;&#26029;&#21602;&#65311;&#31616;&#21333;&#26469;&#35828;&#26159;&#20026;&#20102;&#38450;&#27490;&#19968;&#31181;&#29305;&#21035;&#30340;&#20013;&#38388;&#29366;&#24577;&#65292;&#24403;&#20302;&#20248;&#20808;&#32423;&#32447;&#31243; A &#23558;&#39640;&#20248;&#20808;&#32423;&#36827;&#31243; C &#20174;&#20934;&#22791;&#38431;&#21015;&#20013;&#31227;&#20986;&#65292;&#24819;&#35201;&#25191;&#34892; thread_switch &#20999;&#25442;&#24403;&#21069;&#32447;&#31243;&#26102;&#65288;&#27880;&#24847;&#65292;&#27492;&#26102;&#20173;&#22788;&#20110;&#25191;&#34892;&#32447;&#31243; A &#30340;&#29366;&#24577;&#65289;&#21457;&#29983;&#20102;&#20013;&#26029;&#12290;&#20013;&#26029;&#22788;&#29702;&#22120;&#38543;&#21518;&#23558;&#19968;&#20010;&#20013;&#31561;&#20248;&#20808;&#32423;&#30340;&#32447;&#31243;&#21152;&#20837;&#20102;&#20934;&#22791;&#38431;&#21015;&#65292;&#38543;&#21518;&#23427;&#35266;&#23519;&#21040;&#31561;&#24453;&#38431;&#21015;&#65288;&#32447;&#31243; C &#22788;&#20110;&#24748;&#31354;&#29366;&#24577;&#65289;&#20197;&#21450;&#24403;&#21069;&#27491;&#22312;&#36816;&#34892;&#30340;&#32447;&#31243;&#30340;&#20248;&#20808;&#32423;&#37117;&#27604;&#32447;&#31243; B &#35201;&#20302;&#65292;&#22240;&#27492;&#30452;&#25509;&#35753;&#22788;&#29702;&#22120;&#20999;&#25442;&#21040;&#32447;&#31243; B&#12290;&#36825;&#23601;&#23548;&#33268;&#20102;&#19968;&#20010;&#24456;&#24494;&#22937;&#30340;&#38382;&#39064;&#65292;&#32447;&#31243; C &#24517;&#39035;&#35201;&#31561;&#21040;&#35843;&#24230;&#22120;&#23558;&#22788;&#29702;&#22120;&#20132;&#32473;&#20302;&#20248;&#20808;&#32423;&#32447;&#31243; A &#20043;&#21518;&#25165;&#33021;&#25191;&#34892;&#65292;&#20351;&#24471;&#26412;&#26469;&#20248;&#20808;&#32423;&#24456;&#39640;&#30340;&#32447;&#31243;&#29616;&#22312;&#30340;&#23454;&#38469;&#20248;&#20808;&#32423;&#21364;&#21464;&#24471;&#38750;&#24120;&#20302;&#12290;</P>
<P><SPAN class=extract>&#32447;&#31243;&#33258;&#24895;&#35753;&#20986; CPU &#26102;&#38388;&#26102;&#65292;&#22914;&#26524;&#20999;&#25442;&#36807;&#31243;&#34987;&#20013;&#26029;&#25171;&#26029;&#65292;&#26159;&#21542;&#20250;&#20002;&#22833;&#29366;&#24577;&#65311;&#19981;&#20250;</SPAN></P>
<P>&#35805;&#21448;&#35828;&#22238;&#26469;&#65292;&#36825;&#20010;&#26696;&#20363;&#26412;&#36523;&#30830;&#23454;&#35299;&#37322;&#20102;&#20026;&#20160;&#20040;&#35201;&#22312;&#19978;&#19979;&#25991;&#20999;&#25442;&#30340;&#36807;&#31243;&#20013;&#31105;&#29992;&#20013;&#26029;&#12290;&#20294;&#26159;&#26356;&#37325;&#35201;&#30340;&#38382;&#39064;&#22312;&#20110;&#65292;&#35753;&#32447;&#31243;&#32447;&#31243;&#32500;&#25252;&#32447;&#31243;&#29366;&#24577;&#65292;&#32780;&#19981;&#26159;&#35753;&#32447;&#31243;&#26412;&#36523;&#21435;&#32500;&#25252;&#23427;&#30340;&#29366;&#24577;&#65292;&#30830;&#23454;&#33021;&#38450;&#27490;&#22240;&#20026;&#20013;&#26029;&#30340;&#20171;&#20837;&#23548;&#33268;&#24847;&#26009;&#20043;&#22806;&#30340;&#24322;&#24120;&#24773;&#20917;&#20986;&#29616;&#12290;&#22823;&#21040;&#20043;&#21069;&#25552;&#21040;&#30340;&#21024;&#38500;&#32447;&#31243;&#34987;&#20013;&#26029;&#20171;&#20837;&#25152;&#36896;&#25104;&#30340;&#25439;&#23475;&#65292;&#23567;&#21040;&#29616;&#22312;&#19978;&#19979;&#25991;&#20999;&#25442;&#34987;&#25171;&#26029;&#30340;&#38382;&#39064;&#65288;&#27492;&#26102;&#20013;&#26029;&#20171;&#20837;&#20165;&#20165;&#21482;&#26159;&#23548;&#33268;&#23454;&#38469;&#20248;&#20808;&#32423;&#20986;&#29616;&#28151;&#20081;&#65292;&#24182;&#26410;&#23548;&#33268;&#23454;&#38469;&#25439;&#23475;&#65289;&#65292;&#26080;&#19968;&#19981;&#26174;&#31034;&#20102;&#19968;&#31181;<SPAN class=extract>&#32500;&#25252;&#32447;&#31243;&#29366;&#24577;&#26368;&#21512;&#29702;&#30340;&#27169;&#24335;&#65306;&#35753;&#20854;&#20182;&#32447;&#31243;&#26469;&#32500;&#25252;&#26412;&#32447;&#31243;&#30340;&#29366;&#24577;<BR></SPAN>