<STRONG><SPAN class=extract><STRONG>A<SPAN>&nbsp;</SPAN><A href="https://en.wikipedia.org/wiki/Virtual_LAN">virtual LAN (VLAN)</A><SPAN>&nbsp;</SPAN>is any broadcast domain that is partitioned and isolated in a computer network at the data link layer (OSI Layer 2).</STRONG> 
<P></P>
<P>LAN stands for Local Area Network and virtual, in the name, upholds the concept of separating broadcast domains of networks logically.</P>
<P><SPAN></SPAN>By assigning tags to frames one can create the appearance and functionality of a computer network that is physically on a single network but acts as if it is split between separate networks. </P>
<P>VLAN &#25351;&#30340;&#26159;&#34987;&#21010;&#20998;&#20026;&#22810;&#20010;&#20107;&#23454;&#19978;&#30340;&#24191;&#25773;&#22495;&#30340;&#29289;&#29702;&#24191;&#25773;&#22495;&#65306;&#23613;&#31649;&#36825;&#20123;&#35774;&#22791;&#20301;&#20110;&#21516;&#19968;&#20010;&#29289;&#29702;&#24191;&#25773;&#22495;&#65292;&#20294;&#26159;&#36825;&#20123;&#35774;&#22791;&#19981;&#33021;&#20351;&#29992;&#38142;&#36335;&#23618;&#25968;&#25454;&#24191;&#25773;&#36827;&#34892;&#36890;&#20449;&#65292;&#23427;&#20204;&#34987;&#21010;&#20998;&#21040;&#20102;&#20107;&#23454;&#19978;&#19981;&#21516;&#30340;&#24191;&#25773;&#22495;&#20013;</P></SPAN></STRONG><EM><SPAN class=extract>
<P><EM>A broadcast domain is a network that is logically divided such that all nodes in the network can reach each other by broadcast at the data link layer</EM>.<SPAN>&nbsp;</SPAN></P>
<P><SPAN>&#26412;&#36136;&#19978;&#26469;&#35828;&#65292;&#24191;&#25773;&#22495;&#25351;&#30340;&#26159;&#19968;&#20010;&#36923;&#36753;&#19978;&#34987;&#21010;&#20998;&#30340;&#32593;&#32476;&#65292;&#23427;&#38656;&#35201;&#28385;&#36275;&#19968;&#28857;&#65306;&#32593;&#32476;&#19978;&#30340;&#25152;&#26377;&#33410;&#28857;&#37117;&#33021;&#36890;&#36807;&#38142;&#36335;&#23618;&#24191;&#25773;&#30340;&#24418;&#24335;&#30456;&#20114;&#36890;&#20449;</SPAN></P></SPAN></EM>
<P><SPAN></SPAN><EM><SPAN class=extract>&nbsp;</P>
<P><EM>VLANs function by tagging every frame with a VLAN tag and designing the network such that it takes these tags into account while performing routing and forwarding.</EM><SPAN>&nbsp;</SPAN></P>
<P><SPAN>VLAN &#20026;&#20102;&#33021;&#23454;&#29616;&#20854;&#21151;&#33021;&#65292;&#22312;&#21407;&#26377;&#32593;&#32476;&#35774;&#22791;&#30340;&#22522;&#30784;&#19978;&#22686;&#21152;&#20102;&#19968;&#20123;&#19996;&#35199;&#65306;&#65288;1&#65289;&#20026;&#38142;&#36335;&#23618;&#25968;&#25454;&#24103;&#21152;&#19978; VLAN &#26631;&#35760;&#65292;&#65288;2&#65289;&#20196;&#32593;&#32476;&#22312;&#36335;&#30001;&#21644;&#36716;&#21457;&#30340;&#26102;&#20505;&#23558; VLAN &#26631;&#35760;&#32435;&#20837;&#32771;&#37327;&#33539;&#22260;</SPAN></P></SPAN></EM><SPAN class=extract>
<P>In simple terms, VLAN segregates traffic within a network.</P>
<P>&#31616;&#21333;&#26469;&#35828;&#65292;VLAN &#23558;&#29289;&#29702;&#24191;&#25773;&#22495;&#20869;&#30340;&#27969;&#37327;&#36827;&#34892;&#20102;&#19968;&#23450;&#31243;&#24230;&#30340;&#21010;&#20998;</P></SPAN>