Worse, suppose that a thread frees its own state? Can the thread finish running the code in thread_exit&nbsp;if it does not have a stack? What happens if an interrupt occurs just after the running thread&#8217;s stack has been de-allocated? If the context switch code tries to save the current thread&#8217;s state, it will be writing to de-allocated memory, possibly to storage that another processor has re-allocated for some other data structure. The result could be corrupted memory, where the specific behavior depends on the precise sequence of events. Needless to say, such a bug would be very difficult to locate. 
<P></P>
<P>&#36825;&#37324;&#25552;&#21040;&#20102;&#19968;&#31181;&#26356;&#21152;&#31967;&#31957;&#30340;&#24773;&#20917;&#65292;&#22914;&#26524;&#32447;&#31243;&#22312;&#37322;&#25918;&#20013;&#26029;&#26632;&#20043;&#21518;&#65292;&#22312;&#25191;&#34892;&#23436;&#27605; thread_exit &#20043;&#21069;&#65292;&#20013;&#26029;&#21457;&#29983;&#20102;&#65292;&#37027;&#20040;&#32771;&#34385;&#21040;&#19978;&#19979;&#25991;&#20999;&#25442;&#30340;&#26102;&#20505;&#20869;&#26680;&#38656;&#35201;&#23558;&#32447;&#31243;&#29366;&#24577;&#20445;&#23384;&#21040;&#20013;&#26029;&#26632;&#37324;&#36793;&#65288;&#24819;&#24819;&#37027;&#24352;&#22270;&#65292;&#27599;&#20010;&#32447;&#31243;&#37117;&#26377;&#30528;&#33258;&#24049;&#30340;&#20013;&#26029;&#26632;&#65289;&#30828;&#20214;&#21644;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#20250;&#23558;&#32447;&#31243;&#29366;&#24577;&#20445;&#23384;&#21040;&#36825;&#20010;&#24050;&#32463;&#34987;&#37322;&#25918;&#20102;&#30340;&#20869;&#23384;&#31354;&#38388;&#12290;&#26356;&#26377;&#21487;&#33021;&#30340;&#26159;&#65292;&#36825;&#20010;&#31354;&#38388;&#24050;&#32463;&#34987;&#20854;&#20182;&#32447;&#31243;&#25152;&#20351;&#29992;&#20102;&#65292;&#20063;&#23601;&#26159;&#35828;&#65292;&#36825;&#21487;&#33021;&#20250;&#36896;&#25104;&#24847;&#26009;&#20043;&#22806;&#30340;&#25968;&#25454;&#35206;&#30422;&#29616;&#35937;</P>
<P>&#24635;&#30340;&#26469;&#35828;&#65292;&#26681;&#25454;&#19978;&#38754;&#30340;&#20363;&#23376;&#20854;&#23454;&#19981;&#38590;&#30475;&#20986;&#65292;&#22914;&#26524;&#19981;&#33021;&#20445;&#35777;&#20013;&#26029;&#30456;&#23545;&#20110;&#32447;&#31243;&#30340;&#36864;&#20986;&#25805;&#20316;&#26159;&#36879;&#26126;&#30340;&#65292;&#37027;&#20040;&#23601;&#20250;&#24341;&#21457;&#35768;&#22810;&#38590;&#20197;&#23519;&#35273;&#30340;&#38382;&#39064;</P>
<P><SPAN class=extract>&#20026;&#20160;&#20040;&#19981;&#33021;&#35753;&#32447;&#31243;&#33258;&#24049;&#37322;&#25918;&#33258;&#24049;&#65311;&#22914;&#26524;&#32447;&#31243;&#22312;&#25191;&#34892;&#37322;&#25918;&#25805;&#20316;&#30340;&#36807;&#31243;&#20013;&#34987;&#20013;&#26029;&#20102;&#65292;&#37027;&#20040;&#23601;&#26377;&#21487;&#33021;&#24341;&#21457;&#38590;&#20197;&#39044;&#26009;&#30340;&#21518;&#26524;</SPAN>