<B>Decreasing the number of virtual processors.</B> When the kernel preempts a virtual processor (e.g., to give the processor to a different process), the kernel makes an upcall on one of the other processors assigned to the parallel program. The thread system can then move the preempted user-level thread onto the ready list, so that a different processor can run it. 
<P></P>
<P>&#24403;&#20869;&#26680;&#25250;&#20808;&#19968;&#20010;&#34394;&#25311;&#22788;&#29702;&#22120;&#26102;&#65288;&#31867;&#20284;&#20110;&#20043;&#21069;&#25552;&#21040;&#30340; time-slice&#65289;&#20869;&#26680;&#23601;&#38656;&#35201;&#28608;&#27963;&#20854;&#20182;&#32473;&#20104;&#35813;&#31243;&#24207;&#30340;&#34394;&#25311;&#22788;&#29702;&#22120;&#65292;&#35813;&#31243;&#24207;&#30340;&#32447;&#31243;&#31995;&#32479;&#23601;&#33021;&#23558;&#34987;&#25250;&#20808;&#30340;&#29992;&#25143;&#32423;&#32447;&#31243;&#31227;&#21160;&#21040;&#31561;&#24453;&#38431;&#21015;&#20013;&#65288;&#23454;&#38469;&#19978;&#23601;&#26159;&#35753;&#32447;&#31243;&#31995;&#32479;&#30340;&#35843;&#24230;&#22120;&#25110;&#32773;&#35828;&#21035;&#30340;&#32447;&#31243;&#23558;&#36825;&#20010;&#32447;&#31243;&#30340;&#29366;&#24577;&#20445;&#23384;&#21040;&#20854;&#23545;&#24212;&#30340; TCB &#20013;&#65289;&#36825;&#26679;&#20854;&#20182;&#34394;&#25311;&#22788;&#29702;&#22120;&#23601;&#33021;&#36816;&#34892;&#36825;&#20010;&#32447;&#31243;&#20102;</P>
<P><SPAN class=extract>&#22914;&#26524;&#20869;&#26680;&#20915;&#23450;&#22238;&#25910;&#26576;&#20010;&#20869;&#26680;&#32447;&#31243;&#65288;&#21487;&#33021;&#26159;&#20379;&#20854;&#20182;&#22810;&#32447;&#31243;&#31243;&#24207;&#25152;&#20351;&#29992;&#65289;&#20869;&#26680;&#20250;&#35753;&#29992;&#25143;&#32423;&#32447;&#31243;&#31995;&#32479;&#20445;&#23384;&#35813;&#20869;&#26680;&#32447;&#31243;&#65288;&#23454;&#38469;&#19978;&#36816;&#34892;&#20110;&#20854;&#19978;&#30340;&#29992;&#25143;&#32447;&#31243;&#65289;&#30340;&#29366;&#24577;</SPAN></P>
<P><SPAN class=extract>&#20026;&#20102;&#38450;&#27490;&#20869;&#26680;&#22238;&#25910;&#26576;&#20010;&#20869;&#26680;&#32447;&#31243;&#30340;&#26102;&#20505;&#23548;&#33268;&#36816;&#34892;&#22312;&#20854;&#19978;&#30340;&#29992;&#25143;&#32447;&#31243;&#34987;&#24847;&#22806;&#38459;&#22622;&#65292;&#20869;&#26680;&#38656;&#35201;&#36890;&#30693;&#29992;&#25143;&#32423;&#32447;&#31243;&#35843;&#24230;&#31995;&#32479;&#65292;&#20196;&#20854;&#20445;&#23384;&#35813;&#29992;&#25143;&#32447;&#31243;&#29366;&#24577;</SPAN></P>
<P><SPAN class=extract>&#22914;&#26524;&#20869;&#26680;&#20915;&#23450;&#22238;&#25910;&#26576;&#20010;&#20869;&#26680;&#32447;&#31243;&#65288;&#21487;&#33021;&#26159;&#20379;&#20854;&#20182;&#22810;&#32447;&#31243;&#31243;&#24207;&#25152;&#20351;&#29992;&#65289;&#20869;&#26680;&#20250;&#22914;&#20309;&#36890;&#30693;&#29992;&#25143;&#32423;&#32447;&#31243;&#31995;&#32479;&#65311;&#22312;&#20854;&#20182;&#37197;&#32473;&#35813;&#36827;&#31243;&#30340;&#20869;&#26680;&#32447;&#31243;&#19978;&#25191;&#34892;&#19978;&#34892;&#35843;&#29992;</SPAN></P>
<P>&#34394;&#25311;&#22788;&#29702;&#22120;&#22522;&#26412;&#19978;&#30456;&#24403;&#20110;&#29289;&#29702;&#22788;&#29702;&#22120;&#65292;&#19981;&#21516;&#20043;&#22788;&#22312;&#20110;&#20869;&#26680;&#21487;&#20197;&#25353;&#29031;&#38656;&#35201;&#65292;&#30830;&#23450;&#23558;&#36825;&#20010;&#34394;&#25311;&#22788;&#29702;&#22120;&#32473;&#21738;&#20010;&#31243;&#24207;&#12290;&#25105;&#24819;&#36825;&#22823;&#27010;&#26159;&#30456;&#24403;&#20110;&#26576;&#31181;&#23545;&#31639;&#21147;&#30340;&#37327;&#21270;&#65292;&#20869;&#26680;&#21487;&#20197;&#20915;&#23450;&#23558;&#36825;&#37096;&#20998;&#31639;&#21147;&#22312;&#19981;&#21516;&#36827;&#31243;&#38388;&#36890;&#36807;&#34394;&#25311;&#22788;&#29702;&#22120;&#30340;&#26041;&#24335;&#36827;&#34892;&#36716;&#31227;</P>
<P>&#21487;&#26159;&#20026;&#20160;&#20040;&#35201;&#29992;&#34394;&#25311;&#22788;&#29702;&#22120;&#32780;&#19981;&#26159;&#29289;&#29702;&#22788;&#29702;&#22120;&#65292;&#20004;&#32773;&#26377;&#20160;&#20040;&#21306;&#21035;&#21602;&#65311;