&#9632;<SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> ever</SPAN></FONT> 
<P></P>
<P>
<P>&#20316;&#20026;&#21103;&#35789;&#65292;ever&#21487;&#20197;&#20462;&#39280;&#21160;&#35789;&#65292;&#20063;&#21487;&#20197;&#20462;&#39280;&#24418;&#23481;&#35789;&#12289;&#21478;&#19968;&#21103;&#35789;&#25110;&#26576;&#20010;&#21103;&#35789;&#30701;&#35821;&#12290;&#23427;&#30340;&#29992;&#27861;&#65292;&#20013;&#22269;&#20154;&#36739;&#38590;&#25417;&#25720;&#12290;&#29616;&#20998;&#36848;&#22914;&#19979;&#65306;</P>
<P>
<P>1. &#20462;&#39280;&#21160;&#35789;&#12290;&#25152;&#20462;&#39280;&#30340;&#21160;&#35789;&#65292;&#22522;&#26412;&#19978;&#26159;&#30636;&#38388;&#21160;&#35789;&#65292;&#21363;&#20351;&#20010;&#21035;&#22330;&#21512;&#26159;&#24310;&#32493;&#20307;&#30340;&#38745;&#24577;&#21160;&#35789;&#65292;&#20063;&#26159;&#20020;&#26102;&#20511;&#29992;&#65292;&#36171;&#20104;&#21160;&#24577;&#24847;&#20041;&#30340;&#12290;ever&#20316;&#20026;&#20462;&#39280;&#21160;&#35789;&#30340;&#21103;&#35789;&#65292;&#20854;&#35789;&#20041;&#34920;&#31034;&#36807;&#21435;&#25110;&#23558;&#26469;&#21487;&#33021;&#28041;&#21450;&#30340;&#20219;&#20309;&#19968;&#20010;&#26102;&#38388;&#28857;&#21457;&#29983;&#26576;&#20107;&#12290;&#22914;&#26524;&#26159;&#36807;&#21435;&#65292;&#34920;&#31034;&#36807;&#21435;&#26366;&#26377;&#30340;&#32463;&#21382;&#65292;&#20013;&#25991;&#22823;&#20307;&#19978;&#30456;&#24403;&#20110;&#8220;&#26366;&#32463;&#8221;&#12289;&#8220;&#36807;&#8221;&#12290;&#20294;&#26159;ever&#22312;&#35821;&#27861;&#20013;&#26159;&#19968;&#20010;&#8220;&#21542;&#23450;&#26497;&#24615;&#39033;&#8221;&#65288;negative polarity item, NPI&#65292;&#22269;&#20869;&#26377;&#35793;&#20026;&#8220;&#36127;&#26497;&#35789;&#8221;&#30340;)&#65289;&#12290;&#25152;&#35859;&#8220;&#21542;&#23450;&#26497;&#24615;&#39033;&#8221;&#65292;&#26159;&#8220;&#26497;&#24615;&#39033;&#8221;(polarity item) &#24403;&#20013;&#30340;&#19968;&#31181;&#12290;&#8220;&#26497;&#24615;&#39033;&#8221;&#26159;&#21477;&#20013;&#24517;&#39035;&#20381;&#36182;&#21478;&#19968;&#20010;&#35821;&#20041;&#25104;&#20998;&#30340;&#20986;&#29616;&#33258;&#24049;&#25165;&#33021;&#20986;&#29616;&#30340;&#25104;&#20998;&#65307;&#20854;&#20013;&#8220;&#21542;&#23450;&#26497;&#24615;&#39033;&#8221;&#38500;&#20102;ever&#65292;&#36824;&#26377;yet, any&#65288;&#21253;&#25324;anything, anyone, anybody, anywhere&#31561;&#65289;&#65292;&#21482;&#33021;&#20986;&#29616;&#22312;&#21542;&#23450;&#21477;&#65288;&#19982;&#21542;&#23450;&#35789;&#19968;&#36215;&#30456;&#24403;&#20110;never&#65289;&#12289;&#19968;&#33324;&#30097;&#38382;&#21477;&#12289;&#26465;&#20214;&#20174;&#21477;&#20197;&#21450;&#20854;&#20182;&#24102;&#26377;&#30097;&#38382;&#25110;&#21542;&#23450;&#21475;&#27668;&#30340;&#21477;&#23376;&#20013;&#65292;&#19968;&#33324;&#19981;&#20986;&#29616;&#22312;&#32943;&#23450;&#21477;&#20013;&#65292;<SPAN class=extract>&#20294;&#26159;&#22312;&#26412;&#26469;&#19981;&#35201;&#27714;&#26377;ever&#30340;&#21465;&#36848;&#36807;&#21435;&#20107;&#23454;&#30340;&#32943;&#23450;&#21477;&#65292;&#21152;&#36827;ever&#65292;&#21487;&#20197;&#34920;&#31034;&#19981;&#28385;&#12289;&#24868;&#24594;&#65292;&#20013;&#25991;&#21487;&#20197;&#35793;&#25104;&#8220;&#31455;&#28982;&#8221;&#12290;&#12304;&#20363;&#22914;&#12305;He was shocked at the thought that the material might ever be used in such a way. &#20182;&#19968;&#24819;&#21040;&#65292;&#36825;&#19968;&#26448;&#26009;&#31455;&#28982;&#21487;&#33021;&#34987;&#25343;&#26469;&#20316;&#36825;&#31181;&#29992;&#36884;&#65292;&#23601;&#24863;&#21040;&#38663;&#24778;&#12290;/ I was a fool ever to marry her. &#25105;&#24403;&#26102;&#31455;&#28982;&#21516;&#22905;&#32467;&#23130;&#65292;&#22826;&#24858;&#34850;&#20102;&#12290;</SPAN> 
<P></P><SPAN class=extract>ever&#22312;&#32943;&#23450;&#21477;&#20013;&#20063;&#21487;&#20197;&#30456;&#24403;&#20110;always&#12290;&#12304;&#20363;&#22914;&#12305;his ever open notebook&#20182;&#30340;&#37027;&#26412;&#32769;&#26159;&#25171;&#24320;&#30340;&#31508;&#35760;&#26412; / The pendulum swings backwards and forwards. The circle is ever travelled anew. (Somerset Maugham, The Moon and Sixpence, Chapter II) &#38047;&#25670;&#25670;&#36807;&#26469;&#21448;&#33633;&#36807;&#21435;&#65292;&#36825;&#19968;&#26053;&#31243;&#27704;&#36828;&#21453;&#22797;&#24490;&#29615;&#12290;</SPAN> 
<P></P>
<P>
<P>&#65288;a&#65289;&#22312;&#21542;&#23450;&#21477;&#20013;&#65306;&#30001;&#20110;ever&#34920;&#31034;&#22312;&#26576;&#19968;&#27573;&#26102;&#38388;&#38271;&#24230;&#24403;&#20013;&#26576;&#19968;&#19981;&#30830;&#23450;&#30340;&#26102;&#38388;&#28857;&#19978;&#21457;&#29983;&#30340;&#26576;&#20107;&#65288;&#21448;&#22312;&#21477;&#20013;&#34987;&#21542;&#23450;&#65289;&#65292;&#22240;&#27492;&#65292;&#23454;&#38469;&#29983;&#27963;&#20013;&#26368;&#24120;&#35265;&#30340;&#20107;&#20363;&#65292;&#23601;&#26159;&#20174;&#29616;&#22312;&#36825;&#20010;&#26102;&#38388;&#28857;&#65288;&#25110;&#26159;&#36807;&#21435;&#19968;&#20010;&#29305;&#23450;&#30340;&#26102;&#38388;&#28857;&#65289;&#65292;&#22238;&#39038;&#20197;&#24448;&#19968;&#27573;&#26377;&#38480;&#25110;&#26080;&#38480;&#30340;&#26102;&#27573;&#65292;&#34920;&#31034;&#22312;&#36825;&#25972;&#27573;&#26102;&#27573;&#24403;&#20013;&#19968;&#30452;&#27809;&#26377;&#21457;&#29983;&#26576;&#20107;&#12290;&#34920;&#29616;&#22312;&#21160;&#35789;&#26102;&#24577;&#19978;&#65292;&#23601;&#26159;&#29616;&#22312;&#23436;&#25104;&#26102; (present perfect) &#25110;&#26159;&#36807;&#21435;&#23436;&#25104;&#26102; (past perfect) &#65292;&#36825;&#26159;&#26368;&#20026;&#24120;&#35265;&#19982;ever&#19968;&#36215;&#22312;&#21542;&#23450;&#21477;&#20013;&#20986;&#29616;&#30340;&#21160;&#35789;&#26102;&#24577;&#12290;</P>
<P>&#65288;a1&#65289;&#19982;&#29616;&#22312;&#25110;&#36807;&#21435;&#23436;&#25104;&#26102;&#19968;&#36215;&#12290;&#12304;&#20363;&#22914;&#12305;I haven't ever been there. &#25105;&#20174;&#26469;&#27809;&#26377;&#21040;&#36807;&#37027;&#37324;&#12290;/ Nothing like it had ever been built before. &#20197;&#21069;&#20174;&#26469;&#27809;&#26377;&#20852;&#24314;&#36807;&#31867;&#20284;&#36825;&#26679;&#30340;&#19996;&#35199;&#12290;</P><SPAN class=extract>
<P>&#20854;&#27425;&#30340;&#21160;&#35789;&#26102;&#24577;&#65292;&#23601;&#26159;&#19968;&#33324;&#23558;&#26469;&#26102;&#65288;&#34987;&#21542;&#23450;&#21518;&#30456;&#24403;&#20110;never&#65292;&#26082;&#34920;&#31034;&#8220;&#27704;&#19981;&#8221;&#65292;&#20063;&#34920;&#31034;&#8220;&#32477;&#19981;&#8221;&#65289;&#12290;</P>
<P>&#65288;a2&#65289;&#19982;&#19968;&#33324;&#23558;&#26469;&#26102;&#19968;&#36215;&#12290;&#12304;&#20363;&#22914;&#12305;I don't think I'll ever be homesick here. &#25105;&#35273;&#24471;&#25105;&#21040;&#20102;&#36825;&#37324;&#19981;&#20250;&#24819;&#23478;&#30340;&#12290;</P></SPAN><SPAN class=extract>
<P>&#20877;&#20854;&#27425;&#30340;&#21160;&#35789;&#26102;&#24577;&#65292;&#26159;&#19968;&#33324;&#29616;&#22312;&#26102;&#20197;&#21450;&#19968;&#33324;&#36807;&#21435;&#26102;&#12290;&#29992;&#21518;&#38754;&#36825;&#20004;&#20010;&#26102;&#24577;&#30340;&#26102;&#20505;&#65292;ever&#30340;&#26102;&#38388;&#24847;&#20041;&#20943;&#24369;&#65292;&#32780;&#22686;&#28155;&#20102;&#21152;&#24378;&#21542;&#23450;&#30340;&#35821;&#27668;&#24847;&#20041;&#12290;</P>
<P>
<P>&#65288;a3&#65289;&#19982;&#19968;&#33324;&#29616;&#22312;&#26102;&#19968;&#36215;&#65292;&#22686;&#28155;&#20102;&#19968;&#28857;&#21152;&#24378;&#21542;&#23450;&#30340;&#35821;&#27668;&#12290;&#12304;&#20363;&#22914;&#12305;Nothing exciting ever happens to me. &#25105;&#27809;&#26377;&#20160;&#20040;&#35273;&#24471;&#20852;&#22859;&#30340;&#20107;&#12290;/ Nobody ever comes to see us in this out-of-the-way village. &#35841;&#20063;&#19981;&#21040;&#36825;&#20010;&#20559;&#20731;&#30340;&#23567;&#26449;&#26469;&#30475;&#25105;&#20204;&#12290;</P>
<P></SPAN>
<P></P><SPAN class=extract>&#65288;a4&#65289;&#19982;&#21542;&#23450;&#20102;&#30340;&#19968;&#33324;&#36807;&#21435;&#26102;&#19968;&#36215;&#65292;&#36825;&#20010;&#36807;&#21435;&#26102;&#65292;&#21487;&#20197;&#26159;&#23601;&#36807;&#21435;&#30340;&#35821;&#22659;&#35828;&#36807;&#21435;&#12290;&#12304;&#20363;&#22914;&#12305;... To Let To Let To Let, glared at me from empty rooms, as if no new wretches ever came there... (Charles Dickens, Great Expectations) &#8230;&#8220;&#20986;&#31199;&#8221;&#65292;&#8220;&#20986;&#31199;&#8221;&#65292;&#8220;&#20986;&#31199;&#8221;&#30340;&#23383;&#26679;&#65292;&#20174;&#31354;&#31354;&#22914;&#20063;&#30340;&#25151;&#38388;&#37027;&#37324;&#27880;&#35270;&#30528;&#25105;&#65292;&#20223;&#20315;&#20877;&#20063;&#27809;&#26377;&#26032;&#30340;&#33853;&#38590;&#20154;&#21040;&#27492;&#22320;&#26469;&#20102;&#8230;&#20063;&#21487;&#20197;&#26159;&#23601;&#29616;&#22312;&#30340;&#35821;&#22659;&#35828;&#36807;&#21435;&#12290;&#12304;&#20363;&#22914;&#12305;For no prophecy ever came by the will of man: but men spake from God, being moved by the Holy Spirit.&#65288;&#12298;&#22307;&#32463;&#183;&#24444;&#24471;&#21518;&#20070;&#12299;&#65292;&#19968;&#31456;21&#33410;&#65289;&#22240;&#20026;&#39044;&#35328;&#20174;&#26469;&#27809;&#26377;&#20986;&#20110;&#20154;&#24847;&#30340;&#65292;&#20035;&#26159;&#20154;&#34987;&#22307;&#28789;&#24863;&#21160;&#65292;&#35828;&#20986;&#31070;&#30340;&#35805;&#26469;&#12290;</SPAN> 
<P></P>
<P>
<P><SPAN class=extract>&#65288;a5&#65289;&#20063;&#21487;&#20197;ever&#22312;&#20174;&#21477;&#32780;&#21542;&#23450;&#22312;&#20027;&#21477;&#12290;&#12304;&#20363;&#22914;&#12305;Neither she nor her friend had believed they would ever be invited. &#22905;&#21644;&#22905;&#30340;&#26379;&#21451;&#21407;&#20808;&#37117;&#20197;&#20026;&#33258;&#24049;&#19981;&#20250;&#34987;&#36992;&#35831;&#12290;</SPAN></P>
<P>
<P>&#65288;b&#65289;&#22312;&#30097;&#38382;&#21477;&#20013;&#65306;</P>
<P>
<P>&#65288;b1&#65289;&#26368;&#24120;&#20986;&#29616;&#30340;&#21160;&#35789;&#26102;&#24577;&#65292;&#20173;&#28982;&#26159;&#29616;&#22312;&#25110;&#36807;&#21435;&#23436;&#25104;&#26102;&#12290;&#12304;&#20363;&#22914;&#12305;Have you ever been to Naples? &#20320;&#21040;&#36807;&#37027;&#19981;&#21202;&#26031;&#21527;&#65311;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65306;&#31532;&#19968;&#65292;&#36825;&#20010;ever&#22312;&#30097;&#38382;&#21477;&#20013;&#20351;&#29992;&#26159;&#27491;&#30830;&#30340;&#12290;&#20294;&#26159;&#27491;&#38754;&#35828;&#26126;&#26102;&#29992;&#30340;&#26159;&#38472;&#36848;&#21477;&#65292;&#23601;&#19981;&#21487;&#20197;&#22871;&#29992;&#30097;&#38382;&#21477;&#30340;ever&#20102;&#65306;*I have ever been to Naples. &#31532;&#20108;&#65292;&#21516;ever&#30456;&#21628;&#24212;&#65292;&#21160;&#35789;&#26102;&#24577;&#20351;&#29992;&#29616;&#22312;&#23436;&#25104;&#26102;&#65292;&#27809;&#26377;&#26126;&#30830;&#30340;&#26102;&#38388;&#26694;&#26694;&#12290;&#22914;&#26524;&#26377;&#20102;&#19968;&#20010;&#26102;&#38388;&#26694;&#26694;&#65292;&#21160;&#35789;&#26102;&#24577;&#23601;&#19981;&#33021;&#29992;&#29616;&#22312;&#23436;&#25104;&#26102;&#65292;&#32780;&#35201;&#29992;&#19968;&#33324;&#36807;&#21435;&#26102;&#65292;&#23613;&#31649;&#39588;&#28982;&#30475;&#26469;&#21516;ever&#25152;&#35201;&#27714;&#30340;&#21160;&#35789;&#26102;&#24577;&#19981;&#31526;&#12290;&#12304;&#20363;&#22914;&#12305;Did you ever visit Naples while you were in Europe? &#20320;&#22312;&#27431;&#27954;&#26102;&#26377;&#27809;&#26377;&#35775;&#38382;&#36807;&#37027;&#19981;&#21202;&#26031;&#65311;</P>
<P>
<P><SPAN class=extract>&#65288;b2&#65289;&#19968;&#33324;&#23558;&#26469;&#26102;&#65292;&#24847;&#20041;&#25110;&#32773;&#26159;&#38382;&#26159;&#21542;&#8220;&#26377;&#26397;&#19968;&#26085;&#65288;&#22312;&#26576;&#19968;&#20010;&#26410;&#23450;&#30340;&#26102;&#38388;&#28857;&#65292;&#25918;&#22312;&#19968;&#20010;&#30028;&#38480;&#19981;&#26126;&#30340;&#26102;&#27573;&#20013;&#65289;&#8221;&#20250;&#21457;&#29983;&#26576;&#20107;&#65292;&#25110;&#32773;&#26159;&#38382;&#26159;&#21542;&#8220;&#22312;&#24403;&#21069;&#24050;&#32463;&#28041;&#21450;&#30340;&#36825;&#20010;&#21333;&#29420;&#30340;&#23558;&#26469;&#22330;&#21512;&#8221;&#20250;&#21457;&#29983;&#26576;&#20107;&#65288;&#20063;&#26159;&#20010;&#26102;&#38388;&#28857;&#65292;&#20294;&#21364;&#26159;&#24050;&#23450;&#30340;&#65292;&#27809;&#26377;&#25918;&#22312;&#19968;&#20010;&#30028;&#38480;&#19981;&#26126;&#30340;&#26102;&#27573;&#20013;&#65289;&#12290;&#21069;&#32773;&#20363;&#22914;&#65306;Shall we ever meet again? &#21681;&#20204;&#36824;&#20250;&#20877;&#35265;&#38754;&#21527;&#65311;&#65288;&#25351;&#23558;&#26469;&#19981;&#30693;&#20309;&#26102;&#65289;&#21518;&#32773;&#20363;&#22914;&#65306;Will we ever get there? &#21681;&#20204;&#21040;&#24471;&#20102;&#37027;&#37324;&#21527;&#65311;&#65288;&#25351;&#24403;&#21069;&#36825;&#19968;&#27425;&#65289;</SPAN></P>
<P>
<P>&#65288;b3&#65289;&#19968;&#33324;&#29616;&#22312;&#26102;&#65306;&#36825;&#26679;&#30340;&#38382;&#21477;&#65292;&#32943;&#23450;&#26102;ever&#32473;&#21477;&#23376;&#22686;&#28155;&#19968;&#28857;&#8220;&#20598;&#23572;&#65288;&#19981;&#27490;&#19968;&#27425;&#65292;&#20294;&#19981;&#20316;&#20026;&#26085;&#24120;&#29983;&#27963;&#25110;&#24037;&#20316;&#30340;&#37325;&#35201;&#20869;&#23481;&#65289;&#8221;&#30340;&#21475;&#27668;&#12290;&#12304;&#20363;&#22914;&#12305;Do you ever go to the movies? &#20320;&#65288;&#26377;&#26102;&#20505;&#65289;&#30475;&#30475;&#30005;&#24433;&#21527;&#65311;&#23601;&#27604;Do you go to the movies? &#65288;&#20320;&#30340;&#29983;&#27963;&#20013;&#30475;&#30005;&#24433;&#26159;&#21542;&#19968;&#39033;&#20869;&#23481;&#65311;&#65289;&#35821;&#27668;&#32531;&#21644;&#19968;&#20123;&#12290;&#20294;&#26377;&#26102;&#20505;&#20063;&#26377;&#24102;&#28857;&#8220;&#35749;&#35773;&#8221;&#30340;&#21475;&#27668;&#65292;&#34920;&#31034;&#8220;&#22823;&#27010;&#24635;&#20250;&#22914;&#27492;&#21543;&#8221;&#12290;&#12304;&#20363;&#22914;&#12305;Do your neighbors ever sleep? &#20320;&#30340;&#37051;&#23621;&#20204;&#24635;&#35201;&#30561;&#35273;&#30340;&#21543;&#65311;&#22914;&#26524;&#26159;&#21542;&#23450;&#30340;&#19968;&#33324;&#30097;&#38382;&#21477;&#65288;&#21363;&#26159;&#21542;&#38382;&#21477;&#65289;&#65292;&#21017;&#22686;&#28155;&#19968;&#28857;&#8220;&#38590;&#36947;&#19981;&#8221;&#30340;&#35821;&#27668;&#12290;&#12304;&#20363;&#22914;&#12305;Kids often ask me, how do you write so many books? Don't you ever run out of ideas? (Mary Pope Osborne) &#23401;&#23376;&#20204;&#24120;&#24120;&#38382;&#25105;&#65292;&#20320;&#24590;&#33021;&#20889;&#20986;&#36825;&#20040;&#22810;&#30340;&#20070;&#21568;&#65311;&#20320;&#38590;&#36947;&#19981;&#20250;&#25165;&#24605;&#26543;&#31469;&#21527;&#65311;/ Don't you ever feel like it's a waste of time for you to keep on doing so? &#20320;&#38590;&#36947;&#19981;&#35273;&#24471;&#65292;&#32487;&#32493;&#36825;&#26679;&#24178;&#26159;&#30333;&#36153;&#26102;&#38388;&#21527;&#65311;&#22914;&#26524;&#26159;&#21542;&#23450;&#30340;&#29305;&#27530;&#30097;&#38382;&#21477;&#65288;&#29992;&#30097;&#38382;&#35789;&#24320;&#22836;&#65289;&#65292;&#20063;&#24102;&#26377;&#36136;&#38382;&#65288;&#8220;&#24178;&#22043;&#8221;&#65289;&#30340;&#35821;&#27668;&#12290;&#12304;&#20363;&#22914;&#12305;Why don't you ever say something about the price? &#20320;&#24178;&#22043;&#19981;&#35848;&#35848;&#20215;&#26684;&#65311;</P>
<P>
<P>&#65288;b4&#65289;&#19968;&#33324;&#36807;&#21435;&#26102;&#65306;&#36739;&#23569;&#20351;&#29992;&#65292;&#29992;&#26102;&#24448;&#24448;&#24102;&#26377;&#39044;&#20808;&#34920;&#31034;&#24576;&#30097;&#25110;&#21542;&#23450;&#30340;&#8220;&#21453;&#35821;&#8221;&#35821;&#27668;&#12290;&#12304;&#20363;&#22914;&#12305;Did he ever tell you? &#20182;&#30495;&#30340;&#21578;&#35785;&#20102;&#20320;&#21527;&#65311;/ Did you ever see such big ears? &#36825;&#26679;&#30340;&#22823;&#32819;&#26421;&#65292;&#20320;&#24656;&#24597;&#20174;&#26469;&#27809;&#35265;&#36807;&#21543;&#12290;&#31867;&#20284;&#21518;&#38754;&#19968;&#21477;&#36825;&#26679;&#30340;&#21477;&#23376;&#65292;&#21487;&#20197;&#31616;&#32553;&#20026;Did you ever?</P>
<P>
<P>&#65288;b5&#65289;&#20197;&#19978;&#35848;&#30340;&#37117;&#26159;&#19968;&#33324;&#30097;&#38382;&#21477;&#65288;&#21363;&#8220;yes-no&#8221;&#30097;&#38382;&#21477;&#12290;&#33267;&#20110;&#29305;&#27530;&#30097;&#38382;&#21477;&#65288;&#20197;&#30097;&#38382;&#35789;&#24320;&#22987;&#30340;&#30097;&#38382;&#21477;&#65289;&#20013;&#30340;ever&#65292;&#24847;&#20041;&#20063;&#21516;&#26679;&#26377;&#24378;&#35843;&#20854;&#8220;&#31455;&#28982;&#22914;&#27492;&#8221;&#30340;&#25104;&#20998;&#12290;&#12304;&#20363;&#22914;&#12305;I would give the world to get that letter back unread. Why did I ever write it?(Herman Wouk, War and Remembrance, p. 5&#65289;&#25105;&#30495;&#24680;&#19981;&#24471;&#36225;&#20449;&#36824;&#27809;&#26377;&#34987;&#25286;&#24320;&#30475;&#20043;&#21069;&#25226;&#23427;&#24324;&#22238;&#26469;&#12290;&#25105;&#24590;&#30340;&#31455;&#28982;&#20889;&#20102;&#36825;&#26679;&#30340;&#20449;&#65311;</P>
<P>
<P>&#65288;c&#65289;&#22312;&#31048;&#20351;&#21477;&#65288;&#24517;&#39035;&#26159;&#21542;&#23450;&#30340;&#65289;&#20013;&#65292;ever&#36215;&#30528;&#21152;&#24378;&#21149;&#38459;&#35821;&#27668;&#30340;&#20316;&#29992;&#12290;&#12304;&#20363;&#22914;&#12305;He is a good man. Don't ever lose him. &#20182;&#26159;&#20010;&#22909;&#20154;&#12290;&#21315;&#19975;&#21035;&#22833;&#21435;&#20182;&#12290;/ Don't ever (= Never) do that kind of thing again. &#37027;&#26679;&#30340;&#20107;&#24773;&#21315;&#19975;&#21035;&#20877;&#20570;&#20102;&#12290;</P>
<P>
<P>&#65288;d&#65289;&#21516;&#20934;&#21542;&#23450;&#36830;&#29992;&#65292;&#34920;&#31034;&#8220;&#24456;&#19981;&#24120;&#8221;&#65306;&#26368;&#26222;&#36890;&#30340;&#20934;&#21542;&#23450;&#35789;&#26159;&#20154;&#25152;&#20849;&#30693;&#30340;hardly, scarcely, unlikely, few, only&#31561;&#12290;&#12304;&#20363;&#22914;&#12305;He hardly (scarcely) ever smokes. &#20182;&#24456;&#23569;&#25277;&#28895;&#12290;/ The temperature hardly ever fell below freezing. &#27668;&#28201;&#24456;&#23569;&#20250;&#38477;&#21040;&#20912;&#28857;&#20197;&#19979;&#12290;/ He's unlikely ever to leave the psychiatric hospital. &#20182;&#19981;&#22823;&#21487;&#33021;&#20174;&#31934;&#31070;&#30149;&#38498;&#20986;&#38498;&#12290;/ Few doctors ever take the time to examine these muscles. &#24456;&#23569;&#21307;&#29983;&#36153;&#26102;&#38388;&#21435;&#26816;&#26597;&#36825;&#20123;&#32908;&#32905;&#12290;/ You had the moral courage to resign on principle, which few people ever do. &#20320;&#26377;&#36947;&#20041;&#19978;&#30340;&#21191;&#27668;&#22240;&#20026;&#21407;&#21017;&#38382;&#39064;&#32780;&#36766;&#32844;&#65292;&#36825;&#26159;&#24456;&#23569;&#20154;&#33021;&#20570;&#21040;&#30340;&#12290;/ I only ever use that on special occasions, so it's as good as new. &#25105;&#21482;&#26159;&#36935;&#21040;&#29305;&#27530;&#22330;&#21512;&#30340;&#26102;&#20505;&#29992;&#23427;&#19968;&#19979;&#65292;&#25152;&#20197;&#23427;&#36824;&#26159;&#23853;&#26032;&#30340;&#12290;/ Only the two of them ever knew it.&#21482;&#26377;&#20182;&#20204;&#20004;&#20010;&#20154;&#30693;&#36947;&#12290;</P>
<P>
<P>&#19968;&#20123;&#34920;&#31034;&#22256;&#38590;&#12289;&#24576;&#30097;&#12289;&#21306;&#21035;&#65288;&#24448;&#24448;&#37117;&#26377;&#36127;&#38754;&#30340;&#21547;&#20041;&#65289;&#30340;&#35789;&#65292;&#20063;&#21487;&#20197;&#21516;ever&#36830;&#29992;&#12290;&#12304;&#20363;&#22914;&#12305;It is difficult to imagine how the North and South could ever agree on a formula to unite the divided country. &#38590;&#20197;&#24819;&#35937;&#21335;&#21271;&#21452;&#26041;&#22914;&#20309;&#33021;&#22815;&#20849;&#21516;&#21830;&#23450;&#19968;&#20010;&#25226;&#20998;&#35010;&#30340;&#22269;&#23478;&#32479;&#19968;&#36215;&#26469;&#30340;&#26041;&#26696;&#12290;/ When Reagan announced SDI, many leading American scientists were skeptical that it could ever be made to work. &#24403;&#37324;&#26681;&#23459;&#24067;&#8220;&#25112;&#30053;&#38450;&#24481;&#26041;&#26696;&#8221;&#26102;&#65292;&#32654;&#22269;&#35768;&#22810;&#39030;&#23574;&#30340;&#31185;&#23398;&#23478;&#37117;&#24576;&#30097;&#36825;&#20010;&#26041;&#26696;&#33021;&#21542;&#34892;&#24471;&#36890;&#12290;/ And it's a different kind of threat than we've ever faced before. (Dick Cheney, Newsweek, Jan. 23, 2006, p. 48) &#36825;&#26159;&#21516;&#25105;&#20204;&#20197;&#24448;&#36935;&#21040;&#36807;&#30340;&#19981;&#21516;&#30340;&#21478;&#19968;&#31867;&#23041;&#32961;&#12290;/ It would be unrealistic to expect such a process ever to be completed. &#26399;&#24453;&#36825;&#26679;&#30340;&#19968;&#20010;&#36807;&#31243;&#33021;&#22815;&#23436;&#25104;&#65292;&#37027;&#26159;&#19981;&#29616;&#23454;&#30340;&#12290;</P>
<P>
<P>&#21478;&#22806;&#65292;&#22312;&#19968;&#20123;&#34920;&#31034;&#24778;&#35766;&#65288;&#20063;&#26159;&#36127;&#38754;&#30340;&#21547;&#20041;&#65289;&#30340;&#21160;&#35789;&#25110;&#24418;&#23481;&#35789;&#21518;&#38754;&#65292;&#24341;&#36215;&#24778;&#35766;&#30340;&#20107;&#24773;&#65292;&#21487;&#20197;&#29992;ever&#65292;&#30456;&#24403;&#20110;&#20013;&#25991;&#30340;&#8220;&#31455;&#28982;&#8221;&#12290;&#12304;&#20363;&#22914;&#12305;She was surprised / amazed that he ever drank vodka. &#30475;&#21040;&#20182;&#31455;&#28982;&#21917;&#20239;&#29305;&#21152;&#37202;&#65292;&#22905;&#24863;&#21040;&#24778;&#22855;&#12290;</P>
<P>
<P>&#20294;&#26159;&#65292;&#36824;&#26377;&#19968;&#20123;&#21035;&#30340;&#20934;&#21542;&#23450;&#35789;&#65292;&#39588;&#28982;&#30475;&#26469;&#20284;&#20046;&#27809;&#26377;&#21542;&#23450;&#30340;&#24847;&#24605;&#65292;&#23481;&#26131;&#34987;&#24573;&#35270;&#12290;&#12304;&#20363;&#22914;&#12305;I knew he was angry, before I ever entered his room. &#25105;&#36824;&#27809;&#26377;&#36827;&#20182;&#30340;&#25151;&#38388;&#65292;&#23601;&#30693;&#36947;&#20182;&#22312;&#29983;&#27668;&#12290;&#36825;&#37324;&#30340;before&#23601;&#24102;&#26377;&#19968;&#28857;&#21542;&#23450;&#30340;&#24847;&#24605;&#65288;&#21442;&#35265;before&#26465;&#20043;3. &#65289;&#12290;&#20294;&#26159;until&#23601;&#19982;before&#19981;&#21516;&#65292;&#27809;&#26377;&#21542;&#23450;&#30340;&#24847;&#24605;&#65292;&#19981;&#33021;&#21516;ever&#24182;&#29992;&#12290;&#12304;&#20363;&#22914;&#12305;I'll sleep in the living room until you (*until you ever) quit snoring. &#25105;&#35201;&#30561;&#22312;&#23458;&#21381;&#65292;&#30561;&#21040;&#20320;&#20572;&#27490;&#25171;&#21628;&#22108;&#12290;all&#26377;&#26102;&#20505;&#20063;&#26377;&#19968;&#28857;&#21542;&#23450;&#12289;&#25490;&#38500;&#30340;&#24847;&#24605;&#65288;&#21442;&#35265;all&#26465;&#20043;4. &#65289;&#12290;&#12304;&#20363;&#22914;&#12305;All they ever do is just complain. &#20182;&#20204;&#21482;&#26159;&#19968;&#21619;&#22320;&#22475;&#24616;&#12290;/ All that ever came before me are thieves and robbers: but the sheep did not hear them. &#65288;&#12298;&#22307;&#32463;&#183;&#32422;&#32752;&#31119;&#38899;&#12299;&#65292;&#21313;&#31456;8 &#33410;&#65289;&#20961;&#22312;&#25105;&#20197;&#21069;&#26469;&#30340;&#65292;&#37117;&#26159;&#36156;&#65292;&#26159;&#24378;&#30423;&#65292;&#32650;&#21364;&#19981;&#21548;&#20182;&#20204;&#12290;&#24456;&#29305;&#21035;&#30340;&#26159;&#65306;&#29978;&#33267;every&#65292;&#30001;&#20110;&#19982;all&#24847;&#20041;&#25509;&#36817;&#65292;&#20063;&#20511;&#29992;ever&#26469;&#24378;&#35843;&#20854;&#21253;&#25597;&#33539;&#22260;&#20043;&#40784;&#20840;&#65288;&#8220;&#26080;&#25152;&#19981;&#21253;&#8221;&#20063;&#23601;&#26377;&#20102;&#28857;&#21542;&#23450;&#30340;&#27668;&#24687;&#65289;&#12290;&#20294;&#26159;all&#19982;ever&#37117;&#21482;&#33021;&#29992;&#20110;&#20462;&#39280;&#8220;every + &#21517;&#35789;&#8221;&#30340;&#21518;&#32622;&#23450;&#35821;&#20174;&#21477;&#65292;&#19981;&#33021;&#29992;&#20110;&#20027;&#21477;&#12290;&#12304;&#20363;&#22914;&#12305;Every boy who ever petted a rabid dog got (*ever got) bit. &#20961;&#26159;&#25293;&#25242;&#36807;&#30127;&#29399;&#30340;&#30007;&#23401;&#23376;&#37117;&#25384;&#20102;&#21676;&#12290;/ Every student who has ever been to Rome bought (*ever bought) some postcards there. &#21435;&#36807;&#32599;&#39532;&#30340;&#23398;&#29983;&#65292;&#37117;&#22312;&#37027;&#37324;&#20080;&#20102;&#19968;&#20123;&#26126;&#20449;&#29255;&#12290;/ She sold (*ever sold) everything she'd ever bought in order to support herself through art school. &#22905;&#25226;&#33258;&#24049;&#20080;&#20102;&#30340;&#19996;&#35199;&#32479;&#32479;&#21464;&#21334;&#25481;&#65292;&#26469;&#32500;&#25345;&#25915;&#35835;&#33402;&#26415;&#23398;&#26657;&#30340;&#36153;&#29992;&#12290;&#33267;&#20110;&#19968;&#20123;&#21542;&#23450;&#24847;&#20041;&#24456;&#26126;&#26174;&#30340;&#21160;&#35789;&#65292;&#22914;deny, prevent&#31561;&#65292;&#21518;&#38754;&#21152;&#19978;ever&#21487;&#20197;&#21152;&#37325;&#21542;&#23450;&#30340;&#24847;&#24605;&#12290;&#12304;&#20363;&#22914;&#12305;He tried to prevent the news from ever reaching his parents. &#20182;&#35774;&#27861;&#38450;&#27490;&#28040;&#24687;&#20256;&#21040;&#20182;&#29238;&#27597;&#37027;&#37324;&#21435;&#12290;</P>
<P>
<P>&#65288;d&#65289;&#22312;&#24102;&#26377;&#21542;&#23450;&#24847;&#20041;&#30340;&#21160;&#35789;&#25110;&#21160;&#35789;&#35789;&#32452;&#21518;&#38754;&#65292;&#20063;&#26159;&#21152;&#37325;&#20854;&#21542;&#23450;&#21147;&#24230;&#12290;&#12304;&#20363;&#22914;&#12305;They all denied ever having seen her. &#20182;&#20204;&#20840;&#37117;&#21542;&#35748;&#35265;&#36807;&#22905;&#12290;/ What a shifty arguer he is, refusing ever to give a straight answer. &#20182;&#36825;&#20010;&#20154;&#20105;&#36777;&#36215;&#26469;&#30495;&#26159;&#28369;&#22836;&#65292;&#24635;&#26159;&#19981;&#32943;&#30452;&#25130;&#20102;&#24403;&#22238;&#31572;&#38382;&#39064;&#12290;/ Many financial planners now recommend against ever paying off your home loan. &#29616;&#22312;&#24456;&#22810;&#36130;&#21153;&#35745;&#21010;&#19987;&#23478;&#20027;&#24352;&#19981;&#35201;&#23558;&#36141;&#25151;&#36151;&#27454;&#36824;&#28165;&#12290;</P>
<P>
<P>&#65288;e&#65289;&#22312;if&#20174;&#21477;&#65288;&#26080;&#35770;&#26159;&#34920;&#31034;&#8220;&#22914;&#26524;&#8221;&#25110;&#26159;&#8220;&#26159;&#21542;&#8221;&#65289;&#20013;&#65306;&#30001;&#20110;if&#21547;&#26377;&#19981;&#30830;&#23450;&#24615;&#12289;&#19981;&#32943;&#23450;&#24615;&#65292;&#25152;&#20197;&#21487;&#20197;&#22312;if&#20174;&#21477;&#20013;&#20986;&#29616;ever&#26469;&#36827;&#19968;&#27493;&#21152;&#37325;&#36825;&#20010;&#19981;&#32943;&#23450;&#24615;&#12290;&#12304;&#20363;&#22914;&#12305;I wonder if I can ever visit England again. &#25105;&#30495;&#19981;&#30693;&#36947;&#33021;&#19981;&#33021;&#20877;&#21040;&#33521;&#26684;&#20848;&#35775;&#38382;&#12290;/ All 25 EU countries must ratify the text if it is ever to come into force. (The Economist, June 10, 2005, p. 47) &#25991;&#26412;&#22914;&#26524;&#30495;&#30340;&#35201;&#29983;&#25928;&#65292;&#23601;&#38656;&#35201;&#25152;&#26377;&#20108;&#21313;&#20116;&#20010;&#27431;&#30431;&#22269;&#23478;&#20840;&#37117;&#20104;&#20197;&#25209;&#20934;&#12290;/ He seldom, if ever, eats meat. &#20182;&#24456;&#23569;&#21507;&#32905;&#12290;/ Once you lost one of these ice sheets, there's really no putting it back for thousands of years, if ever. (The Washington Post, Jan. 29, 2006, A16) &#36825;&#20123;&#20912;&#23618;&#19968;&#26086;&#22833;&#21435;&#19968;&#22359;&#65292;&#21363;&#20351;&#33021;&#22815;&#24674;&#22797;&#65292;&#20063;&#19981;&#26159;&#20960;&#21315;&#24180;&#33021;&#21150;&#21040;&#30340;&#20107;&#12290;/ She could feel renewed inside when she met the right man, if ever. &#26377;&#26397;&#19968;&#26085;&#65292;&#31561;&#21040;&#22905;&#36935;&#21040;&#22914;&#24847;&#37070;&#21531;&#65292;&#22905;&#30340;&#20869;&#24515;&#26159;&#33021;&#22815;&#25391;&#20852;&#36215;&#26469;&#30340;&#12290;</P>
<P>
<P>&#65288;f&#65289;than&#23545;&#21518;&#38754;&#30340;&#25104;&#20998;&#20063;&#26377;&#19968;&#20123;&#21542;&#23450;&#30340;&#21547;&#20041;&#65292;&#25152;&#20197;&#22312;&#36825;&#25104;&#20998;&#20013;&#20063;&#21487;&#20197;&#29992;ever&#26469;&#31361;&#20986;&#23545;&#27604;&#30340;&#24378;&#28872;&#12290;&#12304;&#20363;&#22914;&#12305;... it will require a great deal more evidence than is ever likely to be available, thank God, to persuade me that Tiberius was as blameless a monarch as King George V. (Somerset Maugham, The Moon and Sixpence, Chapter I) &#8230;&#35874;&#22825;&#35874;&#22320;&#65292;&#21738;&#24597;&#20320;&#25214;&#36941;&#20102;&#19968;&#20999;&#21487;&#33021;&#25214;&#21040;&#30340;&#35777;&#25454;&#65292;&#37117;&#19981;&#36275;&#20197;&#35828;&#26381;&#25105;&#30456;&#20449;&#65292;&#25552;&#27604;&#30041;&#26031;&#20316;&#20026;&#19968;&#20010;&#21531;&#20027;&#65292;&#21516;&#20052;&#27835;&#20116;&#19990;&#22269;&#29579;&#19968;&#26679;&#26159;&#26080;&#21487;&#25351;&#25688;&#30340;&#12290;</P>
<P>
<P>&#65288;g&#65289;&#21516;&#24418;&#23481;&#35789;&#30340;&#21516;&#32423;&#12289;&#27604;&#36739;&#32423;&#25110;&#26368;&#39640;&#32423;&#36830;&#29992;&#65306;</P>
<P>
<P>&#65288;g1&#65289;&#29992;&#26469;&#34920;&#31034;&#26368;&#39640;&#32423;&#12289;&#21516;&#32423;&#30340;&#12290;&#12304;&#20363;&#22914;&#12305;She has as fine a figure as I have ever seen. &#22905;&#30340;&#36523;&#26448;&#65292;&#26159;&#25105;&#25152;&#30475;&#21040;&#36807;&#30340;&#26368;&#33495;&#26465;&#30340;&#65288;&#21442;&#35265;as... any, as... ever&#26465;&#65289;&#12290;</P>
<P>
<P>&#65288;g2&#65289;&#29992;&#26469;&#34920;&#31034;&#27604;&#36739;&#32423;&#30340;&#12290;&#12304;&#20363;&#22914;&#12305;I'm happier than I have ever been. &#25105;&#20174;&#26469;&#27809;&#26377;&#29616;&#22312;&#36825;&#20040;&#39640;&#20852;&#36807;&#12290;</P>
<P>
<P>&#65288;g3&#65289;&#29992;&#26469;&#34920;&#31034;&#26368;&#39640;&#32423;&#30340;&#12290;&#12304;&#20363;&#22914;&#12305;This is the best novel ever written by a young girl. &#36825;&#26159;&#19968;&#20010;&#23567;&#22899;&#23401;&#25152;&#20889;&#20986;&#30340;&#26368;&#22909;&#30340;&#38271;&#31687;&#23567;&#35828;&#12290;/ He was the greatest pianist that ever lived. &#20182;&#26159;&#26366;&#32463;&#22312;&#19990;&#30340;&#26368;&#20255;&#22823;&#30340;&#38050;&#29748;&#23478;&#12290;/ This was the closest we ever came to finding the truth. &#37027;&#26159;&#25105;&#20204;&#26368;&#25509;&#36817;&#20110;&#21457;&#29616;&#30495;&#30456;&#30340;&#26102;&#20505;&#12290;</P>
<P>
<P>2. &#20462;&#39280;&#24418;&#23481;&#35789;&#25110;&#21103;&#35789;&#65306;</P>
<P>
<P>&#65288;a&#65289;&#20316;&#20026;&#21069;&#32622;&#23450;&#35821;&#20462;&#39280;&#27604;&#36739;&#32423;&#25110;&#34920;&#31034;&#36880;&#27493;&#21464;&#21270;&#30340;&#21160;&#35789;&#29616;&#22312;&#20998;&#35789;&#65292;&#34920;&#31034;&#8220;&#36234;&#26469;&#36234;&#8221;&#12290;&#12304;&#20363;&#22914;&#12305;the ever growing threat of war&#26085;&#30410;&#20005;&#37325;&#30340;&#25112;&#20105;&#23041;&#32961; / the ever worsening unemployment&#27599;&#20917;&#24840;&#19979;&#30340;&#22833;&#19994;&#29616;&#35937;&#12290;&#22914;&#26524;ever&#22312;&#27604;&#36739;&#30340;than&#20043;&#21518;&#65292;&#21017;&#34920;&#31034;&#8220;&#27604;&#20197;&#24448;&#20219;&#20309;&#26102;&#20505;&#37117;&#26356;&#8221;&#12290;&#12304;&#20363;&#22914;&#12305;She looked frailer than ever. &#22905;&#27604;&#20197;&#24448;&#20219;&#20309;&#26102;&#20505;&#37117;&#26174;&#24471;&#26356;&#21152;&#34394;&#24369;&#12290;</P>
<P>
<P>&#65288;b&#65289;&#19982;&#24418;&#23481;&#35789;&#30340;&#21407;&#32423;&#19968;&#36215;&#65292;&#34920;&#31034;always&#12290;&#12304;&#20363;&#22914;&#12305;The danger is ever present. &#21361;&#38505;&#26159;&#19968;&#30452;&#23384;&#22312;&#30340;&#12290;/ Ever helpful, he offered to drive me there. &#20182;&#36825;&#20010;&#20154;&#19968;&#30452;&#26159;&#21161;&#20154;&#20026;&#20048;&#30340;&#65292;&#36825;&#27425;&#21448;&#20027;&#21160;&#35201;&#24320;&#36710;&#36865;&#25105;&#21040;&#37027;&#36793;&#21435;&#12290;/ You are ever present in my thoughts.&#25105;&#32769;&#26159;&#24806;&#35760;&#30528;&#20320;&#12290;</P>
<P>
<P>&#65288;c&#65289;&#21516;&#24418;&#23481;&#35789;&#25110;&#21103;&#35789;&#30340;&#26368;&#39640;&#32423;&#19968;&#36215;&#65292;ever&#25918;&#22312;&#35813;&#24418;&#23481;&#35789;&#20043;&#21518;&#19982;&#34987;&#20462;&#39280;&#30340;&#21517;&#35789;&#20043;&#21069;&#65292;&#25110;&#25918;&#22312;&#35813;&#21517;&#35789;&#20043;&#21518;&#65292;&#34920;&#31034;&#19968;&#31181;&#8220;&#21382;&#26469;&#20043;&#26368;&#8221;&#29978;&#33267;&#8220;&#26377;&#21490;&#20197;&#26469;&#20043;&#26368;&#8221;&#30340;&#24847;&#20041;&#65288;&#20063;&#23601;&#26159;&#21462;&#20854;&#21382;&#26102;&#24847;&#20041;&#65292;&#25490;&#38500;&#20854;&#20849;&#26102;&#24847;&#20041;&#65289;&#12290;&#12304;&#20363;&#22914;&#12305;These are our best ever results.&#36825;&#20123;&#26159;&#25105;&#20204;&#21382;&#26469;&#33719;&#24471;&#30340;&#26368;&#22909;&#32467;&#26524;&#12290;/ It was the most awful film ever. &#37027;&#26159;&#21382;&#26469;&#26368;&#31967;&#31957;&#30340;&#24433;&#29255;&#12290;/ The United States and Europe are edging toward their biggest trade dispute ever. &#32654;&#22269;&#21644;&#27431;&#27954;&#27491;&#22312;&#24930;&#24930;&#22320;&#36208;&#21521;&#23427;&#20204;&#21382;&#26469;&#26368;&#22823;&#30340;&#36152;&#26131;&#20105;&#25191;&#12290;/ The A380 from Airbus would be the largest commercial jet ever, with potential seating of 555.&#31354;&#20013;&#23458;&#36710;&#20844;&#21496;&#20986;&#21697;&#30340;A380&#21487;&#33021;&#26159;&#26377;&#21490;&#20197;&#26469;&#26368;&#22823;&#30340;&#21830;&#19994;&#21943;&#27668;&#23458;&#26426;&#65292;&#26368;&#22810;&#21487;&#20197;&#26377;555&#20010;&#24231;&#20301;&#12290;/ An oxygen generator on the International space station overheated and spilled a toxic irritant Monday, forcing the three-men crew to don masks and gloves in the first emergency ever declared aboard the 8-year-old orbiting outpost.(The Associated Press, Sept. 18, 2006, headline: Toxic Leak Causes First-ever Space Station Emergency) &#22269;&#38469;&#22826;&#31354;&#31449;&#30340;&#19968;&#20010;&#27687;&#27668;&#21457;&#29983;&#22120;&#36807;&#28909;&#24182;&#27844;&#28431;&#20986;&#26377;&#27602;&#21050;&#28608;&#29289;&#65292;&#36843;&#20351;&#19977;&#20154;&#24037;&#20316;&#32452;&#25140;&#19978;&#38754;&#20855;&#21644;&#25163;&#22871;&#65292;&#36825;&#26159;&#37027;&#20010;&#22312;&#36712;&#36947;&#19978;&#36816;&#34892;&#24050;&#26377;&#20843;&#24180;&#21382;&#21490;&#30340;&#21069;&#21736;&#31449;&#19978;&#31532;&#19968;&#27425;&#23459;&#24067;&#30340;&#32039;&#24613;&#20107;&#20214;&#12290;/ ... scientists and diplomats warned Friday in their bleakest report ever on global warming. (The Associated Press, April 6, 2007) &#8230;&#31185;&#23398;&#23478;&#21644;&#22806;&#20132;&#23448;&#20204;&#26143;&#26399;&#20116;&#22312;&#20182;&#20204;&#21382;&#26469;&#26368;&#24808;&#28129;&#30340;&#26377;&#20851;&#20840;&#29699;&#21464;&#26262;&#30340;&#25253;&#21578;&#20013;&#25552;&#20986;&#35686;&#21578;&#12290;&#27880;&#24847;&#65306;the first secretary of the committee&#26159;&#8220;&#22996;&#21592;&#20250;&#31532;&#19968;&#20070;&#35760;&#8221;&#65292;the first secretary ever of the committee&#21017;&#26159;&#8220;&#22996;&#21592;&#20250;&#31532;&#19968;&#20219;&#30340;&#20070;&#35760;&#8221;&#12290;</P>
<P>
<P>3. ever so&#34920;&#31034;&#8220;&#21313;&#20998;&#8221;&#12289;&#8220;&#38750;&#24120;&#8221;&#12290;&#12304;&#20363;&#22914;&#12305;Let him be ever so rich. (Emerson) &#23601;&#35753;&#20182;&#33136;&#32544;&#19975;&#36143;&#21543;&#12290;/ The result was that the son's Y chromosome, usually an exact copy, varied ever so slightly from the father's. (National Geographic, Oct. 1999) &#32467;&#26524;&#65292;&#20799;&#23376;&#30340;Y&#26579;&#33394;&#20307;&#65292;&#36890;&#24120;&#21516;&#29238;&#20146;&#26159;&#19968;&#27169;&#19968;&#26679;&#30340;&#65292;&#20294;&#29616;&#22312;&#21364;&#26377;&#20102;&#38750;&#24120;&#32454;&#24494;&#30340;&#24046;&#21035;&#12290;