<H3 class="md-end-block md-heading" cid="n58" mdtype="heading"><SPAN class=md-plain md-inline="plain"><SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> &#31532;&#20108;&#31456;&#21069;&#19977;&#33410;&#31508;&#35760; : &#30828;&#20214;&#25903;&#25345;</SPAN></FONT></SPAN></H3>
<P class="md-end-block md-p" cid="n59" mdtype="paragraph"><SPAN class=md-plain md-inline="plain"><SPAN class=extract><SPAN class=md-plain md-inline="plain">&#20026;&#20351;&#25805;&#20316;&#31995;&#32479;&#33021;&#22312;&#38548;&#31163;&#19981;&#21516;&#29992;&#25143;&#21644;&#36827;&#31243;&#30340;&#21516;&#26102;&#65292;&#35753;&#29992;&#25143;&#36827;&#31243;&#33021;&#30452;&#25509;&#22312;&#30828;&#20214;&#19978;&#36816;&#34892;&#65292;&#30828;&#20214;&#33267;&#23569;&#38656;&#35201;&#25903;&#25345;&#20197;&#19979;&#19977;&#26679;&#19996;&#35199;</SPAN></SPAN>&#65306;</SPAN></P>
<UL class=ul-list cid="n60" mdtype="list" data-mark="-">
<LI class=md-list-item cid="n61" mdtype="list_item">
<P class="md-end-block md-p" cid="n62" mdtype="paragraph"><SPAN class=md-pair-s md-inline="underline"><U><SPAN class=md-plain md-inline="plain"><SPAN class=extract><SPAN class=md-pair-s md-inline="underline"><U><SPAN class=md-plain md-inline="plain">&#29305;&#26435;&#25351;&#20196;</SPAN></U></SPAN><SPAN class=md-plain md-inline="plain">&#65306;&#22788;&#29702;&#22120;&#20301;&#20110;&#29992;&#25143;&#27169;&#24335;&#26102;&#65292;&#30001;&#20110;&#36825;&#20123;&#25351;&#20196;&#20855;&#26377;&#28508;&#22312;&#19981;&#23433;&#20840;&#24615;&#65292;&#22240;&#27492;&#19981;&#33021;&#34987;&#25191;&#34892;&#12290;&#21453;&#20043;&#65292;&#22914;&#26524;&#22788;&#29702;&#22120;&#20301;&#20110;&#20869;&#26680;&#27169;&#24335;&#21017;&#21487;&#20197;&#23433;&#20840;&#25191;&#34892;&#36825;&#20123;&#25351;&#20196;</SPAN></SPAN></SPAN></U></SPAN><SPAN class=md-plain md-inline="plain">&#65307;</SPAN></P>
<LI class=md-list-item cid="n63" mdtype="list_item"><SPAN class=md-pair-s md-inline="underline"><U><SPAN class=md-plain md-inline="plain"><SPAN class=extract>
<P class="md-end-block md-p" cid="n64" mdtype="paragraph"><SPAN class=md-pair-s md-inline="underline"><U><SPAN class=md-plain md-inline="plain">&#20869;&#23384;&#20445;&#25252;</SPAN></U></SPAN><SPAN class=md-plain md-inline="plain">&#65306;&#22788;&#29702;&#22120;&#20301;&#20110;&#29992;&#25143;&#27169;&#24335;&#26102;&#65292;&#36827;&#31243;&#30340;&#20219;&#20309;&#35797;&#22270;&#23545;&#26410;&#32463;&#25480;&#26435;&#30340;&#20869;&#23384;&#21306;&#22495;&#30340;&#35775;&#38382;&#37117;&#23558;&#34987;&#31105;&#27490;&#12290;&#21453;&#20043;&#65292;&#22914;&#26524;&#22788;&#29702;&#22120;&#20301;&#20110;&#20869;&#26680;&#27169;&#24335;&#21017;&#21487;&#20197;&#35775;&#38382;&#20854;&#23427;&#25152;&#26377;&#36827;&#31243;&#30340;&#20869;&#23384;&#21306;&#22495;&#65307;</SPAN></P></SPAN></SPAN></U></SPAN>
<LI class=md-list-item cid="n65" mdtype="list_item"><SPAN class=md-pair-s md-inline="underline"><U><SPAN class=md-plain md-inline="plain"><SPAN class=extract>
<P class="md-end-block md-p" cid="n66" mdtype="paragraph"><SPAN class=md-pair-s md-inline="underline"><U><SPAN class=md-plain md-inline="plain">&#35745;&#26102;&#22120;&#20013;&#26029;</SPAN></U></SPAN><SPAN class=md-plain md-inline="plain">&#65306;&#26080;&#35770;&#22914;&#20309;&#65292;&#20869;&#26680;&#37117;&#24517;&#39035;&#30830;&#20445;&#22788;&#29702;&#22120;&#25511;&#21046;&#26435;&#21608;&#26399;&#24615;&#22320;&#20174;&#24212;&#29992;&#31243;&#24207;&#25163;&#19978;&#34987;&#20132;&#36824;&#32473;&#20869;&#26680;&#65307;</SPAN></P>
<P class="md-end-block md-p" cid="n66" mdtype="paragraph"></SPAN></SPAN></U></SPAN><SPAN class=md-plain md-inline="plain">&#29305;&#26435;&#25351;&#20196;</SPAN></P></LI></UL>
<P class="md-end-block md-p" cid="n68" mdtype="paragraph"><SPAN class=md-plain md-inline="plain"><SPAN class=extract><SPAN class=md-plain md-inline="plain">&#20165;&#33021;&#22312;&#20869;&#26680;&#27169;&#24335;&#20294;&#19981;&#33021;&#22312;&#29992;&#25143;&#27169;&#24335;&#20013;&#25191;&#34892;&#30340;&#25351;&#20196;&#34987;&#31216;&#20026;</SPAN><SPAN class=md-pair-s md-inline="underline"><U><SPAN class="md-pair-s " md-inline="strong"><STRONG><SPAN class=md-plain md-inline="plain">&#29305;&#26435;&#25351;&#20196;</SPAN></STRONG></SPAN></U></SPAN><SPAN class=md-plain md-inline="plain">&#65288;</SPAN><SPAN class="md-pair-s " md-inline="em"><EM><SPAN class=md-plain md-inline="plain">Privileged instructions</SPAN></EM></SPAN><SPAN class=md-plain md-inline="plain">&#65289;&#65292;</SPAN></SPAN></SPAN><SPAN class=md-plain md-inline="plain">&#23427;&#20204;&#26159;&#20869;&#26680;&#20026;&#20102;&#33021;&#23436;&#25104;&#20854;&#24037;&#20316;&#65292;&#25152;&#24517;&#39035;&#35201;&#25191;&#34892;&#30340;&#25351;&#20196;&#12290;&#20363;&#22914;&#65306;&#20462;&#25913;&#29305;&#26435;&#31561;&#32423;&#12289;&#35843;&#33410;&#20869;&#23384;&#35775;&#38382;&#12289;&#31105;&#27490;/&#35768;&#21487;&#20013;&#26029;&#12290;&#24456;&#26174;&#28982;&#65292;&#36825;&#20123;&#25351;&#20196;&#19981;&#33021;&#34987;&#24212;&#29992;&#31243;&#24207;&#25152;&#25191;&#34892;</SPAN></P>
<P class="md-end-block md-p" cid="n68" mdtype="paragraph"><SPAN class=md-plain md-inline="plain"><SPAN class=extract><SPAN class=md-plain md-inline="plain">&#24212;&#29992;&#31243;&#24207;&#25191;&#34892;&#26410;&#32463;&#35768;&#21487;&#30340;&#34892;&#20026;&#65288;&#20363;&#22914;&#25191;&#34892;&#29305;&#26435;&#25351;&#20196;&#65289;&#23558;&#20250;&#24341;&#21457;&#22788;&#29702;&#22120;&#24322;&#24120;&#65288;Processor exception&#65289;</SPAN></SPAN>&#65292;<SPAN class=extract><SPAN class=md-plain md-inline="plain">&#19981;&#21516;&#20110;&#39640;&#32423;&#31243;&#24207;&#35821;&#35328;&#20013;&#30340;&#24322;&#24120;&#65292;&#22788;&#29702;&#22120;&#24322;&#24120;&#24448;&#24448;&#20250;&#20351;&#22788;&#29702;&#22120;&#30452;&#25509;&#23558;&#25511;&#21046;&#26435;&#20132;&#32473;&#65288;&#20301;&#20110;&#20869;&#26680;&#20013;&#30340;&#65289;&#24322;&#24120;&#22788;&#29702;&#22120;&#65292;&#23427;&#24448;&#24448;&#20250;&#30452;&#25509;&#20013;&#26029;&#24341;&#21457;&#27492;&#31867;&#24322;&#24120;&#30340;&#31243;&#24207;</SPAN></SPAN></SPAN></P>
<P class="md-end-block md-p" cid="n68" mdtype="paragraph"><SPAN class=md-plain md-inline="plain"><SPAN class=extract><SPAN class=md-plain md-inline="plain"></SPAN></SPAN></SPAN><SPAN class=md-plain md-inline="plain">&#20869;&#23384;&#20445;&#25252;</SPAN></P>
<P class="md-end-block md-p" cid="n71" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#20869;&#23384;&#20445;&#25252;&#31616;&#21333;&#26469;&#35828;&#23601;&#26159;&#30830;&#20445;&#36827;&#31243;&#20165;&#33021;&#35835;&#20889;&#33258;&#24049;&#30340;&#20869;&#23384;&#65292;&#19981;&#33021;&#35835;&#20889;&#25805;&#20316;&#31995;&#32479;&#21644;&#20854;&#23427;&#36827;&#31243;&#30340;&#20869;&#23384;</SPAN></P><SPAN class="md-pair-s " md-inline="strong"><STRONG><SPAN class=md-plain md-inline="plain"><SPAN class=extract>
<P class="md-end-block md-p" cid="n72" mdtype="paragraph"><SPAN class="md-pair-s " md-inline="strong"><STRONG><SPAN class=md-plain md-inline="plain">&#20869;&#23384;&#20445;&#25252;&#30340;&#24847;&#20041;</SPAN></STRONG></SPAN></P>
<P class="md-end-block md-p" cid="n73" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#20026;&#20160;&#20040;&#20869;&#23384;&#20445;&#25252;&#26159;&#26377;&#24847;&#20041;&#30340;&#65306;</SPAN></P>
<UL class=ul-list cid="n74" mdtype="list" data-mark="-">
<LI class=md-list-item cid="n75" mdtype="list_item">
<P class="md-end-block md-p" cid="n76" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#20869;&#23384;&#20445;&#25252;&#33021;&#25552;&#21319;&#31995;&#32479;&#30340;&#21487;&#38752;&#24615;&#65306;&#22914;&#26524;&#27809;&#26377;&#20869;&#23384;&#20445;&#25252;&#65292;&#19968;&#20010;&#31243;&#24207;&#30340;&#23849;&#28291;&#23558;&#24456;&#23481;&#26131;&#24433;&#21709;&#21040;&#21478;&#19968;&#31243;&#24207;&#65307;</SPAN></P>
<LI class=md-list-item cid="n77" mdtype="list_item">
<P class="md-end-block md-p" cid="n78" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#20869;&#23384;&#20445;&#25252;&#26159;&#25277;&#35937;&#30340;&#19968;&#37096;&#20998;&#65306;&#22312;&#27809;&#26377;&#20869;&#23384;&#20445;&#25252;&#30340;&#26102;&#20195;&#65292;&#31243;&#24207;&#24448;&#24448;&#30452;&#25509;&#21644;&#20869;&#26680;&#36827;&#34892;&#20132;&#20114;&#65292;&#22240;&#27492;&#21487;&#20197;&#30452;&#25509;&#20462;&#25913;&#20854;&#20013;&#30340;&#25968;&#25454;&#12290;&#36825;&#23558;&#23548;&#33268;&#38590;&#20197;&#23545;&#20869;&#26680;&#20195;&#30721;&#36827;&#34892;&#26356;&#25913;&#65292;&#22240;&#20026;&#19968;&#26086;&#26356;&#25913;&#20869;&#26680;&#65292;&#20043;&#21069;&#37027;&#20123;&#30452;&#25509;&#21644;&#24213;&#23618;&#25968;&#25454;&#32467;&#26500;&#36827;&#34892;&#20132;&#20114;&#30340;&#24212;&#29992;&#31243;&#24207;&#31435;&#21051;&#23601;&#21464;&#24471;&#19981;&#33021;&#29992;&#20102;&#65307;</SPAN></P></LI></UL></SPAN></SPAN></STRONG></SPAN>
<H5 class="md-end-block md-heading" cid="n79" mdtype="heading"><SPAN class=md-plain md-inline="plain"><SPAN class=extract>
<H5 class="md-end-block md-heading" cid="n79" mdtype="heading"><SPAN class=md-plain md-inline="plain">Base &amp; Bound&#65306;&#23454;&#29616;</SPAN></H5>
<P class="md-end-block md-p" cid="n80" mdtype="paragraph"><SPAN class="md-image md-img-loaded" md-inline="imgtag" data-src="D:\Computer Science\&#32654;&#26412;CS&#35838;\CS162\Note\2.&#20869;&#26680;&#25277;&#35937;.assets\image-20220319182437025.png"><img onerror=onImageErrorFunc(event) onload=onLoadedFuncForQuickAction(event) alt=image-20220319182437025 referrerpolicy="no-referrer" data-local-refresh="true"></SPAN></P>
<P class="md-end-block md-p" cid="n81" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">Base &amp; bound &#20869;&#23384;&#20445;&#25252;&#25351;&#30340;&#26159;&#27599;&#24403;&#22788;&#29702;&#22120;&#22788;&#29702;&#19968;&#26465;&#25351;&#20196;&#30340;&#26102;&#20505;&#65292;&#37117;&#20250;&#26816;&#26597;&#36825;&#26465;&#25351;&#20196;&#26412;&#36523;&#21450;&#20854;&#23558;&#35201;&#25805;&#20316;&#30340;&#25968;&#25454;&#22312;&#20869;&#23384;&#20013;&#30340;&#22320;&#22336;&#26159;&#21542;&#22312; base &#23492;&#23384;&#22120;&#21644; bound &#23492;&#23384;&#25152;&#21010;&#23450;&#30340;&#33539;&#22260;&#20869;&#12290;&#19968;&#26086;&#36229;&#36807;&#36825;&#20010;&#33539;&#22260;&#65292;&#22788;&#29702;&#22120;&#20250;&#31435;&#21363;&#21457;&#20986;&#24322;&#24120;&#12289;&#26242;&#20572;&#31243;&#24207;&#12289;&#23558;&#25511;&#21046;&#26435;&#36716;&#20132;&#25805;&#20316;&#31995;&#32479;&#20869;&#26680;&#12290;&#30456;&#20851;&#30340;&#25216;&#26415;&#32454;&#33410;&#22914;&#19979;&#65306;</SPAN></P>
<UL class=ul-list cid="n82" mdtype="list" data-mark="-">
<LI class=md-list-item cid="n83" mdtype="list_item">
<P class="md-end-block md-p" cid="n84" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">Base &amp; bound &#20381;&#25176;&#20110;&#20004;&#20010;&#20301;&#20110;&#22788;&#29702;&#22120;&#20869;&#37096;&#30340;&#23492;&#23384;&#22120;&#36827;&#34892;&#23454;&#29616;&#65292;&#25805;&#20316;&#31995;&#32479;&#20445;&#23384;&#36827;&#31243;&#26102;&#20063;&#20250;&#23558;&#36825;&#20004;&#20010;&#23492;&#23384;&#22120;&#19968;&#24182;&#20445;&#23384;&#12290;&#31616;&#21333;&#26469;&#35828;&#65292;&#23427;&#20204;&#20063;&#23646;&#20110;&#29366;&#24577;&#23492;&#23384;&#22120;&#30340;&#19968;&#31181;&#65307;</SPAN></P>
<LI class=md-list-item cid="n85" mdtype="list_item">
<P class="md-end-block md-p" cid="n86" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">Base &amp; bound &#25152;&#21010;&#23450;&#30340;&#33539;&#22260;&#26159;&#29289;&#29702;&#22320;&#22336;&#31354;&#38388;&#20013;&#30340;&#19968;&#29255;&#21306;&#22495;&#65292;&#24182;&#19981;&#26159;&#34394;&#25311;&#20869;&#23384;&#31354;&#38388;&#20013;&#30340;&#19968;&#29255;&#21306;&#22495;&#65307;</SPAN></P></LI></UL>
<P class="md-end-block md-p" cid="n87" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#23545;&#20110;&#20869;&#26680;&#36827;&#31243;&#26469;&#35828;&#65292;&#19981;&#23384;&#22312; Base &amp; Bound &#36825;&#20004;&#20010;&#27010;&#24565;&#65288;&#20869;&#26680;&#33021;&#35775;&#38382;&#31995;&#32479;&#20013;&#30340;&#25152;&#26377;&#20869;&#23384;&#65289;</SPAN></P>
<H5 class="md-end-block md-heading" cid="n88" mdtype="heading"><SPAN class=md-plain md-inline="plain">Base &amp; Bound&#65306;&#24330;&#31471;</SPAN></H5>
<P class="md-end-block md-p" cid="n89" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#30452;&#25509;&#20351;&#29992;&#29289;&#29702;&#22320;&#22336;&#23454;&#34892;&#20869;&#23384;&#20445;&#25252;&#30340; Base &amp; Bound &#23384;&#22312;&#38750;&#24120;&#22810;&#30340;&#38382;&#39064;&#65288;&#25193;&#24352;&#12289;&#36716;&#25442;&#12289;&#20849;&#20139;&#12289;&#20998;&#29255;&#65289;&#65306;</SPAN></P>
<UL class=ul-list cid="n90" mdtype="list" data-mark="-">
<LI class=md-list-item cid="n91" mdtype="list_item">
<P class="md-end-block md-p" cid="n92" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#22534;&#21644;&#26632;&#30340;&#22823;&#23567;&#21464;&#21160;&#65306;&#30001;&#20110; Base &amp; Bound &#20026;&#31243;&#24207;&#25152;&#20998;&#37197;&#20869;&#23384;&#30340;&#22823;&#23567;&#22312;&#31243;&#24207;&#34987;&#21152;&#36733;&#21040;&#20869;&#23384;&#30340;&#26102;&#20505;&#24050;&#32463;&#22266;&#23450;&#20102;&#65292;&#32771;&#34385;&#21040;&#22823;&#23567;&#21487;&#33021;&#21457;&#29983;&#21464;&#21160;&#30340;&#22534;&#21644;&#26632;&#65292;&#31350;&#31455;&#35201;&#20351;&#29992; Base &amp; Bound &#20026;&#20854;&#21010;&#23450;&#22810;&#22823;&#30340;&#20869;&#23384;&#26159;&#19968;&#20010;&#24456;&#38590;&#30830;&#23450;&#30340;&#38382;&#39064;&#65307;</SPAN></P>
<LI class=md-list-item cid="n93" mdtype="list_item">
<P class="md-end-block md-p" cid="n94" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#20869;&#23384;&#20849;&#20139;&#65306;&#30001;&#20110; Base &amp; Bound &#31105;&#27490;&#19981;&#21516;&#36827;&#31243;&#35775;&#38382;&#23545;&#26041;&#30340;&#20869;&#23384;&#21306;&#22495;&#65292;&#35832;&#22914;&#20849;&#20139;&#20195;&#30721;&#20043;&#31867;&#30340;&#20107;&#20214;&#21487;&#33021;&#24456;&#38590;&#23454;&#29616;&#65307;</SPAN></P>
<LI class=md-list-item cid="n95" mdtype="list_item">
<P class="md-end-block md-p" cid="n96" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#29289;&#29702;&#20869;&#23384;&#22320;&#22336;&#65306;&#24403;&#31243;&#24207;&#34987;&#32534;&#35793;&#21644;&#38142;&#25509;&#26102;&#65292;&#20854;&#20840;&#23616;&#21464;&#37327;&#21644;&#20989;&#25968;&#30340;&#22320;&#22336;&#37117;&#26159;&#30456;&#23545;&#20110;&#38236;&#20687;&#25991;&#20214;&#65288;ELF&#65289;&#30340;&#24320;&#22987;&#37096;&#20998;&#30456;&#23545;&#20915;&#23450;&#30340;&#65292;&#22240;&#27492;&#24403;&#31243;&#24207;&#34987;&#21152;&#36733;&#21040;&#20869;&#23384;&#26102;&#65292;&#20869;&#26680;&#24517;&#39035;&#20462;&#25913;&#36825;&#20123;&#22320;&#22336;&#20197;&#30830;&#20445;&#31243;&#24207;&#30340;&#27491;&#24120;&#36816;&#34892;&#65307;</SPAN></P>
<LI class=md-list-item cid="n97" mdtype="list_item">
<P class="md-end-block md-p" cid="n98" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#20869;&#23384;&#20998;&#29255;&#65306;&#30001;&#20110;&#31243;&#24207;&#20351;&#29992;&#30340;&#26159;&#29289;&#29702;&#22320;&#22336;&#65292;&#22240;&#27492;&#27599;&#20010;&#31243;&#24207;&#22312;&#20869;&#23384;&#20013;&#25152;&#21344;&#25454;&#30340;&#21306;&#22495;&#24517;&#28982;&#26159;&#19968;&#22359;&#36830;&#32493;&#30340;&#21306;&#22495;&#12290;&#26681;&#25454;&#31243;&#24207;&#35268;&#27169;&#30340;&#22823;&#23567;&#19981;&#21516;&#65292;&#36827;&#31243;&#25152;&#21344;&#25454;&#30340;&#31354;&#38388;&#22823;&#23567;&#33258;&#28982;&#20063;&#19981;&#31561;&#12290;&#22240;&#27492;&#24403;&#35745;&#31639;&#26426;&#36816;&#34892;&#19968;&#27573;&#26102;&#38388;&#20043;&#21518;&#65292;&#21487;&#33021;&#20250;&#20986;&#29616;&#27809;&#26377;&#36275;&#22815;&#30340;</SPAN><SPAN class=md-pair-s md-inline="underline"><U><SPAN class=md-plain md-inline="plain">&#36830;&#32493;</SPAN></U></SPAN><SPAN class=md-plain md-inline="plain">&#20869;&#23384;&#20379;&#26032;&#36827;&#31243;&#34987;&#21152;&#36733;&#21040;&#20869;&#23384;&#20013;&#65307;</SPAN></P></LI></UL>
<P class="md-end-block md-p" cid="n99" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#20026;&#20102;&#35299;&#20915;&#19978;&#36848;&#38382;&#39064;&#65292;&#20986;&#29616;&#20102;&#34394;&#25311;&#22320;&#22336;&#36825;&#19968;&#32467;&#26500;</SPAN></P></SPAN></SPAN><SPAN class=md-plain md-inline="plain">&#65292;&#35814;&#35265;&#65306;</SPAN></H5>
<H5 class="md-end-block md-heading" cid="n100" mdtype="heading"><SPAN class=md-plain md-inline="plain">&#20869;&#23384;&#26144;&#23556;&#35774;&#22791;</SPAN></H5><SPAN class=md-pair-s md-inline="underline"><U><SPAN class="md-pair-s " md-inline="strong"><STRONG><SPAN class=md-plain md-inline="plain"><SPAN class=extract>
<P class="md-end-block md-p" cid="n101" mdtype="paragraph"><SPAN class=md-pair-s md-inline="underline"><U><SPAN class="md-pair-s " md-inline="strong"><STRONG><SPAN class=md-plain md-inline="plain">&#20869;&#23384;&#26144;&#23556;&#35774;&#22791;</SPAN></STRONG></SPAN></U></SPAN><SPAN class=md-plain md-inline="plain">&#65288;</SPAN><SPAN class="md-pair-s " md-inline="em"><EM><SPAN class=md-plain md-inline="plain">Memory-mapped device</SPAN></EM></SPAN><SPAN class=md-plain md-inline="plain">&#65289;&#25351;&#25805;&#20316;&#31995;&#32479;&#20250;&#36890;&#36807;&#35835;&#20889;&#29305;&#23450;&#20301;&#32622;&#20869;&#23384;&#19982;&#35774;&#22791;&#36827;&#34892;&#20132;&#20114;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#27599;&#20010;&#35774;&#22791;&#37117;&#20250;&#30417;&#35270;&#20869;&#23384;&#24635;&#32447;&#65292;&#19968;&#26086;&#22312;&#20854;&#20013;&#21457;&#29616;&#20998;&#37197;&#32473;&#33258;&#24049;&#30340;&#22320;&#22336;&#23601;&#20250;&#21551;&#21160;&#30456;&#24212;&#30340; I/O &#25805;&#20316;</SPAN></P>
<P class="md-end-block md-p" cid="n101" mdtype="paragraph"></SPAN></SPAN></STRONG></SPAN></U></SPAN><SPAN class=md-plain md-inline="plain">&#20869;&#23384;&#20445;&#25252;&#33021;&#20026;&#36825;&#31181;&#35774;&#22791;&#24102;&#26469;&#19968;&#23450;&#30340;&#22909;&#22788;&#65292;&#27604;&#22914;&#38450;&#27490;&#24212;&#29992;&#31243;&#24207;&#30452;&#25509;&#35775;&#38382; I/O &#35774;&#22791;</SPAN></P>
<H4 class="md-end-block md-heading" cid="n103" mdtype="heading"><SPAN class=md-plain md-inline="plain"><SPAN class=extract>
<H4 class="md-end-block md-heading" cid="n103" mdtype="heading"><SPAN class=md-plain md-inline="plain">&#35745;&#26102;&#22120;&#20013;&#26029;</SPAN></H4>
<P class="md-end-block md-p" cid="n104" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#23613;&#31649;&#22312;&#36890;&#24120;&#24773;&#20917;&#19979;&#24212;&#29992;&#31243;&#24207;&#30340;&#25191;&#34892;&#36807;&#31243;&#37117;&#19981;&#38656;&#35201;&#20869;&#26680;&#20171;&#20837;&#65292;&#20294;&#26159;&#21457;&#29983;&#24322;&#24120;&#24773;&#20917;&#26102;&#65288;&#27515;&#24490;&#29615;&#12289;&#36234;&#30028;&#35775;&#38382;&#65289;&#23601;&#38656;&#35201;&#20869;&#26680;&#25191;&#34892;&#19968;&#23450;&#30340;&#25351;&#20196;&#65292;&#21028;&#21035;&#26159;&#21542;&#24212;&#24403;&#20572;&#27490;&#24212;&#29992;&#31243;&#24207;&#30340;&#25191;&#34892;&#12290;&#24403;&#28982;&#65292;&#36825;&#20854;&#20013;&#26368;&#37325;&#35201;&#30340;&#26159;&#65292;&#22914;&#20309;&#30830;&#20445;&#22312;&#20219;&#20309;&#24517;&#35201;&#30340;&#26102;&#20505;&#65292;&#25805;&#20316;&#31995;&#32479;&#37117;&#33021;&#25343;&#21040;&#22788;&#29702;&#22120;&#30340;&#25511;&#21046;&#26435;&#21602;</SPAN><SUP class=md-footnote md-inline="footnote" data-ref="&#25511;&#21046;&#26435;"><SPAN spellcheck=false class=md-text><SPAN class=md-plain md-inline="plain">&#25511;&#21046;&#26435;</SPAN></SPAN></SUP><SPAN class=md-plain md-inline="plain">&#65311;</SPAN></P>
<P class="md-end-block md-p" cid="n105" mdtype="paragraph"><SPAN class=md-pair-s md-inline="underline"><U><SPAN class="md-pair-s " md-inline="strong"><STRONG><SPAN class=md-plain md-inline="plain">&#30828;&#20214;&#35745;&#26102;&#22120;</SPAN></STRONG></SPAN></U></SPAN><SPAN class=md-plain md-inline="plain">&#65288;</SPAN><SPAN class="md-pair-s " md-inline="em"><EM><SPAN class=md-plain md-inline="plain">Hardware Timer</SPAN></EM></SPAN><SPAN class=md-plain md-inline="plain">&#65289;&#26159;&#19968;&#31181;&#23454;&#29616;&#26041;&#24335;&#12290;&#32463;&#36807;&#29305;&#23450;&#30340;&#19968;&#27573;&#26102;&#38388;&#20043;&#21518;&#65288;&#21487;&#33021;&#26159;&#20197;&#26102;&#38388;&#20026;&#21333;&#20301;&#65292;&#20063;&#21487;&#33021;&#26159;&#20197;&#25351;&#20196;&#30340;&#25191;&#34892;&#25968;&#30446;&#20026;&#21333;&#20301;&#65289;&#22788;&#29702;&#22120;&#23601;&#20250;&#20013;&#26029;&#24182;&#23558;&#25511;&#21046;&#26435;&#20132;&#32473;&#25805;&#20316;&#31995;&#32479;&#12290;&#26377;&#20123;&#25216;&#26415;&#32454;&#33410;&#38656;&#35201;&#27880;&#24847;&#65306;</SPAN></P>
<UL class=ul-list cid="n106" mdtype="list" data-mark="-">
<LI class=md-list-item cid="n107" mdtype="list_item">
<P class="md-end-block md-p" cid="n108" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#27599;&#20010;&#35745;&#26102;&#22120;&#20165;&#20250;&#20013;&#26029;&#35745;&#31639;&#26426;&#20013;&#30340;&#19968;&#20010;&#26680;&#24515;&#65292;&#22240;&#27492;&#23545;&#20110;&#22810;&#26680;&#22788;&#29702;&#22120;&#26469;&#35828;&#65292;&#27599;&#20010;&#26680;&#24515;&#24448;&#24448;&#25317;&#26377;&#29420;&#31435;&#30340;&#35745;&#26102;&#22120;&#65307;</SPAN></P>
<LI class=md-list-item cid="n109" mdtype="list_item">
<P class="md-end-block md-p" cid="n110" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#20013;&#26029;&#30340;&#21608;&#26399;&#24448;&#24448;&#20197;&#27627;&#31186;&#20026;&#21333;&#20301;&#65292;&#20154;&#31867;&#26080;&#27861;&#23519;&#35273;&#65307;</SPAN></P>
<LI class=md-list-item cid="n111" mdtype="list_item">
<P class="md-end-block md-p" cid="n112" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#35745;&#26102;&#22120;&#21482;&#33021;&#34987;&#29305;&#26435;&#25351;&#20196;&#35774;&#32622;&#65292;&#24212;&#29992;&#31243;&#24207;&#26080;&#27861;&#26356;&#25913;&#20854;&#20013;&#30340;&#20540;&#65307;</SPAN></P></LI></UL>
<P class="md-end-block md-p" cid="n113" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#21478;&#22806;&#65292;&#25805;&#20316;&#31995;&#32479;&#23454;&#38469;&#19978;&#26159;&#19981;&#30693;&#36947;&#31243;&#24207;&#26159;&#21542;&#27491;&#22788;&#22312;&#27515;&#24490;&#29615;&#20013;&#30340;&#65292;&#23427;&#21807;&#19968;&#38656;&#35201;&#20570;&#30340;&#26159;&#30830;&#20445;&#33021;&#22312;&#27515;&#24490;&#29615;&#31243;&#24207;&#36816;&#34892;&#26102;&#35810;&#38382;&#29992;&#25143;&#65306;&#26159;&#21542;&#38656;&#35201;&#32467;&#26463;&#31243;&#24207;&#65311;</SPAN></P></SPAN></SPAN><SPAN class=md-plain md-inline="plain"><SPAN class=extract>
<H4 class="md-end-block md-heading" cid="n103" mdtype="heading"><SPAN class=md-plain md-inline="plain">OS &#30340;&#20854;&#23427;&#37096;&#20998;</SPAN></H4>
<P class="md-end-block md-p" cid="n115" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#25805;&#20316;&#31995;&#32479;&#19981;&#20165;&#20165;&#21253;&#25324;&#20869;&#26680;&#65292;&#36824;&#21253;&#25324;&#35832;&#22914;&#38142;&#25509;&#24211;&#21644;&#20854;&#23427;&#21508;&#31181;&#21508;&#26679;&#30340;&#31243;&#24207;&#12290;&#33267;&#20110;&#20026;&#20160;&#20040;&#19981;&#23558;&#36825;&#20123;&#37096;&#20998;&#20063;&#32435;&#20837;&#20869;&#26680;&#65292;&#21407;&#22240;&#26377;&#20108;&#65306;</SPAN></P>
<UL class=ul-list cid="n116" mdtype="list" data-mark="+">
<LI class=md-list-item cid="n117" mdtype="list_item">
<P class="md-end-block md-p" cid="n118" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#31532;&#19968;&#65292;&#26131;&#21270;&#25805;&#20316;&#31995;&#32479;&#30340;&#35843;&#35797;&#12290;&#35843;&#35797;&#20869;&#26680;&#38656;&#35201;&#20351;&#29992;&#27604;&#20869;&#26680;&#26356;&#38752;&#36817;&#30828;&#20214;&#30340;&#35843;&#35797;&#22120;&#25165;&#33021;&#23454;&#29616;&#65307;</SPAN></P>
<LI class=md-list-item cid="n119" mdtype="list_item">
<P class="md-end-block md-p" cid="n120" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#31532;&#20108;&#65292;&#25552;&#39640;&#21487;&#20381;&#36182;&#24615;&#12290;&#27605;&#31455;&#25152;&#35859;&#21463;&#20449;&#20219;&#30340;&#20195;&#30721;&#36234;&#23569;&#23601;&#24847;&#21619;&#30528;&#38169;&#35823;&#36234;&#23569;&#65292;&#25805;&#20316;&#31995;&#32479;&#30340;&#21487;&#20381;&#36182;&#24615;&#33258;&#28982;&#20063;&#23601;&#26356;&#24378;&#65307;</SPAN></P></LI></UL></SPAN></SPAN></H4>