&#9632;corner 
<P></P>
<P><BR>&#25945;&#33521;&#32654;&#20154;&#23398;&#35199;&#29677;&#29273;&#25991;&#30340;&#25945;&#31185;&#20070;&#65292;&#24120;&#24120;&#25552;&#37266;&#65292;&#33521;&#25991;&#30340;corner&#22312;&#35199;&#29677;&#29273;&#25991;&#26377;&#20004;&#20010;&#19981;&#21516;&#30340;&#23545;&#24212;&#35789;&#65292;&#19968;&#20010;&#26159;esquina&#65292;&#25351;&#30340;&#26159;&#8220;&#20174;&#22806;&#26041;&#35270;&#35282;&#30475;&#30340;&#25296;&#35282;&#8221;&#65292;&#21478;&#19968;&#20010;&#26159;rinc&#243;n&#65292;&#25351;&#30340;&#26159;&#8220;&#20174;&#20869;&#26041;&#35270;&#35282;&#30475;&#30340;&#35282;&#33853;&#8221;&#12290;</P>
<P>&#33521;&#25991;corner&#21017;&#20860;&#26377;&#36825;&#20004;&#20010;&#21547;&#20041;&#65292;&#20294;&#26159;&#21069;&#38754;&#29992;&#30340;&#20171;&#35789;&#26377;&#25152;&#19981;&#21516;&#12290;&#20869;&#26041;&#35270;&#35282;&#36890;&#24120;&#29992;in&#65292;&#22806;&#26041;&#35270;&#35282;&#21017;&#36890;&#24120;&#29992;on&#25110;at&#12290;&#12304;&#20363;&#22914;&#12305;in the corner of the hall&#22312;&#22823;&#21381;&#30340;&#35282;&#33853; / in the corner of the cupboard&#22312;&#26588;&#23376;&#30340;&#35282;&#33853; / in the top righthand corner of the page&#22312;&#35813;&#39029;&#30340;&#21491;&#19978;&#35282; / on the corner of Josefstrasse and Wilhelmstrasse&#22312;&#32422;&#29791;&#22827;&#22823;&#34903;&#21644;&#23041;&#24265;&#22823;&#34903;&#30340;&#20132;&#21449;&#35282;&#33853;/ The table is in the corner. &#26700;&#23376;&#22312;&#23627;&#35282;&#12290;/ There was a television set in the corner of the room.&#25151;&#38388;&#30340;&#35282;&#33853;&#26377;&#19968;&#24231;&#30005;&#35270;&#26426;&#12290;/ The house is on/at the corner. &#25151;&#23376;&#22312;&#34903;&#35282;&#12290;/ I'll meet you on/at the corner. &#25105;&#22312;&#34903;&#35282;&#21516;&#20320;&#35265;&#38754;&#12290;</P><SPAN class=extract>
<P>&#27604;&#36739;&#65306;The caf&#233; is in/ on the corner of the square. &#22914;&#26524;&#29992;in&#65292;&#26159;&#22312;&#24191;&#22330;&#19968;&#20010;&#35282;&#33853;&#30340;&#20869;&#26041;&#65307;&#22914;&#26524;&#29992;on&#65292;&#21017;&#26159;&#22312;&#35282;&#33853;&#30340;&#22806;&#26041;&#12290;</P>
<P>&#22914;&#26524;&#26159;&#21160;&#24577;&#30340;&#21160;&#20316;&#30446;&#30340;&#22320;&#65292;&#21017;&#20869;&#26041;&#35270;&#35282;&#29992;into&#12290;&#12304;&#20363;&#22914;&#12305;to drive/force somebody into a corner &#25226;&#26576;&#20154;&#36924;&#21040;&#22681;&#35282;&#65292;&#22806;&#26041;&#35270;&#35282;&#29992;onto&#12290;&#12304;&#20363;&#22914;&#12305;Exit Downtown Crossing Station onto the corner of Summer Street and Washington Street. &#35831;&#22312;&#38393;&#24066;&#36807;&#36335;&#31449;&#20986;&#21475;&#65292;&#21069;&#24448;&#22799;&#23395;&#34903;&#21644;&#21326;&#30427;&#39039;&#34903;&#30340;&#20132;&#21449;&#34903;&#35282;&#12290;</P></SPAN>
<P>&#21448;&#65306;&#26377;&#26102;&#20505;&#34429;&#28982;&#26159;&#20869;&#26041;&#35270;&#35282;&#65292;&#20294;&#26159;&#28041;&#21450;&#30340;&#31354;&#38388;&#26159;&#20010;&#24179;&#38754;&#65292;&#27492;&#26102;&#20063;&#21487;&#20197;&#19981;&#29992;in&#32780;&#29992;on&#12290;&#12304;&#20363;&#22914;&#12305;He signed his name on the lower right-hand corner of the drawing. &#20182;&#22312;&#30011;&#30340;&#21491;&#19979;&#35282;&#31614;&#19978;&#20102;&#33258;&#24049;&#30340;&#21517;&#23383;&#12290;