<P class=caption width=0><B>Figure&nbsp;4.8: </B>A multi-threaded process or operating system kernel has both <EM>per-thread state</EM> and <EM>shared state</EM>. </P>
<P class=caption width=0><SPAN class=extract>&#22810;&#32447;&#31243;&#36827;&#31243;&#20197;&#21450;&#25805;&#20316;&#31995;&#32479;&#20869;&#26680;&#36827;&#31243;&#25317;&#26377;&#20004;&#31181;&#19981;&#21516;&#31867;&#22411;&#30340;&#29366;&#24577;&#65306;&#32447;&#31243;&#29366;&#24577;&#21644;&#20849;&#20139;&#29366;&#24577;</SPAN></P>
<P class=caption width=0>&#25805;&#20316;&#31995;&#32479;&#20869;&#26680;&#20063;&#33021;&#34987;&#35748;&#20026;&#26159;&#22810;&#32447;&#31243;&#36827;&#31243;&#65311;</P>
<P class=caption width=0>The thread control block stores the per-thread state</P>
<P class=caption width=0><SPAN class=extract>&#32447;&#31243;&#25511;&#21046;&#22359;&#65288;thread control block&#65292;TCB&#65289;&#20013;&#20445;&#23384;&#30528;&#32447;&#31243;&#29366;&#24577;&#65288;&#32780;&#19981;&#26159;&#20849;&#20139;&#29366;&#24577;&#65289;</SPAN></P>
<P class=caption width=0>the current state of the thread&#8217;s computation (e.g., saved processor registers and a pointer to the stack) and metadata needed to manage the thread (e.g., the thread&#8217;s ID, scheduling priority, owner, and resource consumption). </P>
<P class=caption width=0><SPAN class=extract>&#32447;&#31243;&#29366;&#24577;&#30001;&#20004;&#37096;&#20998;&#32452;&#25104;&#65306;&#32447;&#31243;&#24403;&#21069;&#30340;&#35745;&#31639;&#29366;&#24577;&#65288;&#23492;&#23384;&#22120;&#21644;&#26632;&#25351;&#38024;&#65289;&#20197;&#21450;&#32500;&#25252;&#32447;&#31243;&#25152;&#38656;&#35201;&#30340;&#20803;&#25968;&#25454;&#65288;&#32447;&#31243; ID&#12289;&#35843;&#24230;&#20248;&#20808;&#32423;&#12289;&#25317;&#26377;&#32773;&#12289;&#36164;&#28304;&#28040;&#32791;&#65289;</SPAN></P>
<P class=caption width=0>Shared state includes the program&#8217;s code, global static variables, and the heap.</P>
<P class=caption width=0><SPAN class=extract>&#20849;&#20139;&#29366;&#24577;&#21253;&#25324;&#31243;&#24207;&#20195;&#30721;&#65292;&#20840;&#23616;&#38745;&#24577;&#21464;&#37327;&#20197;&#21450;&#22534;</SPAN></P>
<P class=caption width=0>&#20063;&#23601;&#26159;&#35828;&#65292;<SPAN class=extract>&#27599;&#20010;&#32447;&#31243;&#26377;&#33258;&#24049;&#30340;&#26632;&#65292;&#20294;&#26159;&#21516;&#36827;&#31243;&#30340;&#32447;&#31243;&#20849;&#20139;&#22534;<BR></SPAN>