<SPAN class=extract>
<P>To simplify the kernel design, the hardware provides a privileged instruction to temporarily defer delivery of an interrupt until it is safe to do so. </P>
<P>&#30828;&#20214;&#20026;&#20102;&#31616;&#21270;&#20869;&#26680;&#30340;&#35774;&#35745;&#65292;&#25552;&#20379;&#20102;&#25512;&#36831;&#20013;&#26029;&#22788;&#29702;&#30340;&#25351;&#20196;</P>
<P>&#25512;&#36831;&#20013;&#26029;&#25191;&#34892;&#30340;&#25351;&#20196;&#26159;&#29305;&#26435;&#25351;&#20196;</P></SPAN><SPAN class=extract>
<P>On the x86 and several other processors, this instruction is called <EM><A data-ixbpernmnjoud4qz9ktzkg='{"name": "OEBPS/Text/part0000.xhtml", "frag": "glo:interrupt disable"}'>disable interrupts</A></EM>. However, this is a misnomer: the interrupt is only deferred (masked), and not ignored. Once a corresponding <EM><A data-ixbpernmnjoud4qz9ktzkg='{"name": "OEBPS/Text/part0000.xhtml", "frag": "glo:interrupt enable"}'>enable interrupts</A></EM> instruction is executed, any pending interrupts are delivered to the processor. </P>
<P>&#22312;x86&#20197;&#21450;&#20854;&#20182;&#30340;&#19968;&#20123;&#23454;&#29616;&#20013;&#65292;&#26242;&#32531;&#20013;&#26029;&#25191;&#34892;&#30340;&#25351;&#20196;&#34987;&#31216;&#20026;&#31105;&#29992;&#20013;&#26029;&#65288;disable interrupt&#65289;&#25351;&#20196;</P>
<P>&#25191;&#34892;&#31105;&#29992;&#20013;&#26029;&#25351;&#20196;&#20043;&#21518;&#65292;&#24448;&#21518;&#21040;&#26469;&#30340;&#20013;&#26029;&#23454;&#38469;&#19978;&#24182;&#27809;&#26377;&#34987;&#31105;&#29992;&#65292;&#20165;&#20165;&#26159;&#34987;&#25512;&#36831;&#20102;&#12290;&#25191;&#34892;&#20102;&#21551;&#29992;&#20013;&#26029;&#65288;enable interrupt&#65289;&#25351;&#20196;&#20043;&#21518;&#65292;&#24448;&#21518;&#30340;&#20013;&#26029;&#25165;&#20250;&#34987;&#20998;&#21457;&#32473;&#22788;&#29702;&#22120;</P></SPAN><SPAN class=extract>
<P>The instructions to mask and unmask interrupts must be privileged; otherwise, user code could inadvertently or maliciously disable the hardware timer, allowing the machine to freeze.</P>
<P>&#20026;&#20160;&#20040;&#31105;&#29992;&#20013;&#26029;&#25351;&#20196;&#26159;&#29305;&#26435;&#25351;&#20196;&#65292;&#20030;&#20363;&#35828;&#26126;&#65311;</P>
<P>&#22914;&#26524;&#31105;&#29992;&#20013;&#26029;&#25351;&#20196;&#24182;&#38750;&#29305;&#26435;&#25351;&#20196;&#65292;&#37027;&#20040;&#24694;&#24847;&#20195;&#30721;&#23601;&#21487;&#20197;&#36890;&#36807;&#31105;&#29992;&#30828;&#20214;&#35745;&#26102;&#22120;&#65292;&#20351;&#35745;&#31639;&#26426;&#20923;&#32467;</P>
<P></SPAN>