<B>Returning from the handler.</B> When the iret instruction is called, it inspects both the current eflags register and the value on the stack that it will use to restore the earlier eflags register. If the mode bit is identical, then iret just pops the instruction pointer and eflags register and continues to use the current stack. On the other hand, if the mode bit differs, then the iret instruction pops not only the instruction pointer and eflags register, but also the saved stack pointer, thus switching the processor&#8217;s stack pointer to the saved one.</P>
<P>&#32771;&#34385;&#21040;&#26080;&#35770;&#26159;&#65288;&#22788;&#20110;&#20869;&#26680;&#24577;&#65289;&#20869;&#26680;&#32447;&#31243;&#21644;&#65288;&#22788;&#20110;&#29992;&#25143;&#24577;&#65289;&#29992;&#25143;&#32447;&#31243;&#37117;&#26377;&#21487;&#33021;&#34987;&#20869;&#26680;&#20013;&#26029;&#65292;&#22240;&#27492;&#24403;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#24674;&#22797;&#19978;&#19979;&#25991;&#26102;&#65292;&#23427;&#38656;&#35201;&#26681;&#25454;&#32447;&#31243;&#34987;&#20013;&#26029;&#26102;&#25152;&#22788;&#30340;&#29366;&#24577;&#65292;&#25191;&#34892;&#19981;&#21516;&#30340;&#25805;&#20316;&#12290;&#19968;&#20010;&#20856;&#22411;&#30340;&#20363;&#23376;&#23601;&#26159;&#20851;&#20110;&#26632;&#25351;&#38024;&#30340;&#24674;&#22797;&#38382;&#39064;&#65292;&#22914;&#26524;&#34987;&#20013;&#26029;&#32447;&#31243;&#26159;&#20869;&#26680;&#32447;&#31243;&#65292;&#32771;&#34385;&#21040;&#23427;&#27809;&#26377;&#29992;&#25143;&#26632;&#65292;&#22240;&#27492;&#24674;&#22797;&#19978;&#19979;&#25991;&#26102;&#19981;&#38656;&#35201;&#20462;&#25913;&#26632;&#25351;&#38024;&#65292;&#21482;&#38656;&#35201;&#24674;&#22797;&#20854;&#20182;&#23492;&#23384;&#22120;&#21363;&#21487;&#65307;&#30456;&#23545;&#30340;&#65292;&#22914;&#26524;&#35813;&#32447;&#31243;&#26159;&#29992;&#25143;&#32447;&#31243;&#65292;&#37027;&#20040;&#24674;&#22797;&#19978;&#19979;&#25991;&#30340;&#26102;&#20505;&#23601;&#35201;&#23558;&#25351;&#21521;&#20013;&#26029;&#26632;&#30340;&#26632;&#25351;&#38024;&#24674;&#22797;&#20026;&#25351;&#21521;&#29992;&#25143;&#26632;&#30340;&#26632;&#25351;&#38024;&#12290;&#20855;&#20307;&#21040;&#23454;&#29616;&#20013;&#65292;`iret` &#25351;&#20196;&#20250;&#22312;&#24377;&#26632;&#20043;&#21069;&#65292;&#23545;&#27604;&#26632;&#20013; EFLAG &#23492;&#23384;&#22120;&#20013;&#25152;&#20445;&#23384;&#30340;&#32447;&#31243;&#29366;&#24577;bit&#21644;&#24403;&#21069;&#29366;&#24577;bit&#26159;&#21542;&#30456;&#21516;&#65288;&#24456;&#26174;&#28982;&#65292;&#19981;&#27490;&#26377;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#33021;&#20351;&#29992;`iret`&#25351;&#20196;&#24674;&#22797;&#19978;&#19979;&#25991;&#65289;&#22914;&#26524;&#30456;&#21516;&#23601;&#21482;&#38656;&#35201;&#24674;&#22797;&#20195;&#30721;&#23492;&#23384;&#22120;&#21644; EFLAG&#65292;&#21542;&#21017;&#23601;&#38656;&#35201;&#36830;&#24102;&#19978;&#26632;&#25351;&#38024;&#19968;&#21516;&#24674;&#22797;