<FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> heated</SPAN></FONT> </FONT>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">1.ADJ-GRADED&nbsp;&#33021;&#34987;&#34920;&#31034;&#31243;&#24230;&#30340;&#21103;&#35789;&#25110;&#20171;&#35789;&#35789;&#32452;&#20462;&#39280;&#30340;&#24418;&#23481;&#35789;&#65288;&#35752;&#35770;&#25110;&#20105;&#21557;&#65289;&#28608;&#28872;&#30340; A heated discussion or quarrel is one where the people involved are angry and excited. </FONT>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">It was a very heated argument and they were shouting at each other... </FONT>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#20105;&#35770;&#38750;&#24120;&#28608;&#28872;&#65292;&#20182;&#20204;&#30456;&#20114;&#20043;&#38388;&#22823;&#21898;&#22823;&#21483;&#12290; </FONT>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">Our discussions were rather heated. </FONT>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#25105;&#20204;&#30340;&#35752;&#35770;&#30456;&#24403;&#28608;&#28872;&#12290; </FONT></P><FONT style="BACKGROUND-COLOR: #7be1e1">
<HR>
</FONT>
<P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">2.ADJ-GRADED&nbsp;&#33021;&#34987;&#34920;&#31034;&#31243;&#24230;&#30340;&#21103;&#35789;&#25110;&#20171;&#35789;&#35789;&#32452;&#20462;&#39280;&#30340;&#24418;&#23481;&#35789;&#21457;&#24594;&#30340;;&#28608;&#21160;&#30340; If someone gets heated about something, they get angry and excited about it.</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#12304;&#25645;&#37197;&#27169;&#24335;&#12305;&#65306;v-link ADJ about/over n </FONT>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">You will understand that people get a bit heated about issues such as these... </FONT>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#20320;&#35201;&#26126;&#30333;&#65292;&#23545;&#20110;&#36825;&#31867;&#38382;&#39064;&#20154;&#20204;&#19981;&#20813;&#20250;&#26377;&#20123;&#28608;&#21160;&#12290; </FONT>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">The baron became increasingly heated over the hypocrisy of it all. </FONT>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#30007;&#29237;&#23545;&#25972;&#20214;&#20107;&#30340;&#34394;&#20266;&#24863;&#21040;&#36234;&#26469;&#36234;&#29983;&#27668;&#12290;</FONT></P><FONT style="BACKGROUND-COLOR: #7be1e1">
<HR>
</FONT>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">heatedly </FONT>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">The crowd continued to argue heatedly about the best way to tackle the problem. </FONT>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#36825;&#32676;&#20154;&#32487;&#32493;&#28608;&#28872;&#22320;&#20105;&#35770;&#35299;&#20915;&#38382;&#39064;&#30340;&#26368;&#20339;&#21150;&#27861;&#12290;<BR><BR></FONT></P><FONT style="BACKGROUND-COLOR: #7be1e1">