<STRONG><FONT color=blue>Introduction : </FONT></STRONG>
<H1 id=introduction><SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> Introduction</SPAN></FONT></H1>
<P>&#19979;&#38754;&#26159;&#19968;&#20123;&#22522;&#26412;&#27010;&#24565;&#65306;</P>
<UL>
<LI><SPAN class=extract>&#32456;&#31471;&#19982;&#36335;&#30001;&#22120;&#65306;<STRONG>&#32456;&#31471;&#31995;&#32479;</STRONG>&#65288;<EM>end system</EM>&#65289;&#25110;&#32773;&#35828;<STRONG>&#20027;&#26426;</STRONG>&#65288;<EM>host</EM>&#65289;&#22522;&#26412;&#19978;&#33021;&#34987;&#35748;&#20026;&#26159;&#25105;&#20204;&#26085;&#24120;&#20351;&#29992;&#30340;&#65292;&#30452;&#25509;&#38754;&#21521;&#26222;&#36890;&#29992;&#25143;&#30340;&#30005;&#23376;&#20135;&#21697;&#12290;&#23558;&#36825;&#20123;&#32456;&#31471;&#31995;&#32479;&#36830;&#25509;&#36215;&#26469;&#30340;&#23601;&#26159;&#30001;<STRONG>&#36890;&#20449;&#38142;&#36335;</STRONG>&#65288;<EM>communication link</EM>&#65289;&#21644;<STRONG>&#21253;&#20132;&#25442;&#26426;</STRONG>&#65288;<EM>packet switch</EM>&#65289;&#25152;&#32452;&#25104;&#30340;&#32593;&#32476;&#65292;&#20854;<STRONG>&#20256;&#36755;&#36895;&#29575;</STRONG>&#65288;<EM>transmit rate</EM>&#65289;&#30340;&#21333;&#20301;&#26159; bit &#27599;&#31186;</SPAN>&#65307; 
<LI><SPAN class=extract>&#36830;&#25509;&#65306;&#22914;&#26524;&#20004;&#21488;&#35745;&#31639;&#26426;&#33021;&#22815;&#20132;&#25442;&#25968;&#25454;&#65292;&#37027;&#20040;&#23601;&#31216;&#36825;&#20004;&#21488;&#35745;&#31639;&#26426;<STRONG>&#30456;&#20114;&#36830;&#25509;</STRONG>&#65288;<EM>interconnected</EM>&#65289;</SPAN>&#65307; 
<LI><SPAN class=extract>&#21253;&#65306;&#32456;&#31471;&#31995;&#32479;&#21457;&#36865;&#25968;&#25454;&#26102;&#65292;&#20250;&#23558;&#25968;&#25454;&#20998;&#25104;&#19968;&#20010;&#20010;<STRONG>&#21253;</STRONG>&#65288;<EM>packet</EM>&#65289;&#65292;&#21516;&#26102;&#20998;&#21035;&#20026;&#36825;&#20123;&#21253;&#21152;&#19978;&#22836;&#23383;&#33410;&#65288;<EM>header byte</EM>&#65289;&#65307;&#32780;&#22312;&#25509;&#21463;&#31471;&#30340;&#32456;&#31471;&#31995;&#32479;&#20013;&#65292;&#20250;&#23558;&#36825;&#20123;&#21253;&#37325;&#32452;&#25104;&#21407;&#26469;&#30340;&#25968;&#25454;</SPAN>&#65307; 
<LI><SPAN class=extract>&#21253;&#20132;&#25442;&#26426;&#65306;<STRONG>&#21253;&#20132;&#25442;&#26426;</STRONG>&#65288;<EM>packet switch</EM>&#65289;&#26412;&#36136;&#19978;&#26159;&#19968;&#20010;&#20174;&#25509;&#25910;&#31471;&#25509;&#25910;&#25968;&#25454;&#21253;&#24182;&#21521;&#21457;&#36865;&#31471;&#21457;&#36865;&#20986;&#21435;&#30340;&#35774;&#22791;&#12290;&#20856;&#22411;&#30340;&#21253;&#20132;&#25442;&#26426;&#26159;<STRONG>&#36335;&#30001;&#22120;</STRONG>&#65288;<EM>router</EM>&#65289;&#21644;<STRONG>&#38142;&#36335;&#23618;&#20132;&#25442;&#26426;</STRONG>&#65288;<EM>link-layer switch</EM>&#65289;&#65292;&#21069;&#32773;&#22810;&#29992;&#20110;<STRONG>&#32593;&#32476;&#26680;&#24515;</STRONG>&#65288;<EM>network core</EM>&#65289;&#65292;&#21518;&#32773;&#22810;&#29992;&#20110;<STRONG>&#32593;&#32476;&#25509;&#20837;</STRONG>&#65288;<EM>access network</EM>&#65289;</SPAN><SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-1" name=ref-footnote-1>1</A></SUP>&#65307; 
<LI><SPAN class=extract>&#36335;&#30001;&#21644;&#36335;&#65306;<STRONG>&#36335;&#30001;</STRONG>&#65288;<EM>route</EM>&#65289;&#25110;&#32773;<STRONG>&#36335;</STRONG>&#65288;<EM>path</EM>&#65289;&#26159;&#32593;&#32476;&#20013;&#30001;&#21253;&#20132;&#25442;&#26426;&#21644;&#36890;&#20449;&#38142;&#36335;&#25152;&#32452;&#25104;&#30340;<U>&#36335;&#24452;</U></SPAN>&#65307; 
<LI><SPAN class=extract>ISP&#65306;&#20840;&#29699;&#21508;&#22320;&#30340;&#32456;&#31471;&#31995;&#32479;&#20043;&#38388;&#30456;&#20114;&#36830;&#25509;&#30340;&#26381;&#21153;&#65292;&#23454;&#38469;&#19978;&#26159;&#30001;<STRONG>&#32593;&#32476;&#26381;&#21153;&#20379;&#24212;&#21830;</STRONG>&#65288;<EM>Internet service provider</EM>&#65289;&#26469;&#25552;&#20379;&#30340;&#65292;&#36825;&#20123; ISP &#33258;&#24049;&#23601;&#26159;&#19968;&#20010;&#30001;&#21253;&#20132;&#25442;&#26426;&#21644;&#36890;&#20449;&#38142;&#36335;&#32452;&#25104;&#30340;&#32593;&#36335;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-2" name=ref-footnote-2>2</A></SUP>&#12290;&#24418;&#24335;&#21270;&#30340;&#35828;&#65292;<U>ISP &#23601;&#26159;&#32456;&#31471;&#31995;&#32479;&#25509;&#20837;&#32593;&#32476;&#30340;&#26041;&#24335;</U></SPAN>&#65307; 
<LI><SPAN class=extract>&#23454;&#20307;&#65306;<STRONG>&#23454;&#20307;</STRONG>&#65288;<EM>entity</EM>&#65289;&#34920;&#31034;&#20219;&#20309;&#21487;&#21457;&#36865;&#25110;&#32773;&#25509;&#21463;&#20449;&#24687;&#30340;&#36719;&#20214;&#25110;&#30828;&#20214;<U>&#36827;&#31243;</U>&#65288;&#19981;&#19968;&#23450;&#26159;&#20027;&#26426;&#65289;</SPAN>&#65307; 
<LI><SPAN class=extract>&#21327;&#35758;&#65306;<STRONG>&#21327;&#35758;</STRONG>&#65288;<EM>protocol</EM>&#65289;&#23450;&#20041;&#20102;&#32593;&#32476;&#19978;&#20219;&#24847;&#20004;&#20010;&#23545;&#31561;&#65288;&#21516;&#23618;&#65289;&#23454;&#20307;&#20043;&#38388;&#65292;&#25152;&#20132;&#25442;&#30340;&#28040;&#24687;&#30340;&#26684;&#24335;&#21450;&#39034;&#24207;&#65292;&#21516;&#26102;&#20063;&#23450;&#20041;&#20102;&#20256;&#36755;&#28040;&#24687;&#26102;&#25152;&#25191;&#34892;&#30340;&#21160;&#20316;<U>&#21644;/&#25110;</U>&#28040;&#24687;&#30340;&#25910;&#25454;&#65288;&#26377;&#21487;&#33021;&#20063;&#21253;&#25324;&#20854;&#23427;&#20107;&#20214;&#65289;</SPAN><SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-3" name=ref-footnote-3>3</A></SUP>&#65307; 
<LI><SPAN class=extract>TCP/IP&#65306;&#32593;&#32476;&#20013;&#30340;&#32456;&#31471;&#31995;&#32479;&#12289;&#21253;&#20132;&#25442;&#26426;&#31561;&#32452;&#20214;&#37117;&#26159;&#36890;&#36807;&#21327;&#35758;&#23454;&#29616;&#23545;&#28040;&#24687;&#30340;&#25910;&#21457;&#25511;&#21046;&#65292;&#20854;&#20013;&#26368;&#37325;&#35201;&#30340;&#20004;&#20010;&#21327;&#35758;&#23601;&#26159;<SPAN>&nbsp;</SPAN><STRONG>TCP</STRONG>&#65288;<EM>transmission control protocol</EM>&#65289;&#21644;<SPAN>&nbsp;</SPAN><STRONG>IP</STRONG>&#65288;<EM>Internet protocol</EM>&#65289;&#65292;IP &#21327;&#35758;&#25511;&#21046;&#30340;&#26159;&#32456;&#31471;&#31995;&#32479;&#21644;&#36335;&#30001;&#22120;&#20043;&#38388;&#25910;&#21457;&#21253;&#30340;&#26684;&#24335;</SPAN>&#65307; 
<LI><SPAN class=extract>&#32593;&#32476;&#26631;&#20934;&#65306;<STRONG>&#32593;&#32476;&#26631;&#20934;</STRONG>&#65288;<EM>Internet standard</EM>&#65289;&#30001;<SPAN>&nbsp;</SPAN><STRONG>IETF</STRONG>&#65288;&#32593;&#32476;&#24037;&#31243;&#20219;&#21153;&#32452;&#65289;&#36827;&#34892;&#25351;&#23450;&#65292;&#20854;&#26631;&#20934;&#25991;&#26723;&#34987;&#31216;&#20026;<SPAN>&nbsp;</SPAN><STRONG>RTFs</STRONG>&#65288;&#35745;&#31639;&#26426;&#19982;&#36890;&#20449;&#25991;&#20214;&#65289;&#65292;&#27491;&#26159;&#36825;&#19968;&#20221;&#25991;&#26723;&#23450;&#20041;&#20102;&#35832;&#22914; TCP,IP,HTTP &#31561;&#21508;&#31181;&#21508;&#26679;&#30340;&#21327;&#35758;</SPAN>&#65307; 
<LI><SPAN class=extract>&#22871;&#25509;&#23383;&#25509;&#21475;&#65306;<STRONG>&#22871;&#25509;&#23383;&#25509;&#21475;</STRONG>&#65288;<EM>socket interface</EM>&#65289;&#35268;&#23450;&#20102;&#36816;&#34892;&#22312;&#19968;&#20010;&#32456;&#31471;&#31995;&#32479;&#19978;&#30340;&#24212;&#29992;&#35201;&#22914;&#20309;&#20351;&#29992;&#32593;&#32476;&#32452;&#20214;&#23558;&#25968;&#25454;&#20998;&#21457;&#21040;&#20301;&#20110;&#21478;&#19968;&#20010;&#32456;&#31471;&#31995;&#32479;&#30340;&#24212;&#29992;&#19978;&#65292;&#31616;&#32780;&#35328;&#20043;&#23601;&#26159;&#21457;&#36865;&#28040;&#24687;&#30340;&#24212;&#29992;&#24517;&#39035;&#36981;&#23432;&#30340;&#19968;&#20123;&#35268;&#21017;</SPAN>&#65307; 
<LI><SPAN class=extract>&#20869;&#32593;&#22806;&#32593;&#65306;&#27880;&#24847;&#65292;<STRONG>&#20869;&#32593;</STRONG>&#65288;<EM>Intranet</EM>&#65289;&#21644;<STRONG>&#22806;&#32593;</STRONG>&#65288;<EM>Outhernet</EM>&#65289;&#30340;&#27010;&#24565;&#21644; LAN &#19981;&#19968;&#26679;&#65292;&#21069;&#32773;&#30528;&#37325;&#24378;&#35843;&#26435;&#38480;&#26041;&#38754;&#30340;&#38382;&#39064;</SPAN>&#65307;</LI></UL>
<P>&#26412;&#31456;&#32467;&#26500;&#65306;</P>
<P><img style="HEIGHT: 799px; WIDTH: 527px" alt=image-20220306183944464 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/Intro.png" width=1908 height=2939>