Some things to keep in mind while writing your test cases: </P>
<P>&#20889;&#27979;&#35797;&#29992;&#20363;&#26102;&#38656;&#35201;&#27880;&#24847;&#20197;&#19979;&#20960;&#28857;&#65306;</P>
<P>&#8226; User programs have access to a limited subset of the C standard library. You can &#64257;nd the user library in lib/.</P>
<P>&#29992;&#25143;&#31243;&#24207;&#21482;&#33021;&#35775;&#38382; C &#26631;&#20934;&#24211;&#30340;&#26576;&#20010;&#23376;&#38598;&#65292;&#20855;&#20307;&#26469;&#35828;&#23601;&#26159; lib/ &#19979;&#30340;&#21508;&#31181;&#24211;&#20989;&#25968;&#65288;&#37027;&#20123;&#20026; pintos &#19978;&#36816;&#34892;&#30340;&#29992;&#25143;&#31243;&#24207;&#23450;&#20041;&#30340;&#20989;&#25968;&#65289;</P>
<P>&#8226; User programs cannot directly access variables in the kernel. </P>
<P>&#29992;&#25143;&#31243;&#24207;&#65288;&#27979;&#35797;&#29992;&#20363;&#65289;&#19981;&#33021;&#30452;&#25509;&#35775;&#38382;&#20869;&#26680;&#20013;&#30340;&#21464;&#37327;</P>
<P>&#8226; User programs do not have access to malloc, since brk and sbrk are not implemented. User programs also have a limited stack size. If you need a large bu&#64256;er, make it a static global variable. </P>
<P>&#29992;&#25143;&#31243;&#24207;&#19981;&#33021;&#30452;&#25509;&#20351;&#29992; malloc&#65288;brk &#21644; sbrk &#26242;&#26102;&#27809;&#26377;&#23454;&#29616;&#65289;&#21516;&#26102;&#65292;&#27979;&#35797;&#29992;&#20363;&#31243;&#24207;&#20063;&#21482;&#33021;&#26377;&#19968;&#20010;&#21463;&#38480;&#30340;&#26632;&#31354;&#38388;&#65292;&#22914;&#26524;&#38656;&#35201;&#19968;&#20010;&#22823;&#32531;&#23384;&#65292;&#38656;&#35201;&#23558;&#20854;&#22768;&#26126;&#20026;&#38745;&#24577;&#20840;&#23616;&#21464;&#37327;</P>
<P>&#8226; Pintos starts with 4 MB of memory and the &#64257;le system block device is 2 MB by default. Don&#8217;t use data structures or &#64257;les that exceed these sizes. </P>
<P>&#19968;&#26041;&#38754;&#65292;&#31243;&#24207;&#25968;&#25454;&#32467;&#26500;&#30340;&#22823;&#23567;&#19981;&#33021;&#36229;&#36807; 4MB&#65292;&#25991;&#20214;&#31995;&#32479;&#22359;&#22823;&#23567;&#20063;&#19981;&#33021;&#36229;&#36807; 2 MB&#65292;&#22240;&#27492;&#19981;&#33021;&#36229;&#36807;&#23427;&#20204;&#30340;&#22823;&#23567;</P>
<P>&#8226; Your test should use msg() instead of printf() (they have the same function signature).</P>
<P>&#27979;&#35797;&#29992;&#20363;&#31243;&#24207;&#38656;&#35201;&#20351;&#29992; msg() &#32780;&#19981;&#26159; printf() &#31243;&#24207;