<P width=0><SPAN class=sidebar_name><B><I><SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> 4.6.3 Thread Context Switch : Separating mechanism from policy</SPAN></FONT></I></B></SPAN></P><SPAN class=extract>
<P>The <EM>mechanisms</EM> we discuss in this Chapter work regardless of the <EM>policy</EM> the scheduler uses when choosing threads</P>
<P>&#25919;&#31574;&#65288;policy&#65289;&#25351;&#30340;&#24212;&#35813;&#26159;&#35843;&#24230;&#22120;&#25152;&#36873;&#29992;&#30340;&#12289;&#29992;&#26469;&#25361;&#36873;&#19979;&#19968;&#27493;&#23558;&#35201;&#25191;&#34892;&#20160;&#20040;&#32447;&#31243;&#30340;&#25919;&#31574;</P></SPAN>
<P><SPAN class=extract>&#26426;&#21046;&#65288;mechanism&#65289;&#25351;&#30340;&#24212;&#35813;&#23601;&#26159;&#35843;&#24230;&#22120;&#35201;&#22914;&#20309;&#23454;&#29616;&#32447;&#31243;&#20999;&#25442;&#65292;&#25442;&#21477;&#35805;&#26469;&#35828;&#23601;&#26159;&#32447;&#31243;&#19978;&#19979;&#25991;&#20999;&#25442;&#30340;&#23454;&#29616;</SPAN></P>
<P>Separating mechanism from policy is a useful and widely applied principle in operating system design. When mechanism and policy are cleanly separated, it is easier to introduce new policies to optimize a system for a new workload or new technology. </P>
<P>&#22914;&#26524;&#23558;&#26426;&#21046;&#21644;&#25919;&#31574;&#20998;&#24320;&#65292;&#37027;&#20040;&#24341;&#20837;&#26032;&#30340;&#25919;&#31574;&#23601;&#26174;&#24471;&#38750;&#24120;&#31616;&#21333;</P><SPAN class=extract>
<P>For example, the thread context switch abstraction cleanly separates mechanism (how to switch between threads) from policy (which thread to run) so that the mechanism works no matter what policy is used.</P>
<P>&#22914;&#26524;&#23558;&#26426;&#21046;&#21644;&#25919;&#31574;&#20998;&#24320;&#65292;&#37027;&#20040;&#24341;&#20837;&#26032;&#30340;&#25919;&#31574;&#23601;&#26174;&#24471;&#38750;&#24120;&#31616;&#21333;&#65292;&#20854;&#26412;&#36136;&#21407;&#22240;&#26159;&#26356;&#25913;&#35843;&#24230;&#22120;&#25919;&#31574;&#26102;&#26080;&#38656;&#26356;&#25442;&#25110;&#32773;&#35828;&#20462;&#25913;&#26426;&#21046;&#23454;&#29616;&nbsp;</P></SPAN>
<P>Some systems can elect to do something simple (e.g., FIFO scheduling); other systems can optimize scheduling to meet their goals (e.g., a periodic scheduler to smoothly run real-time multimedia streams for a media device, a round-robin scheduler to balance responsiveness and throughput for a server, or a priority scheduler that devotes most resources to the visible application on a smartphone). </P>
<P>&#20063;&#23601;&#26159;&#35828;&#65292;&#23558;&#26426;&#21046;&#21644;&#26550;&#26500;&#20998;&#24320;&#33021;&#20351;&#31995;&#32479;&#23545;&#25919;&#31574;&#30340;&#36873;&#25321;&#26356;&#21152;&#33258;&#30001;</P><SPAN class=extract>
<P>We will see this principle many times in this book. For example, thread synchronization mechanisms work regardless of the scheduling policy; file metadata mechanisms for locating a file&#8217;s blocks work regardless of the policy for where to place the file&#8217;s blocks on disk; and page translation mechanisms for mapping virtual to physical addresses work regardless of which physical pages the operating system assigns to each process.</P>
<P>&#20165;&#20174;&#36825;&#37324;&#26469;&#30475;&#65292;&#23558;&#26550;&#26500;&#21644;&#25919;&#31574;&#20998;&#24320;&#30340;&#31574;&#30053;&#20250;&#22312;&#38750;&#24120;&#22810;&#22320;&#26041;&#34987;&#20351;&#29992;&#65306;</P>
<P>1. &#32447;&#31243;&#21516;&#27493;&#26426;&#21046;&#21644;&#35843;&#24230;&#25919;&#31574;&#35299;&#32806;&#65307;</P>
<P>2. &#29992;&#20110;&#23450;&#20301;&#25991;&#20214;&#25968;&#25454;&#22359;&#30340;&#20803;&#25968;&#25454;&#26550;&#26500;&#21644;&#25991;&#20214;&#25968;&#25454;&#22359;&#25918;&#32622;&#20301;&#32622;&#36873;&#25321;&#35299;&#32806;&#65307;</P>
<P>3. &#29992;&#20110;&#34394;&#25311;&#22320;&#22336;&#21644;&#29289;&#29702;&#22320;&#22336;&#36716;&#25442;&#30340;&#20869;&#23384;&#39029;&#65288;&#30913;&#30424;&#39029;&#65311;&#65289;&#36716;&#25442;&#26426;&#21046;&#21644;&#25805;&#20316;&#31995;&#32479;&#20250;&#23558;&#21738;&#20010;&#29289;&#29702;&#39029;&#20998;&#37197;&#32473;&#36827;&#31243;&#35299;&#32806;&#65307;<BR></P>
<P></SPAN>