The int instruction saves the program counter, stack pointer, and eflags on the kernel stack before jumping to the system call handler through the interrupt vector table. The kernel handler saves any additional registers that must be preserved across function calls. It then examines the system call integer code in %eax, verifies that it is a legal opcode, and calls the correct stub for that system call 
<P></P>
<P><SPAN class=extract>&#29992;&#25143;&#23618;&#26729;&#31243;&#24207;&#25152;&#25191;&#34892;&#30340; `INT` &#25351;&#20196;&#20250;&#22312;&#36339;&#36716;&#21040;&#31995;&#32479;&#35843;&#29992;&#22788;&#29702;&#31243;&#24207;&#20043;&#21069;&#65292;&#20445;&#23384;&#19977;&#20010;&#20851;&#38190;&#20540;</SPAN> 
<P><SPAN class=extract>&#31995;&#32479;&#35843;&#29992;&#22788;&#29702;&#31243;&#24207;&#24182;&#38750;&#30001;&#29992;&#25143;&#36827;&#31243;&#30452;&#25509;&#35843;&#29992;&#65292;&#32780;&#26159;&#36890;&#36807;&#29992;&#25143;&#26729;&#31243;&#24207;&#20195;&#20026;&#20854;&#36827;&#34892; </SPAN>
<P><SPAN class=extract>&#31995;&#32479;&#35843;&#29992;&#22788;&#29702;&#31243;&#24207;&#34987;&#35843;&#29992;&#20043;&#21518;&#65292;&#39318;&#20808;&#20250;&#23558;&#21097;&#20313;&#26410;&#20445;&#23384;&#30340;&#23492;&#23384;&#22120;&#20445;&#23384;&#21040;&#20013;&#26029;&#26632;&#20013;&#65292;&#38543;&#21518;&#20250;&#26816;&#26597;&#31995;&#32479;&#35843;&#29992; Opcode &#26159;&#21542;&#21512;&#27861;&#65292;&#26368;&#21518;&#20877;&#35843;&#29992;&#21512;&#36866;&#30340;&#20869;&#26680;&#26729;&#31243;&#24207;</SPAN></P>
<P><SPAN class=extract>&#26080;&#35770;&#26159;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#12289;&#24322;&#24120;&#22788;&#29702;&#31243;&#24207;&#36824;&#26159;&#31995;&#32479;&#35843;&#29992;&#22788;&#29702;&#31243;&#24207;&#34987;&#35843;&#29992;&#30340;&#31532;&#19968;&#26102;&#38388;&#37117;&#26159;&#23558;&#26410;&#34987;&#30828;&#20214;&#20445;&#23384;&#30340;&#23492;&#23384;&#22120;&#20445;&#23384;&#36215;&#26469;</SPAN></P>
<P><SPAN class=extract>&#31995;&#32479;&#35843;&#29992;&#20013;&#30340;&#20869;&#26680;&#26729;&#31243;&#24207;&#24182;&#38750;&#30001;&#29992;&#25143;&#26729;&#31243;&#24207;&#30452;&#25509;&#35843;&#29992;&#65292;&#32780;&#26159;&#30001;&#31995;&#32479;&#35843;&#29992;&#22788;&#29702;&#31243;&#24207;&#35843;&#29992;</SPAN></P>
<P><SPAN class=extract>&#31995;&#32479;&#35843;&#29992;&#22788;&#29702;&#31243;&#24207;&#22312;&#35843;&#29992;&#20869;&#26680;&#32423;&#26729;&#31243;&#24207;&#20043;&#21069;&#65292;&#20250;&#26816;&#26597; %eax &#20013;&#30340; Opcode &#26159;&#21542;&#21512;&#27861;</SPAN>