<SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> Relocation</SPAN></FONT> 
<P></P><SPAN class=extract>
<P>Relocation is the process of connecting symbolic references with symbolic definitions. </P>
<P>&#37325;&#23450;&#20301;&#26412;&#36136;&#19978;&#26469;&#35828;&#26159;&#23558;&#31526;&#21495;&#21270;&#24341;&#29992;&#21644;&#31526;&#21495;&#21270;&#23450;&#20041;&#32852;&#31995;&#22312;&#19968;&#36215;&#30340;&#36807;&#31243;</P></SPAN><SPAN class=extract>
<P>For example, when a program calls a function, the associated call instruction must transfer control to the proper destination address at execution. </P>
<P>&#25152;&#35859;&#31526;&#21495;&#21270;&#24341;&#29992;&#25351;&#30340;&#23601;&#26159;&#20989;&#25968;&#30340;&#21517;&#31216;&#65292;&#31526;&#21495;&#21270;&#23450;&#20041;&#25351;&#30340;&#23601;&#26159;&#20989;&#25968;&#30340;&#23454;&#29616;</P></SPAN><SPAN class=extract>
<P>In other words, relocatable files must have information that describes how to modify their section contents, thus allowing executable and shared object files to hold the right information for a process's program image. </P>
<P>&#37325;&#23450;&#20301;&#36807;&#31243;&#21457;&#29983;&#22312;&#21019;&#24314;&#36827;&#31243;&#26144;&#20687;&#20043;&#21069;</P>
<P>&#37325;&#23450;&#20301;&#25991;&#20214;&#20013;&#25152;&#25551;&#36848;&#30340;&#20449;&#24687;&#20250;&#34987;&#29992;&#20110;&#20462;&#25913; section &#20013;&#30340;&#20869;&#23481;&#65292;&#20197;&#20415;&#21487;&#25191;&#34892;&#25991;&#20214;&#21644;&#23545;&#35937;&#25991;&#20214;&#21253;&#21547;&#26377;&#27491;&#30830;&#30340;&#12289;&#33021;&#34987;&#29992;&#20110;&#21019;&#24314;&#36827;&#31243;&#26144;&#20687;&#30340;&#20449;&#24687;</P></SPAN><SPAN class=extract>
<P>Relocation entries are these data.</P>
<P>&#37325;&#23450;&#20301;&#34920;&#39033;&#23601;&#26159;&#37027;&#20123;&#25551;&#36848;&#22914;&#20309;&#20462;&#25913;&#21487;&#37325;&#23450;&#20301;&#25991;&#20214;&#20013;&#30340; section content&#65292;&#20174;&#32780;&#20801;&#35768;&#21487;&#25191;&#34892;&#25991;&#20214;&#21644;&#20849;&#20139;&#23545;&#35937;&#25991;&#20214;&#20445;&#23384;&#27491;&#30830;&#30340;&#20449;&#24687;</P>
<P></SPAN>