<HEAD></HEAD>
<BODY>
<H1 id=introduction><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> Introduction</SPAN></FONT></FONT></H1>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#19979;&#38754;&#26159;&#19968;&#20123;&#22522;&#26412;&#27010;&#24565;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#32456;&#31471;&#19982;&#36335;&#30001;&#22120;&#65306;<STRONG>&#32456;&#31471;&#31995;&#32479;</STRONG>&#65288;<EM>end system</EM>&#65289;&#25110;&#32773;&#35828;<STRONG>&#20027;&#26426;</STRONG>&#65288;<EM>host</EM>&#65289;&#22522;&#26412;&#19978;&#33021;&#34987;&#35748;&#20026;&#26159;&#25105;&#20204;&#26085;&#24120;&#20351;&#29992;&#30340;&#65292;&#30452;&#25509;&#38754;&#21521;&#26222;&#36890;&#29992;&#25143;&#30340;&#30005;&#23376;&#20135;&#21697;&#12290;&#23558;&#36825;&#20123;&#32456;&#31471;&#31995;&#32479;&#36830;&#25509;&#36215;&#26469;&#30340;&#23601;&#26159;&#30001;<STRONG>&#36890;&#20449;&#38142;&#36335;</STRONG>&#65288;<EM>communication link</EM>&#65289;&#21644;<STRONG>&#21253;&#20132;&#25442;&#26426;</STRONG>&#65288;<EM>packet switch</EM>&#65289;&#25152;&#32452;&#25104;&#30340;&#32593;&#32476;&#65292;&#20854;<STRONG>&#20256;&#36755;&#36895;&#29575;</STRONG>&#65288;<EM>transmit rate</EM>&#65289;&#30340;&#21333;&#20301;&#26159; bit &#27599;&#31186;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#36830;&#25509;&#65306;&#22914;&#26524;&#20004;&#21488;&#35745;&#31639;&#26426;&#33021;&#22815;&#20132;&#25442;&#25968;&#25454;&#65292;&#37027;&#20040;&#23601;&#31216;&#36825;&#20004;&#21488;&#35745;&#31639;&#26426;<STRONG>&#30456;&#20114;&#36830;&#25509;</STRONG>&#65288;<EM>interconnected</EM>&#65289;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#21253;&#65306;&#32456;&#31471;&#31995;&#32479;&#21457;&#36865;&#25968;&#25454;&#26102;&#65292;&#20250;&#23558;&#25968;&#25454;&#20998;&#25104;&#19968;&#20010;&#20010;<STRONG>&#21253;</STRONG>&#65288;<EM>packet</EM>&#65289;&#65292;&#21516;&#26102;&#20998;&#21035;&#20026;&#36825;&#20123;&#21253;&#21152;&#19978;&#22836;&#23383;&#33410;&#65288;<EM>header byte</EM>&#65289;&#65307;&#32780;&#22312;&#25509;&#21463;&#31471;&#30340;&#32456;&#31471;&#31995;&#32479;&#20013;&#65292;&#20250;&#23558;&#36825;&#20123;&#21253;&#37325;&#32452;&#25104;&#21407;&#26469;&#30340;&#25968;&#25454;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#21253;&#20132;&#25442;&#26426;&#65306;<STRONG>&#21253;&#20132;&#25442;&#26426;</STRONG>&#65288;<EM>packet switch</EM>&#65289;&#26412;&#36136;&#19978;&#26159;&#19968;&#20010;&#20174;&#25509;&#25910;&#31471;&#25509;&#25910;&#25968;&#25454;&#21253;&#24182;&#21521;&#21457;&#36865;&#31471;&#21457;&#36865;&#20986;&#21435;&#30340;&#35774;&#22791;&#12290;&#20856;&#22411;&#30340;&#21253;&#20132;&#25442;&#26426;&#26159;<STRONG>&#36335;&#30001;&#22120;</STRONG>&#65288;<EM>router</EM>&#65289;&#21644;<STRONG>&#38142;&#36335;&#23618;&#20132;&#25442;&#26426;</STRONG>&#65288;<EM>link-layer switch</EM>&#65289;&#65292;&#21069;&#32773;&#22810;&#29992;&#20110;<STRONG>&#32593;&#32476;&#26680;&#24515;</STRONG>&#65288;<EM>network core</EM>&#65289;&#65292;&#21518;&#32773;&#22810;&#29992;&#20110;<STRONG>&#32593;&#32476;&#25509;&#20837;</STRONG>&#65288;<EM>access network</EM>&#65289;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-1" name=ref-footnote-1>1</A></SUP>&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#36335;&#30001;&#21644;&#36335;&#65306;<STRONG>&#36335;&#30001;</STRONG>&#65288;<EM>route</EM>&#65289;&#25110;&#32773;<STRONG>&#36335;</STRONG>&#65288;<EM>path</EM>&#65289;&#26159;&#32593;&#32476;&#20013;&#30001;&#21253;&#20132;&#25442;&#26426;&#21644;&#36890;&#20449;&#38142;&#36335;&#25152;&#32452;&#25104;&#30340;<U>&#36335;&#24452;</U>&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">ISP&#65306;&#20840;&#29699;&#21508;&#22320;&#30340;&#32456;&#31471;&#31995;&#32479;&#20043;&#38388;&#30456;&#20114;&#36830;&#25509;&#30340;&#26381;&#21153;&#65292;&#23454;&#38469;&#19978;&#26159;&#30001;<STRONG>&#32593;&#32476;&#26381;&#21153;&#20379;&#24212;&#21830;</STRONG>&#65288;<EM>Internet service provider</EM>&#65289;&#26469;&#25552;&#20379;&#30340;&#65292;&#36825;&#20123; ISP &#33258;&#24049;&#23601;&#26159;&#19968;&#20010;&#30001;&#21253;&#20132;&#25442;&#26426;&#21644;&#36890;&#20449;&#38142;&#36335;&#32452;&#25104;&#30340;&#32593;&#36335;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-2" name=ref-footnote-2>2</A></SUP>&#12290;&#24418;&#24335;&#21270;&#30340;&#35828;&#65292;<U>ISP &#23601;&#26159;&#32456;&#31471;&#31995;&#32479;&#25509;&#20837;&#32593;&#32476;&#30340;&#26041;&#24335;</U>&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#23454;&#20307;&#65306;<STRONG>&#23454;&#20307;</STRONG>&#65288;<EM>entity</EM>&#65289;&#34920;&#31034;&#20219;&#20309;&#21487;&#21457;&#36865;&#25110;&#32773;&#25509;&#21463;&#20449;&#24687;&#30340;&#36719;&#20214;&#25110;&#30828;&#20214;<U>&#36827;&#31243;</U>&#65288;&#19981;&#19968;&#23450;&#26159;&#20027;&#26426;&#65289;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#21327;&#35758;&#65306;<STRONG>&#21327;&#35758;</STRONG>&#65288;<EM>protocol</EM>&#65289;&#23450;&#20041;&#20102;&#32593;&#32476;&#19978;&#20219;&#24847;&#20004;&#20010;&#23545;&#31561;&#65288;&#21516;&#23618;&#65289;&#23454;&#20307;&#20043;&#38388;&#65292;&#25152;&#20132;&#25442;&#30340;&#28040;&#24687;&#30340;&#26684;&#24335;&#21450;&#39034;&#24207;&#65292;&#21516;&#26102;&#20063;&#23450;&#20041;&#20102;&#20256;&#36755;&#28040;&#24687;&#26102;&#25152;&#25191;&#34892;&#30340;&#21160;&#20316;<U>&#21644;/&#25110;</U>&#28040;&#24687;&#30340;&#25910;&#25454;&#65288;&#26377;&#21487;&#33021;&#20063;&#21253;&#25324;&#20854;&#23427;&#20107;&#20214;&#65289;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-3" name=ref-footnote-3>3</A></SUP>&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">TCP/IP&#65306;&#32593;&#32476;&#20013;&#30340;&#32456;&#31471;&#31995;&#32479;&#12289;&#21253;&#20132;&#25442;&#26426;&#31561;&#32452;&#20214;&#37117;&#26159;&#36890;&#36807;&#21327;&#35758;&#23454;&#29616;&#23545;&#28040;&#24687;&#30340;&#25910;&#21457;&#25511;&#21046;&#65292;&#20854;&#20013;&#26368;&#37325;&#35201;&#30340;&#20004;&#20010;&#21327;&#35758;&#23601;&#26159;<SPAN>&nbsp;</SPAN><STRONG>TCP</STRONG>&#65288;<EM>transmission control protocol</EM>&#65289;&#21644;<SPAN>&nbsp;</SPAN><STRONG>IP</STRONG>&#65288;<EM>Internet protocol</EM>&#65289;&#65292;IP &#21327;&#35758;&#25511;&#21046;&#30340;&#26159;&#32456;&#31471;&#31995;&#32479;&#21644;&#36335;&#30001;&#22120;&#20043;&#38388;&#25910;&#21457;&#21253;&#30340;&#26684;&#24335;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#26631;&#20934;&#65306;<STRONG>&#32593;&#32476;&#26631;&#20934;</STRONG>&#65288;<EM>Internet standard</EM>&#65289;&#30001;<SPAN>&nbsp;</SPAN><STRONG>IETF</STRONG>&#65288;&#32593;&#32476;&#24037;&#31243;&#20219;&#21153;&#32452;&#65289;&#36827;&#34892;&#25351;&#23450;&#65292;&#20854;&#26631;&#20934;&#25991;&#26723;&#34987;&#31216;&#20026;<SPAN>&nbsp;</SPAN><STRONG>RTFs</STRONG>&#65288;&#35745;&#31639;&#26426;&#19982;&#36890;&#20449;&#25991;&#20214;&#65289;&#65292;&#27491;&#26159;&#36825;&#19968;&#20221;&#25991;&#26723;&#23450;&#20041;&#20102;&#35832;&#22914; TCP,IP,HTTP &#31561;&#21508;&#31181;&#21508;&#26679;&#30340;&#21327;&#35758;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#22871;&#25509;&#23383;&#25509;&#21475;&#65306;<STRONG>&#22871;&#25509;&#23383;&#25509;&#21475;</STRONG>&#65288;<EM>socket interface</EM>&#65289;&#35268;&#23450;&#20102;&#36816;&#34892;&#22312;&#19968;&#20010;&#32456;&#31471;&#31995;&#32479;&#19978;&#30340;&#24212;&#29992;&#35201;&#22914;&#20309;&#20351;&#29992;&#32593;&#32476;&#32452;&#20214;&#23558;&#25968;&#25454;&#20998;&#21457;&#21040;&#20301;&#20110;&#21478;&#19968;&#20010;&#32456;&#31471;&#31995;&#32479;&#30340;&#24212;&#29992;&#19978;&#65292;&#31616;&#32780;&#35328;&#20043;&#23601;&#26159;&#21457;&#36865;&#28040;&#24687;&#30340;&#24212;&#29992;&#24517;&#39035;&#36981;&#23432;&#30340;&#19968;&#20123;&#35268;&#21017;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#20869;&#32593;&#22806;&#32593;&#65306;&#27880;&#24847;&#65292;<STRONG>&#20869;&#32593;</STRONG>&#65288;<EM>Intranet</EM>&#65289;&#21644;<STRONG>&#22806;&#32593;</STRONG>&#65288;<EM>Outhernet</EM>&#65289;&#30340;&#27010;&#24565;&#21644; LAN &#19981;&#19968;&#26679;&#65292;&#21069;&#32773;&#30528;&#37325;&#24378;&#35843;&#26435;&#38480;&#26041;&#38754;&#30340;&#38382;&#39064;&#65307;</FONT></LI></UL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#26412;&#31456;&#32467;&#26500;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220306183944464 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/Intro.png"></FONT></P>
<H2 id=&#32593;&#32476;&#32467;&#26500;><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#32467;&#26500;</FONT></H2>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#35745;&#31639;&#26426;&#32593;&#36335;&#23454;&#38469;&#19978;&#26377;&#19977;&#31181;&#19981;&#21516;&#30340;&#27979;&#24230;&#65306;</FONT></P>
<OL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#25299;&#25169;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#35268;&#27169;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#36793;&#30028;&#65307;</FONT></LI></OL>
<H3 id=&#25299;&#25169;><FONT style="BACKGROUND-COLOR: #7be1e1">&#25299;&#25169;</FONT></H3>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#25299;&#25169;&#20165;&#20174;&#32593;&#32476;&#20013;&#32456;&#31471;&#31995;&#32479;&#21644;&#36890;&#20449;&#38142;&#36335;&#25152;&#24418;&#25104;&#30340;&#32467;&#26500;&#30475;&#24453;&#32593;&#32476;</FONT></P>
<P><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#24635;&#32447;&#25299;&#25169;</FONT></STRONG></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#24635;&#32447;&#25299;&#25169;&#20013;&#30340;&#25152;&#26377;&#35774;&#22791;&#37117;&#36890;&#36807;&#21333;&#19968;&#19968;&#26465;&#36890;&#20449;&#30005;&#32518;&#23454;&#29616;&#30456;&#36830;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220303190220445 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220303190220445.png"></FONT></P>
<P><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#26143;&#22411;&#25110;&#26641;&#29366;&#25299;&#25169;</FONT></STRONG></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#26143;&#22411;&#25299;&#25169;&#24120;&#35265;&#20110;&#20197;&#22826; LAN &#32593;&#20013;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220303190448393 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220303190448393.png"></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#26356;&#22823;&#35268;&#27169;&#30340;&#32593;&#32476;&#20250;&#20351;&#29992;&#25299;&#23637;&#30340;&#26143;&#22411;&#25299;&#25169;&#32593;&#32476;&#65292;&#20063;&#23601;&#26159;&#26641;&#29366;&#32593;&#32476;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220303190537852 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220303190537852.png"></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#65288;&#36825;&#31181;&#31867;&#22411;&#30340;&#32593;&#32476;&#20284;&#20046;&#33021;&#20943;&#23569;&#38656;&#35201;&#32463;&#36807;&#30340;&#32447;&#30340;&#25968;&#30446;&#65289;</FONT></P>
<P><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#29615;&#29366;&#25299;&#25169;</FONT></STRONG></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#36825;&#31181;&#32593;&#32476;&#20013;&#20250;&#26377;&#19968;&#20010;&#19968;&#30452;&#27839;&#19968;&#20010;&#26041;&#21521;&#20256;&#36755;&#30340;<STRONG>&#24103;</STRONG>&#65288;<EM>frame</EM>&#65289;&#65292;&#27599;&#24403;&#35813;&#24103;&#32463;&#36807;&#26576;&#20010;&#33410;&#28857;&#26102;&#65292;&#22914;&#26524;&#35813;&#33410;&#28857;&#24819;&#35201;&#20256;&#36755;&#25968;&#25454;&#65292;&#23601;&#23558;&#25968;&#25454;&#21644;&#30446;&#26631;&#22320;&#22336;&#28155;&#21152;&#21040;&#35813;&#24103;&#20013;&#12290;&#21482;&#26377;&#31561;&#21040;&#36825;&#20010;&#24103;&#21040;&#30446;&#30340;&#22320;&#20102;&#65292;&#25165;&#20250;&#23558;&#25968;&#25454;&#20174;&#20013;&#21076;&#38500;&#65292;&#21542;&#21017;&#23558;&#20250;&#19968;&#30452;&#27839;&#30528;&#29615;&#29366;&#32467;&#26500;&#20256;&#25773;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220303190926875 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220303190926875.png"></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#32771;&#34385;&#21040;&#21333;&#29615;&#21482;&#33021;&#21333;&#21521;&#20256;&#25773;&#25968;&#25454;&#30340;&#29305;&#24615;&#65292;&#20063;&#26377;&#38024;&#23545;&#27492;&#25913;&#36827;&#30340;&#21452;&#29615;&#25299;&#25169;&#32467;&#26500;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220303191128837 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220303191128837.png"></FONT></P>
<H3 id=&#35268;&#27169;><FONT style="BACKGROUND-COLOR: #7be1e1">&#35268;&#27169;</FONT></H3>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#22914;&#26524;&#25353;&#29031;&#32593;&#32476;&#35268;&#27169;&#23545;&#32593;&#32476;&#36827;&#34892;&#21010;&#20998;&#30340;&#35805;&#65292;&#33021;&#20998;&#20026;&#19977;&#31181;&#65306;</FONT></P>
<OL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">LAN&#65288;MAN&#65289;&#65306;&#23616;&#22495;&#32593;&#65292;&#24378;&#35843;&#26576;&#19968;&#22359;&#36739;&#23567;&#30340;&#22320;&#21306;&#20013;&#32456;&#31471;&#31995;&#32479;&#30456;&#20114;&#36830;&#25509;&#25152;&#20381;&#36182;&#30340;&#32593;&#32476;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">WAN&#65306;&#24191;&#22495;&#32593;&#65292;&#30456;&#27604;&#20110;&#23616;&#22495;&#32593;&#26469;&#35828;&#65292;&#25152;&#28085;&#30422;&#30340;&#21306;&#22495;&#33539;&#22260;&#26356;&#22823;&#20102;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">Internet&#65306;&#22240;&#29305;&#32593;&#65292;&#22218;&#25324;&#25972;&#20010;&#19990;&#30028;&#33539;&#22260;&#65307;</FONT></LI></OL>
<H3 id=&#36793;&#30028;><FONT style="BACKGROUND-COLOR: #7be1e1">&#36793;&#30028;</FONT></H3>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#22914;&#26524;&#25353;&#29031;&#32593;&#32476;&#30340;&#36793;&#30028;&#36827;&#34892;&#21010;&#20998;&#30340;&#35805;&#65292;&#32593;&#32476;&#33021;&#20998;&#20026;&#20004;&#31181;&#65306;</FONT></P>
<OL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><STRONG>&#20869;&#32852;&#32593;</STRONG>&#65288;<EM>intranet</EM>&#65289;&#65306;&#20869;&#32852;&#32593;&#19968;&#33324;&#26159;&#26576;&#20010;&#20225;&#19994;&#30340;&#31169;&#26377;&#32593;&#65292;&#21253;&#25324;&#35768;&#22810;&#30456;&#20114;&#36830;&#25509;&#30340;&#23616;&#22495;&#32593;&#65292;&#21487;&#33021;&#31199;&#29992;&#37096;&#20998;&#24191;&#22495;&#32593;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><STRONG>&#22806;&#32852;&#32593;</STRONG>&#65288;<EM>extranet</EM>&#65289;&#65306;&#22806;&#32852;&#32593;&#21487;&#20197;&#34987;&#30475;&#20570;&#26159;&#26576;&#20010;&#20844;&#21496;&#26292;&#38706;&#32473;&#29992;&#25143;&#30340;&#37096;&#20998;&#32593;&#32476;&#65307;</FONT></LI></OL>
<H2 id=&#32593;&#32476;&#36793;&#32536;><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#36793;&#32536;</FONT></H2>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#20808;&#20171;&#32461;&#19968;&#20123;&#27010;&#24565;&#65306;</FONT></P>
<OL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#20027;&#26426;&#65306;&#32771;&#34385;&#21040;&#32456;&#31471;&#31995;&#32479;&#32463;&#24120;&#20316;&#20026;&#32593;&#32476;&#24212;&#29992;&#36816;&#34892;&#30340;&#29289;&#29702;&#36733;&#20307;&#65292;&#22240;&#27492;&#24448;&#24448;&#19981;&#21152;&#21306;&#20998;&#30340;&#28151;&#29992;<STRONG>&#20027;&#26426;</STRONG>&#65288;<EM>host</EM>&#65289;&#21644;<STRONG>&#32456;&#31471;&#31995;&#32479;</STRONG>&#65288;<EM>end system</EM>&#65289;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-4" name=ref-footnote-4>4</A></SUP>&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#23458;&#25143;&#31471;&#21644;&#26381;&#21153;&#22120;&#65306;&#26377;&#26102;&#20027;&#26426;&#20250;&#34987;&#36827;&#19968;&#27493;&#21306;&#20998;&#20026;<STRONG>&#23458;&#25143;&#31471;</STRONG>&#65288;<EM>clients</EM>&#65289;&#21644;<STRONG>&#26381;&#21153;&#22120;</STRONG>&#65288;<EM>servers</EM>&#65289;&#65292;&#26381;&#21153;&#22120;&#24448;&#24448;&#22352;&#33853;&#20110;&#22823;&#22411;&#30340;<STRONG>&#25968;&#25454;&#20013;&#24515;</STRONG>&#65288;<EM>data center</EM>&#65289;&#65307;</FONT></LI></OL>
<H3 id=&#25509;&#20837;&#32593;><FONT style="BACKGROUND-COLOR: #7be1e1">&#25509;&#20837;&#32593;</FONT></H3>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><STRONG>&#25509;&#20837;&#32593;</STRONG>&#65288;<EM>access network</EM>&#65289;&#25351;&#30340;&#26159;&#23558;&#32456;&#31471;&#35774;&#22791;&#21644;&#31532;&#19968;&#20010;&#36935;&#21040;&#30340;&#36335;&#30001;&#22120;&#65288;&#20063;&#31216;&#20026;&#36793;&#32536;&#36335;&#30001;&#22120;&#65292;edge router&#65289;&#36830;&#25509;&#36215;&#26469;&#30340;&#32593;&#32476;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-5" name=ref-footnote-5>5</A></SUP>&#65292;&#20027;&#27969;&#30340;&#25509;&#20837;&#32593;&#26041;&#24335;&#26377;&#20004;&#31181;&#65306;</FONT></P>
<OL>
<LI>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><STRONG>&#25968;&#23383;&#35746;&#38405;&#32447;&#36335;</STRONG>&#65288;<EM>digital subscriber line</EM>&#65289;&#65306;&#20381;&#25176;&#30005;&#35805;&#20844;&#21496;&#30340;&#22522;&#30784;&#35774;&#26045;&#25645;&#24314;&#30340;&#32593;&#32476;&#65307;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#19981;&#20849;&#20139;&#65307;</FONT></LI></UL>
<LI>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><STRONG>&#30005;&#32518;</STRONG>&#65288;<EM>cable</EM>&#65289;&#65306;&#20381;&#25176;&#26377;&#32447;&#30005;&#35270;&#20844;&#21496;&#30340;&#22522;&#30784;&#35774;&#26045;&#25645;&#24314;&#30340;&#32593;&#32476;&#65307;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#20849;&#20139;&#65307;</FONT></LI></UL></LI></OL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#26412;&#23567;&#33410;&#30340;&#37325;&#28857;&#22312;&#20110;&#29702;&#35299;&#32456;&#31471;&#29992;&#25143;&#25509;&#20837;&#32593;&#32476;&#30340;&#27169;&#24335;&#65292;&#19981;&#24517;&#25304;&#27877;&#20110;&#25509;&#20837;&#32593;&#30340;&#20855;&#20307;&#24418;&#24335;&#65306;&#32456;&#31471;&#31995;&#32479;&#19982;&#29483;&#30456;&#36830;&#65292;&#30001;&#23427;&#23558;&#25968;&#23383;&#20449;&#21495;&#36716;&#21270;&#20026;&#27169;&#25311;&#20449;&#21495;&#12290;&#38543;&#21518;&#65292;&#36825;&#32929;&#27169;&#25311;&#20449;&#21495;&#20250;&#21644;&#21407;&#26377;&#30340;&#20449;&#21495;&#65288;&#30005;&#35805;&#20449;&#21495;&#25110;&#26377;&#32447;&#30005;&#35270;&#20449;&#21495;&#65289;&#21512;&#27969;&#65292;&#20256;&#36755;&#21040;&#24213;&#23618; ISP &#30340;&#26381;&#21153;&#31449;&#20043;&#21518;&#65292;&#30456;&#20851;&#30340;&#35774;&#22791;&#20250;&#23558;&#36825;&#32929;&#21512;&#27969;&#20449;&#21495;&#36827;&#34892;&#25286;&#20998;&#24182;&#20256;&#36755;&#21040;&#20854;&#21508;&#33258;&#30340;&#30446;&#30340;&#22320;</FONT></P>
<H4 id=dsl><FONT style="BACKGROUND-COLOR: #7be1e1">DSL</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">DSL &#32593;&#32476;&#25509;&#20837;&#26381;&#21153;&#19968;&#33324;&#26159;&#30001;&#30005;&#35805;&#20844;&#21496;&#25552;&#20379;&#30340;&#65292;&#22240;&#27492;&#19968;&#33324;&#24773;&#20917;&#19979;&#19968;&#20010;&#29992;&#25143;&#30340;&#30005;&#35805;&#20844;&#21496;&#21516;&#26102;&#20063;&#26159;&#20854; ISP</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">DSL &#19968;&#33324;&#20165;&#20250;&#34987;&#29992;&#20110;&#30701;&#36317;&#31163;&#36890;&#20449;&#65292;&#21363; CO &#21644;&#29992;&#25143;&#20303;&#23429;&#20043;&#38388;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220303193759687 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220303193759687.png"></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#29992;&#25143;&#20250;&#20351;&#29992;&#33258;&#24049;&#30340; DSL modem &#23558;<U>&#25968;&#23383;&#20449;&#21495;</U>&#65288;<EM>digital data</EM>&#65289;&#36716;&#25442;&#25104;&#19987;&#29992;&#20110;&#20256;&#36755;&#30340;<U>&#39640;&#39057;&#29575;&#21452;&#38899;&#39057;</U>&#65288;<EM>high-frequency tone</EM>&#65289;&#20197;&#20415;&#36890;&#36807;&#30005;&#35805;&#32447;&#20256;&#36882;&#32473;&#20301;&#20110;<STRONG>&#20013;&#24515;&#31449;</STRONG>&#65288;<EM>central office</EM>&#65289;&#30340; DSLAM&#65292;&#34987;&#20256;&#36755;&#36807;&#26469;&#30340;&#27169;&#25311;&#20449;&#21495;&#21448;&#20250;&#34987; DSLAM &#37325;&#26032;&#36716;&#25442;&#25104;&#25968;&#23383;&#20449;&#21495;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">DSL &#20316;&#20026;<U>&#24322;&#27493;&#25509;&#20837;&#32593;&#32476;</U>&#65292;&#19979;&#28216;&#36895;&#29575;&#20250;&#36828;&#22823;&#20110;&#19978;&#28216;&#36895;&#29575;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#30001;&#20110;&#20303;&#23429;&#30005;&#35805;&#32447;&#20250;&#21516;&#26102;&#23558;&#25968;&#25454;&#21644;&#20256;&#32479;&#30340;&#30005;&#35805;&#20449;&#21495;&#37117;&#20256;&#36882;&#32473;&#20013;&#24515;&#31449;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-6" name=ref-footnote-6>6</A></SUP>&#65292;&#22240;&#27492;&#36825;&#31181;&#25509;&#20837;&#26041;&#24335;&#20250;&#20351;&#24471;&#21333;&#20010;&#30340; DSL &#38142;&#25509;&#26174;&#24471;&#34987;&#20998;&#25104;&#19977;&#20221;&#19968;&#26679;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#22312;&#29992;&#25143;&#20391;&#65292;&#19968;&#20010;<STRONG>&#20998;&#31163;&#22120;</STRONG>&#65288;<EM>splitter</EM>&#65289;&#20250;&#23558;&#32463;&#30001; DSL &#21040;&#36798;&#30340;&#20449;&#21495;&#20998;&#25104;&#25968;&#25454;&#20449;&#21495;&#21644;&#30005;&#35805;&#20449;&#21495;&#65292;&#20063;&#20250;&#23558;&#36825;&#20004;&#32773;&#36890;&#36807; DSL modem &#21512;&#20108;&#20026;&#19968;&#65292;&#21457;&#36865;&#21040; CO &#20013;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#22312; ISP&#65288;&#30005;&#35805;&#20844;&#21496;&#65289;&#20391;&#30340; CO &#20013;&#65292;<STRONG>DSLAM</STRONG>&#65288;DSL &#25509;&#20837;&#22797;&#29992;&#22120;&#65289;&#20250;&#23558;&#20256;&#36755;&#33258; DSL &#30340;&#20449;&#21495;&#37325;&#26032;&#20998;&#25104;&#25968;&#25454;&#20449;&#21495;&#21644;&#30005;&#35805;&#20449;&#21495;&#65292;&#24182;&#23558;&#20854;&#20256;&#36755;&#21040;&#30456;&#24212;&#30340;&#22788;&#29702;&#22120;&#20013;&#65307;</FONT></LI></UL>
<H4 id=cable><FONT style="BACKGROUND-COLOR: #7be1e1">Cable</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#19981;&#21516;&#20110; DSL&#65292;<STRONG>&#26377;&#32447;&#20114;&#32852;&#32593;&#25509;&#20837;</STRONG>&#65288;<EM>cable Internet access</EM>&#65289;&#30340;&#32593;&#32476;&#36890;&#20449;&#35774;&#26045;&#24182;&#38750;&#30001;&#30005;&#35805;&#20844;&#21496;&#25552;&#20379;&#65292;&#23427;&#20250;&#20351;&#29992;&#26377;&#32447;&#30005;&#35270;&#30340;&#22522;&#30784;&#35774;&#22791;&#26469;&#23454;&#29616;&#32593;&#32476;&#36890;&#20449;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#23545;&#24212;&#30340;&#65292;&#26377;&#32447;&#20114;&#32852;&#32593;&#20013;&#30340; &#8220;DSL modem&#8221; &#34987;&#31216;&#20026; &#8220;Cable modem&#8221;&#65307;CO &#21017;&#34987;&#31216;&#20026; Cable head end&#65307;DSLAM &#21017;&#34987;&#31216;&#20026; CTMS&#65288;<EM>cable modem termination system</EM>&#65289;&#65307;&#32780;&#36825;&#25972;&#20010;&#31995;&#32479;&#24456;&#22810;&#26102;&#20505;&#30001;&#20110;&#20854;&#29289;&#29702;&#29305;&#24615;&#65292;&#34987;&#31216;&#20026; HFC&#65288;<EM>hybrid fiber coax</EM>&#65289;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-7" name=ref-footnote-7>7</A></SUP>&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220303194229812 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220303194229812.png"></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#31867;&#20284;&#20110; DSL &#30340;&#24322;&#27493;&#29305;&#24615;&#65292;Cable modem &#20250;&#23558; HFC &#32593;&#32476;&#20998;&#25104;&#20004;&#20010;&#39057;&#36947;&#65306;&#19979;&#28216;&#21644;&#19978;&#28216;&#65292;&#19979;&#28216;&#39057;&#36947;&#24448;&#24448;&#27604;&#19978;&#28216;&#39057;&#36947;&#30340;&#20256;&#36755;&#36895;&#29575;&#26356;&#39640;&#65306;</FONT></P>
<OL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#26356;&#24555;&#30340;<STRONG>&#19979;&#28216;</STRONG>&#65288;<EM>downstream</EM>&#65289;&#39057;&#36947;&#23558;&#20250;&#34987;&#20998;&#20316;&#19979;&#36733;&#20043;&#29992;&#65292;&#20174;&#26377;&#32447;&#30005;&#35270;&#21069;&#31471;&#21521;&#29992;&#25143;&#20256;&#36882;&#25968;&#25454;&#20250;&#20351;&#29992;&#19979;&#28216;&#39057;&#36947;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#30456;&#23545;&#36739;&#24930;&#30340;<STRONG>&#19978;&#28216;</STRONG>&#65288;<EM>upstream</EM>&#65289;&#39057;&#36947;&#23558;&#20250;&#34987;&#20998;&#20316;&#19978;&#20256;&#20043;&#29992;&#65292;&#20174;&#29992;&#25143;&#21457;&#36865;&#25968;&#25454;&#21040;&#26377;&#21521;&#30005;&#35270;&#21069;&#31471;&#20250;&#20351;&#29992;&#19978;&#28216;&#39057;&#36947;&#65307;</FONT></LI></OL>
<P><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#29305;&#24615;</FONT></STRONG></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#26377;&#32447;&#20114;&#32852;&#32593;&#26159;&#19968;&#20010;<STRONG>&#20849;&#20139;&#24191;&#25773;&#23186;&#20307;</STRONG>&#65288;<EM>shared broadcast medium</EM>&#65289;&#65292;&#19968;&#26086;&#26377;&#22810;&#20010;&#29992;&#25143;&#21516;&#26102;&#20174;&#32593;&#32476;&#20013;&#19979;&#36733;&#20160;&#20040;&#19996;&#35199;&#65292;&#27599;&#20010;&#29992;&#25143;&#23454;&#38469;&#19978;&#25509;&#25910;&#21040;&#30340;&#25968;&#25454;&#37327;&#24448;&#24448;&#20250;&#27604;&#26377;&#32447;&#30005;&#35270;&#20844;&#21496;&#23459;&#31216;&#30340;&#35201;&#23569;&#65288;&#27605;&#31455;&#34987;&#20854;&#23427;&#20154;&#20998;&#36208;&#20102;&#65289;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#27492;&#22806;&#65292;&#30001;&#20110;&#19978;&#28216;&#39057;&#36947;&#20063;&#26159;&#20849;&#20139;&#30340;&#65292;&#22240;&#27492;&#38656;&#35201;&#19968;&#20010;<U>&#20998;&#24067;&#24335;&#30340;&#22810;&#25509;&#20837;&#21327;&#35758;</U>&#65288;<EM>distributed multiple access protocol</EM>&#65289;&#26469;&#21327;&#35843;&#20256;&#36755;&#21644;&#36991;&#20813;&#25317;&#22622;&#65288;<EM>coordinate transmissions and avoid collisions</EM>&#65289;</FONT></P>
<H4 id=lan-&#21644;&#20197;&#22826;&#32593;><FONT style="BACKGROUND-COLOR: #7be1e1">LAN &#21644;&#20197;&#22826;&#32593;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#19978;&#36793;&#20171;&#32461;&#30340; DSL &#21644;&#26377;&#32447;&#20114;&#32852;&#32593;&#30340;&#36866;&#29992;&#22330;&#26223;&#19968;&#33324;&#26159;&#23478;&#24237;&#65292;&#20351;&#29992;&#21516;&#19968;&#32593;&#32476;&#30340;&#29992;&#25143;&#24448;&#24448;&#19981;&#22810;&#12290;&#29616;&#22312;&#23558;&#35201;&#20171;&#32461;&#30340;&#26159;&#38754;&#21521;&#22810;&#29992;&#25143;&#25509;&#20837;&#21516;&#19968;&#32593;&#32476;&#30340;&#22330;&#26223;&#65288;&#23398;&#26657;&#12289;&#20225;&#19994;&#12289;&#39184;&#21381;&#31561;&#65289;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#26222;&#36890;&#32456;&#31471;&#29992;&#25143;&#25509;&#20837;&#20197;&#22826;&#32593;&#20132;&#25442;&#26426;&#65288;<EM>Ethernet switch</EM>&#65289;&#30340;&#36895;&#29575;&#20174; 10 Mbps &#21040; 1 Gbps&#65292;&#32780;&#26381;&#21153;&#22120;&#25509;&#20837;&#30340;&#36895;&#29575;&#20174; 1 Gbps &#21040; 10 Gbps &#19981;&#31561;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220307090522521 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220307090522521.png"></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#32467;&#21512;&#20102; WIFI &#25216;&#26415;&#30340; LAN &#21644;&#20197;&#22826;&#32593;&#26159;&#36825;&#31181;&#24212;&#29992;&#22330;&#26223;&#19979;&#30340;&#26368;&#20339;&#36873;&#25321;&#65292;&#20197;&#22826;&#32593;&#20250;&#36890;&#36807;&#21452;&#32478;&#38108;&#32447;&#38142;&#25509;&#21040;&#20197;&#22826;&#32593;&#20132;&#25442;&#26426;&#20013;&#65292;&#20063;&#21487;&#20197;&#20351;&#29992;&#30005;&#30913;&#27874;&#23454;&#29616;</FONT></P>
<H4 id=&#23567;&#32467;><FONT style="BACKGROUND-COLOR: #7be1e1">&#23567;&#32467;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#29616;&#20195;&#23478;&#24237;&#36890;&#24120;&#20250;&#36873;&#25321;&#23558; WiFi &#25216;&#26415;&#21644;&#20043;&#21069;&#25552;&#21040;&#30340;&#21508;&#31181;&#20303;&#23429;&#23485;&#24102;&#25509;&#20837;&#26381;&#21153;&#32467;&#21512;&#36215;&#26469;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220303195116171 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220303195116171.png"></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#21040;&#24213;&#20174;&#36825;&#24352;&#22270;&#37324;&#36793;&#25165;&#30475;&#20986;&#28857;&#30473;&#30446;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><STRONG>&#22522;&#31449;</STRONG>&#65288;<EM>base station</EM>&#65289;&#26159;&#23454;&#38469;&#21644;&#20303;&#23429;&#20013;&#21508;&#31181;&#26080;&#32447;&#35774;&#22791;&#20132;&#27969;&#30340;&#35774;&#22791;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><STRONG>&#29483;</STRONG>&#65288;<EM>modem</EM>&#65289;&#26159;&#25552;&#20379;&#23485;&#24102;&#25509;&#20837;&#26381;&#21153;&#30340;&#35774;&#22791;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><STRONG>&#36335;&#30001;&#22120;</STRONG>&#65288;<EM>router</EM>&#65289;&#26159;&#23558;&#22522;&#31449;&#21644;&#20854;&#23427;&#21508;&#31181;&#35774;&#22791;&#19982;&#29483;&#36830;&#25509;&#36215;&#26469;&#30340;&#35774;&#22791;&#65307;</FONT></LI></UL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#22522;&#20110;&#20197;&#19978;&#19977;&#28857;&#65292;&#25105;&#20204;&#22522;&#26412;&#19978;&#21487;&#20197;&#35828;&#65292;&#25509;&#20837;&#32593;&#24212;&#35813;&#19981;&#20165;&#38480;&#20110;&#23478;&#20013;&#30340;&#32593;&#32476;&#65292;&#26356;&#30830;&#20999;&#30340;&#35762;&#65292;&#24212;&#24403;&#26159;&#23558;&#23478;&#20013;&#35774;&#22791;&#24418;&#25104;&#30340;&#32456;&#31471;&#31995;&#32479;&#21644;&#26377;&#21521;&#21069;&#31471;&#30456;&#36830;</FONT></P>
<H3 id=&#29289;&#29702;&#23186;&#20171;><FONT style="BACKGROUND-COLOR: #7be1e1">&#29289;&#29702;&#23186;&#20171;</FONT></H3>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><STRONG>&#29289;&#29702;&#23186;&#20171;</STRONG>&#65288;<EM>physical media</EM>&#65289;&#34987;&#20998;&#20026;&#20004;&#31181;&#65306;<STRONG>&#23548;&#21521;&#24615;&#23186;&#20171;</STRONG>&#65288;<EM>guided media</EM>&#65289;&#21644;<STRONG>&#38750;&#23548;&#21521;&#24615;&#23186;&#20171;</STRONG>&#65288;<EM>unguided media</EM>&#65289;&#65292;&#26080;&#35770;&#26159;&#21738;&#31181;&#23186;&#20171;&#65292;&#26412;&#36136;&#19978;&#37117;&#26159;&#36890;&#36807;<STRONG>&#30005;&#30913;&#27874;</STRONG>&#20256;&#36882;&#25968;&#25454;&#30340;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#23548;&#21521;&#24615;&#23186;&#20171;</U>&#25351;&#30340;&#26159;&#30005;&#30913;&#27874;&#20250;&#38543;&#30528;&#22266;&#20307;&#20171;&#36136;&#65288;&#20809;&#32420;&#12289;&#21452;&#32478;&#32447;&#12289;&#21516;&#36724;&#30005;&#32518;&#65289;&#36827;&#34892;&#20256;&#36882;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#38750;&#23548;&#21521;&#24615;&#23186;&#20171;</U>&#25351;&#30340;&#26159;&#30005;&#30913;&#27874;&#20250;&#38543;&#30528;&#38750;&#22266;&#20307;&#20171;&#36136;&#65288;&#22823;&#27668;&#65289;&#36827;&#34892;&#20256;&#25773;&#65288;&#20197;&#26080;&#38480; LAN &#25110;&#32773;&#25968;&#23383;&#21355;&#26143;&#39057;&#36947;&#65289;&#65307;</FONT></LI></UL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#21355;&#26143;&#20449;&#21495;&#20063;&#31639;&#26159;&#29289;&#29702;&#23186;&#20171;</FONT></P>
<H4 id=&#21452;&#32478;&#38108;&#32447;><FONT style="BACKGROUND-COLOR: #7be1e1">&#21452;&#32478;&#38108;&#32447;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#21452;&#32478;&#38108;&#32447;</U>&#65288;<EM>Twisted-Pair Copper Wire</EM>&#65289;&#26159;&#24212;&#29992;&#26368;&#24191;&#27867;&#20063;&#26159;&#26368;&#20415;&#23452;&#30340;&#23548;&#21521;&#24615;&#23186;&#20171;&#65292;&#19968;&#26465;&#21452;&#32478;&#32447;&#20013;&#24448;&#24448;&#26377;<U>&#22810;&#23545;&#32447;</U>&#65292;&#27599;&#19968;&#23545;&#32447;&#20195;&#34920;&#30528;&#19968;&#26465;&#36890;&#20449;&#38142;&#36335;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220306193217613 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220306193217613.png"></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#38750;&#23631;&#34109;&#21452;&#32478;&#32447;</U>&#65288;<EM>Unshielded twisted pair</EM>&#65292;UTP&#65289;&#36890;&#24120;&#34987;&#29992;&#20110;&#24314;&#31569;&#29289;&#20869;&#37096;&#30340;&#35745;&#31639;&#26426;&#32593;&#32476;&#65292;&#20363;&#22914; LAN</FONT></P>
<H4 id=&#21516;&#36724;&#30005;&#32518;><FONT style="BACKGROUND-COLOR: #7be1e1">&#21516;&#36724;&#30005;&#32518;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#21516;&#36724;&#30005;&#32518;</U>&#65288;<EM>Coaxial Cable</EM>&#65289;&#32463;&#24120;&#34987;&#29992;&#20110;&#26377;&#32447;&#30005;&#35270;&#31995;&#32479;&#20013;&#65292;&#20063;&#32463;&#24120;&#34987;&#29992;&#22312;&#23548;&#21521;&#24615;<STRONG>&#20849;&#20139;&#23186;&#20307;</STRONG>&#65288;<EM>shared medium</EM>&#65289;&#20013;&#12290;&#35753;&#32456;&#31471;&#31995;&#32479;&#30452;&#25509;&#21644;&#35813;&#21516;&#36724;&#30005;&#32518;&#30456;&#36830;&#23601;&#33021;&#25509;&#21463;&#21040;&#32463;&#30001;&#35813;&#30005;&#32518;&#21457;&#20986;&#30340;&#25152;&#26377;&#25968;&#25454;</FONT></P>
<H4 id=&#20809;&#32420;><FONT style="BACKGROUND-COLOR: #7be1e1">&#20809;&#32420;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#20809;&#32420;</U>&#65288;<EM>optical fiber</EM>&#65289;&#26159;&#33021;&#20256;&#36755;&#20809;&#33033;&#20914;&#30340;&#20171;&#36136;&#65292;&#27599;&#27425;&#33033;&#20914;&#20195;&#34920;&#19968;&#20010; bit</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#20809;&#32420;&#30340;&#19977;&#20010;&#20248;&#21183;&#65306;</FONT></P>
<OL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#20813;&#30123;&#30005;&#30913;&#24178;&#25200;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#20302;&#20449;&#21495;&#34928;&#20943;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#38590;&#20197;&#31363;&#21548;&#65307;</FONT></LI></OL>
<H2 id=&#32593;&#32476;&#26680;&#24515;><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#26680;&#24515;</FONT></H2>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><U><STRONG>&#32593;&#32476;&#26680;&#24515;</STRONG></U>&#65288;<EM>Internet core</EM>&#65289;&#33021;&#23558;&#32456;&#31471;&#31995;&#32479;&#36830;&#25509;&#36215;&#26469;&#65292;&#32780;&#32593;&#32476;&#36793;&#32536;&#25351;&#20195;&#30340;&#26159;&#21508;&#20010;&#32456;&#31471;&#31995;&#32479;&#65288;&#36793;&#32536;&#36335;&#30001;&#22120;&#65289;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#26412;&#23567;&#32467;&#30340;&#37325;&#28857;&#22312;&#20110;&#29702;&#35299;&#20004;&#31181;&#32593;&#32476;&#20132;&#25442;&#27169;&#24335;&#65306;</FONT></P>
<UL>
<LI>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#20998;&#32452;&#20132;&#25442;</U>&#65288;<EM>packet switch</EM>&#65289;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#20197;&#25968;&#25454;&#21253;&#20026;&#20256;&#36755;&#21333;&#20301;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#21508;&#32593;&#32476;&#32452;&#20214;&#25353;&#38656;&#20351;&#29992;&#32593;&#32476;&#36164;&#28304;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#26080;&#36830;&#25509;&#26381;&#21153;&#65292;&#24615;&#33021;&#19981;&#21463;&#20445;&#35777;&#65307;</FONT></LI></UL>
<LI>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#30005;&#36335;&#20132;&#25442;</U>&#65288;<EM>Circuit Switching</EM>&#65289;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#20351;&#29992;&#20004;&#31181;&#29305;&#21035;&#30340;&#25216;&#26415;&#23454;&#29616;&#21333;&#38142;&#36335;&#22810;&#36830;&#25509;&#65288;FDM&#12289;TDM&#65289;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#20250;&#20026;&#25351;&#23450;&#25968;&#37327;&#30340;&#38142;&#25509;&#39044;&#30041;&#32593;&#32476;&#36164;&#28304;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#38754;&#21521;&#36830;&#25509;&#30340;&#26381;&#21153;&#65292;&#25317;&#26377;&#21463;&#20445;&#35777;&#30340;&#24615;&#33021;&#65307;</FONT></LI></UL></LI></UL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#22312;&#27492;&#20043;&#21069;&#65292;&#20808;&#23450;&#20041;&#19968;&#19979;<STRONG>&#36830;&#25509;</STRONG>&#65288;<EM>connection</EM>&#65289;&#65306;&#36830;&#25509;&#25351;&#30340;&#26159;&#32456;&#31471;&#35774;&#22791;&#22312;&#21457;&#36865;&#20219;&#20309;&#25968;&#25454;&#20043;&#21069;&#65292;&#20808;&#20351;&#29992;&#21327;&#35758;&#24314;&#31435;&#19968;&#26465;&#31471;&#21040;&#31471;&#30340;&#36923;&#36753;&#25110;&#32773;&#29289;&#29702;&#36830;&#25509;&#12290;<STRONG>&#38754;&#21521;&#36830;&#25509;&#30340;&#21327;&#35758;</STRONG>&#65288;<EM>connection-oriented connection</EM>&#65289;&#20855;&#26377;&#20197;&#19979;&#26381;&#21153;&#24418;&#24335;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#25569;&#25163;&#65288;<EM>handshake</EM>&#65289;&#65306;&#21327;&#35843;&#20004;&#20010;&#24453;&#36830;&#25509;&#20027;&#26426;&#30340;&#21442;&#25968;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#25968;&#25454;&#20256;&#36755;&#65288;<EM>data transfer</EM>&#65289;&#65306;</FONT><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#&#20256;&#36755;&#23618;"><FONT style="BACKGROUND-COLOR: #7be1e1">TCP &#21327;&#35758;</FONT></A><FONT style="BACKGROUND-COLOR: #7be1e1">&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#36830;&#25509;&#32456;&#27490;&#65288;<EM>connection termination</EM>&#65289;&#65307;</FONT></LI></UL>
<H3 id=&#20998;&#32452;&#20132;&#25442;><FONT style="BACKGROUND-COLOR: #7be1e1">&#20998;&#32452;&#20132;&#25442;</FONT></H3>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><U><STRONG>&#28040;&#24687;</STRONG></U>&#65288;<EM>message</EM>&#65289;&#23454;&#38469;&#19978;&#25351;&#30340;&#26159;&#28304;&#32456;&#31471;&#31995;&#32479;&#21457;&#36865;&#32473;&#30446;&#26631;&#32456;&#31471;&#31995;&#32479;&#30340;&#25968;&#25454;&#65292;&#28040;&#24687;&#21363;&#21487;&#20197;&#29992;&#20110;&#23454;&#29616;&#25511;&#21046;&#30456;&#20851;&#30340;&#21151;&#33021;&#65292;&#20063;&#21487;&#20197;&#20165;&#29992;&#20110;&#25658;&#24102;&#25968;&#25454;&#12290;&#20026;&#20102;&#33021;&#23558;&#28040;&#24687;&#21457;&#36865;&#36755;&#20986;&#65292;&#28304;&#32456;&#31471;&#31995;&#32479;&#38656;&#35201;&#23558;&#28040;&#24687;&#20998;&#25104;&#19968;&#20010;&#20010;&#21253;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-8" name=ref-footnote-8>8</A></SUP></FONT></P>
<UL>
<LI>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><U><STRONG>&#26080;&#36830;&#25509;&#30340;&#20998;&#32452;&#20132;&#25442;</STRONG></U>&#65288;<EM>Connectionless packet switching</EM>&#65289;&#20063;&#34987;&#31216;&#20026;<U><STRONG>&#25968;&#25454;&#25253;&#20132;&#25442;</STRONG></U>&#65288;<EM>datagram switching</EM>&#65289;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#25968;&#25454;&#21253;&#20013;&#21547;&#26377;&#30446;&#30340;&#22320;&#22336;&#12289;&#28304;&#22320;&#22336;&#12289;&#31471;&#21475;&#21495;&#31561;&#20449;&#24687;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#23613;&#31649;&#19978;&#36848;&#20449;&#24687;&#20813;&#38500;&#20102;&#39044;&#20808;&#24314;&#31435;&#38142;&#25509;&#30340;&#38656;&#35201;&#65292;&#20294;&#26159;&#36825;&#24847;&#21619;&#30528;&#27599;&#20010;&#21253;&#38656;&#35201;&#25658;&#24102;&#26356;&#22810;&#25968;&#25454;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#21160;&#24577;&#20915;&#23450;&#36335;&#30001;&#65292;&#22240;&#27492;&#19981;&#21516;&#25968;&#25454;&#21253;&#23613;&#31649;&#36215;&#22987;&#22320;&#22336;&#30456;&#21516;&#65292;&#24448;&#24448;&#20063;&#20250;&#36873;&#25321;&#19981;&#21516;&#30340;&#36335;&#30001;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#20081;&#24207;&#21040;&#36798;&#30340;&#25968;&#25454;&#21253;&#21487;&#33021;&#20250;&#22312;&#30446;&#30340;&#33410;&#28857;&#34987;&#37325;&#26032;&#32452;&#35013;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#20197;&#22826;&#32593;&#12289;IP &#21327;&#35758;&#12289;UDP &#21327;&#35758;&#37117;&#26159;&#26080;&#36830;&#25509;&#30340;&#26381;&#21153;&#65307;</FONT></LI></UL>
<LI>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><STRONG><U>&#38754;&#21521;&#36830;&#25509;&#30340;&#20998;&#32452;&#20132;&#25442;</U></STRONG>&#65288;<EM>Connection-oriented packet switching</EM>&#65289;&#20063;&#34987;&#31216;&#20026;<U><STRONG>&#34394;&#25311;&#30005;&#36335;&#32593;&#32476;</STRONG></U>&#65288;<EM>virtual circuit network</EM>&#65289;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#22312;&#27491;&#24335;&#20256;&#36755;&#20219;&#20309;&#25968;&#25454;&#20043;&#21069;&#37117;&#38656;&#35201;&#24314;&#31435;&#36890;&#20449;&#25152;&#38656;&#35201;&#30340;&#21442;&#25968;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#20165;&#26377;&#22312;&#36830;&#25509;&#24314;&#31435;&#38454;&#27573;&#38656;&#35201;&#20351;&#29992;&#26080;&#36830;&#25509;&#26381;&#21153;&#65288;&#22320;&#22336;&#20449;&#24687;&#65289;&#21457;&#29616;&#36335;&#30001;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#27491;&#24335;&#20132;&#25442;&#25968;&#25454;&#38454;&#27573;&#26080;&#38656;&#22320;&#22336;&#20449;&#24687;&#65292;&#21462;&#32780;&#20195;&#20043;&#30340;&#26159;&#38142;&#25509;&#22768;&#26126;&#31526;&#65288;&#22240;&#27492;&#25968;&#25454;&#21253;&#20250;&#26356;&#23567;&#65289;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">X.25&#12289;TCP&#12289;ATM &#37117;&#26159;&#38754;&#21521;&#36830;&#25509;&#30340;&#26381;&#21153;&#65307;</FONT></LI></UL></LI></UL>
<H4 id=&#20256;&#36755;&#26041;&#24335;><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#20256;&#36755;&#26041;&#24335;</FONT></STRONG></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><STRONG>&#23384;&#20648;-&#36716;&#21457;&#24335;&#20256;&#36755;</STRONG>&#65288;<EM>store-and-forward transmission</EM>&#65289;&#26159;&#22823;&#22810;&#25968;&#21253;&#20132;&#25442;&#26426;&#37319;&#29992;&#30340;&#23454;&#29616;&#26041;&#24335;&#12290;<U>&#30452;&#21040;&#25972;&#20010;&#21253;&#21040;&#36798;&#21253;&#20132;&#25442;&#26426;&#20043;&#21069;</U>&#65292;&#36825;&#20010;&#21253;&#37117;&#19981;&#20250;&#34987;&#21253;&#20132;&#25442;&#26426;&#32487;&#32493;&#36716;&#21457;&#21040;&#19979;&#19968;&#20010;&#21253;&#20132;&#25442;&#26426;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220303202132913 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220303202132913.png"></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#36825;&#31181;&#20256;&#36755;&#26041;&#24335;&#21463;&#20256;&#36755;&#36895;&#29575;&#30340;&#24433;&#21709;&#29305;&#21035;&#22823;&#65292;&#20854;&#21407;&#22240;&#22312;&#20110;&#24517;&#39035;&#23558;&#25972;&#20010;&#23436;&#25972;&#30340;&#21253;&#20256;&#36882;&#21040;&#19979;&#19968;&#20010;&#21253;&#20132;&#25442;&#26426;&#20043;&#21518;&#65292;&#36825;&#20010;&#21253;&#25165;&#33021;&#34987;&#32487;&#32493;&#20256;&#36882;&#19979;&#21435;&#65292;&#32780;&#36335;&#30001;&#19978;&#30340;&#20256;&#25773;&#24310;&#36831;&#24448;&#24448;&#35201;&#23567;&#20110;&#20256;&#36755;&#24310;&#36831;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#19968;&#33324;&#24773;&#20917;&#19979;&#65292;&#22914;&#26524;&#24819;&#35201;&#23558;<SPAN>&nbsp;</SPAN><MJX-CONTAINER class=MathJax jax="SVG"><?XML:NAMESPACE PREFIX = "[default] http://www.w3.org/2000/svg" NS = "http://www.w3.org/2000/svg" /><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="1.699ex" height="1.545ex" focusable="false" viewBox="0 -683 751 683" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-24-TEX-I-1D443 d="M287 628Q287 635 230 637Q206 637 199 638T192 648Q192 649 194 659Q200 679 203 681T397 683Q587 682 600 680Q664 669 707 631T751 530Q751 453 685 389Q616 321 507 303Q500 302 402 301H307L277 182Q247 66 247 59Q247 55 248 54T255 50T272 48T305 46H336Q342 37 342 35Q342 19 335 5Q330 0 319 0Q316 0 282 1T182 2Q120 2 87 2T51 1Q33 1 33 11Q33 13 36 25Q40 41 44 43T67 46Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628ZM645 554Q645 567 643 575T634 597T609 619T560 635Q553 636 480 637Q463 637 445 637T416 636T404 636Q391 635 386 627Q384 621 367 550T332 412T314 344Q314 342 395 342H407H430Q542 342 590 392Q617 419 631 471T645 554Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D443" xlink:href="#MJX-24-TEX-I-1D443"><path id=MJX-24-TEX-I-1D443 d="M287 628Q287 635 230 637Q206 637 199 638T192 648Q192 649 194 659Q200 679 203 681T397 683Q587 682 600 680Q664 669 707 631T751 530Q751 453 685 389Q616 321 507 303Q500 302 402 301H307L277 182Q247 66 247 59Q247 55 248 54T255 50T272 48T305 46H336Q342 37 342 35Q342 19 335 5Q330 0 319 0Q316 0 282 1T182 2Q120 2 87 2T51 1Q33 1 33 11Q33 13 36 25Q40 41 44 43T67 46Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628ZM645 554Q645 567 643 575T634 597T609 619T560 635Q553 636 480 637Q463 637 445 637T416 636T404 636Q391 635 386 627Q384 621 367 550T332 412T314 344Q314 342 395 342H407H430Q542 342 590 392Q617 419 631 471T645 554Z"></path></use></g></g></g></svg></MJX-CONTAINER><SPAN>&nbsp;</SPAN>&#20010;&#38271;&#24230;&#20026;<SPAN>&nbsp;</SPAN><MJX-CONTAINER class=MathJax jax="SVG"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="1.541ex" height="1.545ex" focusable="false" viewBox="0 -683 681 683" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-43-TEX-I-1D43F d="M228 637Q194 637 192 641Q191 643 191 649Q191 673 202 682Q204 683 217 683Q271 680 344 680Q485 680 506 683H518Q524 677 524 674T522 656Q517 641 513 637H475Q406 636 394 628Q387 624 380 600T313 336Q297 271 279 198T252 88L243 52Q243 48 252 48T311 46H328Q360 46 379 47T428 54T478 72T522 106T564 161Q580 191 594 228T611 270Q616 273 628 273H641Q647 264 647 262T627 203T583 83T557 9Q555 4 553 3T537 0T494 -1Q483 -1 418 -1T294 0H116Q32 0 32 10Q32 17 34 24Q39 43 44 45Q48 46 59 46H65Q92 46 125 49Q139 52 144 61Q147 65 216 339T285 628Q285 635 228 637Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D43F" xlink:href="#MJX-43-TEX-I-1D43F"><path id=MJX-43-TEX-I-1D43F d="M228 637Q194 637 192 641Q191 643 191 649Q191 673 202 682Q204 683 217 683Q271 680 344 680Q485 680 506 683H518Q524 677 524 674T522 656Q517 641 513 637H475Q406 636 394 628Q387 624 380 600T313 336Q297 271 279 198T252 88L243 52Q243 48 252 48T311 46H328Q360 46 379 47T428 54T478 72T522 106T564 161Q580 191 594 228T611 270Q616 273 628 273H641Q647 264 647 262T627 203T583 83T557 9Q555 4 553 3T537 0T494 -1Q483 -1 418 -1T294 0H116Q32 0 32 10Q32 17 34 24Q39 43 44 45Q48 46 59 46H65Q92 46 125 49Q139 52 144 61Q147 65 216 339T285 628Q285 635 228 637Z"></path></use></g></g></g></svg></MJX-CONTAINER><SPAN>&nbsp;</SPAN>&#30340;&#21253;&#27839;&#30528;&#38271;&#24230;&#20026;<SPAN>&nbsp;</SPAN><MJX-CONTAINER class=MathJax jax="SVG"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="2.009ex" height="1.545ex" focusable="false" viewBox="0 -683 888 683" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-30-TEX-I-1D441 d="M234 637Q231 637 226 637Q201 637 196 638T191 649Q191 676 202 682Q204 683 299 683Q376 683 387 683T401 677Q612 181 616 168L670 381Q723 592 723 606Q723 633 659 637Q635 637 635 648Q635 650 637 660Q641 676 643 679T653 683Q656 683 684 682T767 680Q817 680 843 681T873 682Q888 682 888 672Q888 650 880 642Q878 637 858 637Q787 633 769 597L620 7Q618 0 599 0Q585 0 582 2Q579 5 453 305L326 604L261 344Q196 88 196 79Q201 46 268 46H278Q284 41 284 38T282 19Q278 6 272 0H259Q228 2 151 2Q123 2 100 2T63 2T46 1Q31 1 31 10Q31 14 34 26T39 40Q41 46 62 46Q130 49 150 85Q154 91 221 362L289 634Q287 635 234 637Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D441" xlink:href="#MJX-30-TEX-I-1D441"><path id=MJX-30-TEX-I-1D441 d="M234 637Q231 637 226 637Q201 637 196 638T191 649Q191 676 202 682Q204 683 299 683Q376 683 387 683T401 677Q612 181 616 168L670 381Q723 592 723 606Q723 633 659 637Q635 637 635 648Q635 650 637 660Q641 676 643 679T653 683Q656 683 684 682T767 680Q817 680 843 681T873 682Q888 682 888 672Q888 650 880 642Q878 637 858 637Q787 633 769 597L620 7Q618 0 599 0Q585 0 582 2Q579 5 453 305L326 604L261 344Q196 88 196 79Q201 46 268 46H278Q284 41 284 38T282 19Q278 6 272 0H259Q228 2 151 2Q123 2 100 2T63 2T46 1Q31 1 31 10Q31 14 34 26T39 40Q41 46 62 46Q130 49 150 85Q154 91 221 362L289 634Q287 635 234 637Z"></path></use></g></g></g></svg></MJX-CONTAINER><SPAN>&nbsp;</SPAN>&#30340;&#38142;&#36335;&#20256;&#36755;&#30340;&#35805;&#65288;&#36335;&#30001;&#22120;&#20256;&#36755;&#36895;&#24230;&#20026;<SPAN>&nbsp;</SPAN><MJX-CONTAINER class=MathJax jax="SVG"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="1.717ex" height="1.593ex" focusable="false" viewBox="0 -683 759 704" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-44-TEX-I-1D445 d="M230 637Q203 637 198 638T193 649Q193 676 204 682Q206 683 378 683Q550 682 564 680Q620 672 658 652T712 606T733 563T739 529Q739 484 710 445T643 385T576 351T538 338L545 333Q612 295 612 223Q612 212 607 162T602 80V71Q602 53 603 43T614 25T640 16Q668 16 686 38T712 85Q717 99 720 102T735 105Q755 105 755 93Q755 75 731 36Q693 -21 641 -21H632Q571 -21 531 4T487 82Q487 109 502 166T517 239Q517 290 474 313Q459 320 449 321T378 323H309L277 193Q244 61 244 59Q244 55 245 54T252 50T269 48T302 46H333Q339 38 339 37T336 19Q332 6 326 0H311Q275 2 180 2Q146 2 117 2T71 2T50 1Q33 1 33 10Q33 12 36 24Q41 43 46 45Q50 46 61 46H67Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628Q287 635 230 637ZM630 554Q630 586 609 608T523 636Q521 636 500 636T462 637H440Q393 637 386 627Q385 624 352 494T319 361Q319 360 388 360Q466 361 492 367Q556 377 592 426Q608 449 619 486T630 554Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D445" xlink:href="#MJX-44-TEX-I-1D445"><path id=MJX-44-TEX-I-1D445 d="M230 637Q203 637 198 638T193 649Q193 676 204 682Q206 683 378 683Q550 682 564 680Q620 672 658 652T712 606T733 563T739 529Q739 484 710 445T643 385T576 351T538 338L545 333Q612 295 612 223Q612 212 607 162T602 80V71Q602 53 603 43T614 25T640 16Q668 16 686 38T712 85Q717 99 720 102T735 105Q755 105 755 93Q755 75 731 36Q693 -21 641 -21H632Q571 -21 531 4T487 82Q487 109 502 166T517 239Q517 290 474 313Q459 320 449 321T378 323H309L277 193Q244 61 244 59Q244 55 245 54T252 50T269 48T302 46H333Q339 38 339 37T336 19Q332 6 326 0H311Q275 2 180 2Q146 2 117 2T71 2T50 1Q33 1 33 10Q33 12 36 24Q41 43 46 45Q50 46 61 46H67Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628Q287 635 230 637ZM630 554Q630 586 609 608T523 636Q521 636 500 636T462 637H440Q393 637 386 627Q385 624 352 494T319 361Q319 360 388 360Q466 361 492 367Q556 377 592 426Q608 449 619 486T630 554Z"></path></use></g></g></g></svg></MJX-CONTAINER>&#65289;&#65292;&#20165;&#32771;&#34385;&#20256;&#36755;&#24310;&#36831;&#30340;&#24773;&#20917;&#19979;&#65292;&#38656;&#35201;&#28040;&#32791;&#30340;&#26102;&#38388;&#20026;&#65306;</FONT></P>
<DIV spellcheck=false id=mathjax-n220 class="mathjax-block md-end-block md-math-block md-rawblock" contentEditable=false cid="n220" mdtype="math_block" data-math-tag-before="0" data-math-tag-after="0" data-math-labels="[]">
<DIV tabIndex=-1 class="md-rawblock-container md-math-container"><MJX-CONTAINER class=MathJax jax="SVG" display="true"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="21.088ex" height="4.674ex" focusable="false" viewBox="0 -1359 9320.9 2066" xmlns:xlink="http://www.w3.org/1999/xlink"><FONT style="BACKGROUND-COLOR: #7be1e1"><defs><path id=MJX-23-TEX-I-1D447 d="M40 437Q21 437 21 445Q21 450 37 501T71 602L88 651Q93 669 101 677H569H659Q691 677 697 676T704 667Q704 661 687 553T668 444Q668 437 649 437Q640 437 637 437T631 442L629 445Q629 451 635 490T641 551Q641 586 628 604T573 629Q568 630 515 631Q469 631 457 630T439 622Q438 621 368 343T298 60Q298 48 386 46Q418 46 427 45T436 36Q436 31 433 22Q429 4 424 1L422 0Q419 0 415 0Q410 0 363 1T228 2Q99 2 64 0H49Q43 6 43 9T45 27Q49 40 55 46H83H94Q174 46 189 55Q190 56 191 56Q196 59 201 76T241 233Q258 301 269 344Q339 619 339 625Q339 630 310 630H279Q212 630 191 624Q146 614 121 583T67 467Q60 445 57 441T43 437H40Z"></path><path id=MJX-23-TEX-N-3D d="M56 347Q56 360 70 367H707Q722 359 722 347Q722 336 708 328L390 327H72Q56 332 56 347ZM56 153Q56 168 72 173H708Q722 163 722 153Q722 140 707 133H70Q56 140 56 153Z"></path><path id=MJX-23-TEX-N-28 d="M94 250Q94 319 104 381T127 488T164 576T202 643T244 695T277 729T302 750H315H319Q333 750 333 741Q333 738 316 720T275 667T226 581T184 443T167 250T184 58T225 -81T274 -167T316 -220T333 -241Q333 -250 318 -250H315H302L274 -226Q180 -141 137 -14T94 250Z"></path><path id=MJX-23-TEX-I-1D441 d="M234 637Q231 637 226 637Q201 637 196 638T191 649Q191 676 202 682Q204 683 299 683Q376 683 387 683T401 677Q612 181 616 168L670 381Q723 592 723 606Q723 633 659 637Q635 637 635 648Q635 650 637 660Q641 676 643 679T653 683Q656 683 684 682T767 680Q817 680 843 681T873 682Q888 682 888 672Q888 650 880 642Q878 637 858 637Q787 633 769 597L620 7Q618 0 599 0Q585 0 582 2Q579 5 453 305L326 604L261 344Q196 88 196 79Q201 46 268 46H278Q284 41 284 38T282 19Q278 6 272 0H259Q228 2 151 2Q123 2 100 2T63 2T46 1Q31 1 31 10Q31 14 34 26T39 40Q41 46 62 46Q130 49 150 85Q154 91 221 362L289 634Q287 635 234 637Z"></path><path id=MJX-23-TEX-N-2B d="M56 237T56 250T70 270H369V420L370 570Q380 583 389 583Q402 583 409 568V270H707Q722 262 722 250T707 230H409V-68Q401 -82 391 -82H389H387Q375 -82 369 -68V230H70Q56 237 56 250Z"></path><path id=MJX-23-TEX-I-1D443 d="M287 628Q287 635 230 637Q206 637 199 638T192 648Q192 649 194 659Q200 679 203 681T397 683Q587 682 600 680Q664 669 707 631T751 530Q751 453 685 389Q616 321 507 303Q500 302 402 301H307L277 182Q247 66 247 59Q247 55 248 54T255 50T272 48T305 46H336Q342 37 342 35Q342 19 335 5Q330 0 319 0Q316 0 282 1T182 2Q120 2 87 2T51 1Q33 1 33 11Q33 13 36 25Q40 41 44 43T67 46Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628ZM645 554Q645 567 643 575T634 597T609 619T560 635Q553 636 480 637Q463 637 445 637T416 636T404 636Q391 635 386 627Q384 621 367 550T332 412T314 344Q314 342 395 342H407H430Q542 342 590 392Q617 419 631 471T645 554Z"></path><path id=MJX-23-TEX-N-2212 d="M84 237T84 250T98 270H679Q694 262 694 250T679 230H98Q84 237 84 250Z"></path><path id=MJX-23-TEX-N-31 d="M213 578L200 573Q186 568 160 563T102 556H83V602H102Q149 604 189 617T245 641T273 663Q275 666 285 666Q294 666 302 660V361L303 61Q310 54 315 52T339 48T401 46H427V0H416Q395 3 257 3Q121 3 100 0H88V46H114Q136 46 152 46T177 47T193 50T201 52T207 57T213 61V578Z"></path><path id=MJX-23-TEX-N-29 d="M60 749L64 750Q69 750 74 750H86L114 726Q208 641 251 514T294 250Q294 182 284 119T261 12T224 -76T186 -143T145 -194T113 -227T90 -246Q87 -249 86 -250H74Q66 -250 63 -250T58 -247T55 -238Q56 -237 66 -225Q221 -64 221 250T66 725Q56 737 55 738Q55 746 60 749Z"></path><path id=MJX-23-TEX-N-22C5 d="M78 250Q78 274 95 292T138 310Q162 310 180 294T199 251Q199 226 182 208T139 190T96 207T78 250Z"></path><path id=MJX-23-TEX-I-1D43F d="M228 637Q194 637 192 641Q191 643 191 649Q191 673 202 682Q204 683 217 683Q271 680 344 680Q485 680 506 683H518Q524 677 524 674T522 656Q517 641 513 637H475Q406 636 394 628Q387 624 380 600T313 336Q297 271 279 198T252 88L243 52Q243 48 252 48T311 46H328Q360 46 379 47T428 54T478 72T522 106T564 161Q580 191 594 228T611 270Q616 273 628 273H641Q647 264 647 262T627 203T583 83T557 9Q555 4 553 3T537 0T494 -1Q483 -1 418 -1T294 0H116Q32 0 32 10Q32 17 34 24Q39 43 44 45Q48 46 59 46H65Q92 46 125 49Q139 52 144 61Q147 65 216 339T285 628Q285 635 228 637Z"></path><path id=MJX-23-TEX-I-1D445 d="M230 637Q203 637 198 638T193 649Q193 676 204 682Q206 683 378 683Q550 682 564 680Q620 672 658 652T712 606T733 563T739 529Q739 484 710 445T643 385T576 351T538 338L545 333Q612 295 612 223Q612 212 607 162T602 80V71Q602 53 603 43T614 25T640 16Q668 16 686 38T712 85Q717 99 720 102T735 105Q755 105 755 93Q755 75 731 36Q693 -21 641 -21H632Q571 -21 531 4T487 82Q487 109 502 166T517 239Q517 290 474 313Q459 320 449 321T378 323H309L277 193Q244 61 244 59Q244 55 245 54T252 50T269 48T302 46H333Q339 38 339 37T336 19Q332 6 326 0H311Q275 2 180 2Q146 2 117 2T71 2T50 1Q33 1 33 10Q33 12 36 24Q41 43 46 45Q50 46 61 46H67Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628Q287 635 230 637ZM630 554Q630 586 609 608T523 636Q521 636 500 636T462 637H440Q393 637 386 627Q385 624 352 494T319 361Q319 360 388 360Q466 361 492 367Q556 377 592 426Q608 449 619 486T630 554Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D447" xlink:href="#MJX-23-TEX-I-1D447"><path id=MJX-23-TEX-I-1D447 d="M40 437Q21 437 21 445Q21 450 37 501T71 602L88 651Q93 669 101 677H569H659Q691 677 697 676T704 667Q704 661 687 553T668 444Q668 437 649 437Q640 437 637 437T631 442L629 445Q629 451 635 490T641 551Q641 586 628 604T573 629Q568 630 515 631Q469 631 457 630T439 622Q438 621 368 343T298 60Q298 48 386 46Q418 46 427 45T436 36Q436 31 433 22Q429 4 424 1L422 0Q419 0 415 0Q410 0 363 1T228 2Q99 2 64 0H49Q43 6 43 9T45 27Q49 40 55 46H83H94Q174 46 189 55Q190 56 191 56Q196 59 201 76T241 233Q258 301 269 344Q339 619 339 625Q339 630 310 630H279Q212 630 191 624Q146 614 121 583T67 467Q60 445 57 441T43 437H40Z"></path></use></g><g transform="translate(981.8,0)" data-mml-node="mo"><use data-c="3D" xlink:href="#MJX-23-TEX-N-3D"><path id=MJX-23-TEX-N-3D d="M56 347Q56 360 70 367H707Q722 359 722 347Q722 336 708 328L390 327H72Q56 332 56 347ZM56 153Q56 168 72 173H708Q722 163 722 153Q722 140 707 133H70Q56 140 56 153Z"></path></use></g><g transform="translate(2037.6,0)" data-mml-node="mo"><use data-c="28" xlink:href="#MJX-23-TEX-N-28"><path id=MJX-23-TEX-N-28 d="M94 250Q94 319 104 381T127 488T164 576T202 643T244 695T277 729T302 750H315H319Q333 750 333 741Q333 738 316 720T275 667T226 581T184 443T167 250T184 58T225 -81T274 -167T316 -220T333 -241Q333 -250 318 -250H315H302L274 -226Q180 -141 137 -14T94 250Z"></path></use></g><g transform="translate(2426.6,0)" data-mml-node="mi"><use data-c="1D441" xlink:href="#MJX-23-TEX-I-1D441"><path id=MJX-23-TEX-I-1D441 d="M234 637Q231 637 226 637Q201 637 196 638T191 649Q191 676 202 682Q204 683 299 683Q376 683 387 683T401 677Q612 181 616 168L670 381Q723 592 723 606Q723 633 659 637Q635 637 635 648Q635 650 637 660Q641 676 643 679T653 683Q656 683 684 682T767 680Q817 680 843 681T873 682Q888 682 888 672Q888 650 880 642Q878 637 858 637Q787 633 769 597L620 7Q618 0 599 0Q585 0 582 2Q579 5 453 305L326 604L261 344Q196 88 196 79Q201 46 268 46H278Q284 41 284 38T282 19Q278 6 272 0H259Q228 2 151 2Q123 2 100 2T63 2T46 1Q31 1 31 10Q31 14 34 26T39 40Q41 46 62 46Q130 49 150 85Q154 91 221 362L289 634Q287 635 234 637Z"></path></use></g><g transform="translate(3536.8,0)" data-mml-node="mo"><use data-c="2B" xlink:href="#MJX-23-TEX-N-2B"><path id=MJX-23-TEX-N-2B d="M56 237T56 250T70 270H369V420L370 570Q380 583 389 583Q402 583 409 568V270H707Q722 262 722 250T707 230H409V-68Q401 -82 391 -82H389H387Q375 -82 369 -68V230H70Q56 237 56 250Z"></path></use></g><g transform="translate(4537,0)" data-mml-node="mi"><use data-c="1D443" xlink:href="#MJX-23-TEX-I-1D443"><path id=MJX-23-TEX-I-1D443 d="M287 628Q287 635 230 637Q206 637 199 638T192 648Q192 649 194 659Q200 679 203 681T397 683Q587 682 600 680Q664 669 707 631T751 530Q751 453 685 389Q616 321 507 303Q500 302 402 301H307L277 182Q247 66 247 59Q247 55 248 54T255 50T272 48T305 46H336Q342 37 342 35Q342 19 335 5Q330 0 319 0Q316 0 282 1T182 2Q120 2 87 2T51 1Q33 1 33 11Q33 13 36 25Q40 41 44 43T67 46Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628ZM645 554Q645 567 643 575T634 597T609 619T560 635Q553 636 480 637Q463 637 445 637T416 636T404 636Q391 635 386 627Q384 621 367 550T332 412T314 344Q314 342 395 342H407H430Q542 342 590 392Q617 419 631 471T645 554Z"></path></use></g><g transform="translate(5510.2,0)" data-mml-node="mo"><use data-c="2212" xlink:href="#MJX-23-TEX-N-2212"><path id=MJX-23-TEX-N-2212 d="M84 237T84 250T98 270H679Q694 262 694 250T679 230H98Q84 237 84 250Z"></path></use></g><g transform="translate(6510.4,0)" data-mml-node="mn"><use data-c="31" xlink:href="#MJX-23-TEX-N-31"><path id=MJX-23-TEX-N-31 d="M213 578L200 573Q186 568 160 563T102 556H83V602H102Q149 604 189 617T245 641T273 663Q275 666 285 666Q294 666 302 660V361L303 61Q310 54 315 52T339 48T401 46H427V0H416Q395 3 257 3Q121 3 100 0H88V46H114Q136 46 152 46T177 47T193 50T201 52T207 57T213 61V578Z"></path></use></g><g transform="translate(7010.4,0)" data-mml-node="mo"><use data-c="29" xlink:href="#MJX-23-TEX-N-29"><path id=MJX-23-TEX-N-29 d="M60 749L64 750Q69 750 74 750H86L114 726Q208 641 251 514T294 250Q294 182 284 119T261 12T224 -76T186 -143T145 -194T113 -227T90 -246Q87 -249 86 -250H74Q66 -250 63 -250T58 -247T55 -238Q56 -237 66 -225Q221 -64 221 250T66 725Q56 737 55 738Q55 746 60 749Z"></path></use></g><g transform="translate(7621.7,0)" data-mml-node="mo"><use data-c="22C5" xlink:href="#MJX-23-TEX-N-22C5"><path id=MJX-23-TEX-N-22C5 d="M78 250Q78 274 95 292T138 310Q162 310 180 294T199 251Q199 226 182 208T139 190T96 207T78 250Z"></path></use></g><g transform="translate(8121.9,0)" data-mml-node="mfrac"><g transform="translate(259,676)" data-mml-node="mi"><use data-c="1D43F" xlink:href="#MJX-23-TEX-I-1D43F"><path id=MJX-23-TEX-I-1D43F d="M228 637Q194 637 192 641Q191 643 191 649Q191 673 202 682Q204 683 217 683Q271 680 344 680Q485 680 506 683H518Q524 677 524 674T522 656Q517 641 513 637H475Q406 636 394 628Q387 624 380 600T313 336Q297 271 279 198T252 88L243 52Q243 48 252 48T311 46H328Q360 46 379 47T428 54T478 72T522 106T564 161Q580 191 594 228T611 270Q616 273 628 273H641Q647 264 647 262T627 203T583 83T557 9Q555 4 553 3T537 0T494 -1Q483 -1 418 -1T294 0H116Q32 0 32 10Q32 17 34 24Q39 43 44 45Q48 46 59 46H65Q92 46 125 49Q139 52 144 61Q147 65 216 339T285 628Q285 635 228 637Z"></path></use></g><g transform="translate(220,-686)" data-mml-node="mi"><use data-c="1D445" xlink:href="#MJX-23-TEX-I-1D445"><path id=MJX-23-TEX-I-1D445 d="M230 637Q203 637 198 638T193 649Q193 676 204 682Q206 683 378 683Q550 682 564 680Q620 672 658 652T712 606T733 563T739 529Q739 484 710 445T643 385T576 351T538 338L545 333Q612 295 612 223Q612 212 607 162T602 80V71Q602 53 603 43T614 25T640 16Q668 16 686 38T712 85Q717 99 720 102T735 105Q755 105 755 93Q755 75 731 36Q693 -21 641 -21H632Q571 -21 531 4T487 82Q487 109 502 166T517 239Q517 290 474 313Q459 320 449 321T378 323H309L277 193Q244 61 244 59Q244 55 245 54T252 50T269 48T302 46H333Q339 38 339 37T336 19Q332 6 326 0H311Q275 2 180 2Q146 2 117 2T71 2T50 1Q33 1 33 10Q33 12 36 24Q41 43 46 45Q50 46 61 46H67Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628Q287 635 230 637ZM630 554Q630 586 609 608T523 636Q521 636 500 636T462 637H440Q393 637 386 627Q385 624 352 494T319 361Q319 360 388 360Q466 361 492 367Q556 377 592 426Q608 449 619 486T630 554Z"></path></use></g><rect width="959" height="60" x="120" y="220"></rect></g></g></g></FONT></svg></MJX-CONTAINER></DIV></DIV>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#21487;&#20197;&#20174;&#20197;&#19979;&#20960;&#20010;&#26041;&#38754;&#26469;&#29702;&#35299;&#65306;</FONT></P>
<OL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#38142;&#36335;&#38271;&#24230;&#20026;<SPAN>&nbsp;</SPAN><MJX-CONTAINER class=MathJax jax="SVG"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="2.009ex" height="1.545ex" focusable="false" viewBox="0 -683 888 683" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-30-TEX-I-1D441 d="M234 637Q231 637 226 637Q201 637 196 638T191 649Q191 676 202 682Q204 683 299 683Q376 683 387 683T401 677Q612 181 616 168L670 381Q723 592 723 606Q723 633 659 637Q635 637 635 648Q635 650 637 660Q641 676 643 679T653 683Q656 683 684 682T767 680Q817 680 843 681T873 682Q888 682 888 672Q888 650 880 642Q878 637 858 637Q787 633 769 597L620 7Q618 0 599 0Q585 0 582 2Q579 5 453 305L326 604L261 344Q196 88 196 79Q201 46 268 46H278Q284 41 284 38T282 19Q278 6 272 0H259Q228 2 151 2Q123 2 100 2T63 2T46 1Q31 1 31 10Q31 14 34 26T39 40Q41 46 62 46Q130 49 150 85Q154 91 221 362L289 634Q287 635 234 637Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D441" xlink:href="#MJX-30-TEX-I-1D441"><path id=MJX-30-TEX-I-1D441 d="M234 637Q231 637 226 637Q201 637 196 638T191 649Q191 676 202 682Q204 683 299 683Q376 683 387 683T401 677Q612 181 616 168L670 381Q723 592 723 606Q723 633 659 637Q635 637 635 648Q635 650 637 660Q641 676 643 679T653 683Q656 683 684 682T767 680Q817 680 843 681T873 682Q888 682 888 672Q888 650 880 642Q878 637 858 637Q787 633 769 597L620 7Q618 0 599 0Q585 0 582 2Q579 5 453 305L326 604L261 344Q196 88 196 79Q201 46 268 46H278Q284 41 284 38T282 19Q278 6 272 0H259Q228 2 151 2Q123 2 100 2T63 2T46 1Q31 1 31 10Q31 14 34 26T39 40Q41 46 62 46Q130 49 150 85Q154 91 221 362L289 634Q287 635 234 637Z"></path></use></g></g></g></svg></MJX-CONTAINER><SPAN>&nbsp;</SPAN>&#23601;&#20195;&#34920;&#20854;&#20013;&#26377;<SPAN>&nbsp;</SPAN><MJX-CONTAINER class=MathJax jax="SVG"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="5.906ex" height="1.731ex" focusable="false" viewBox="0 -683 2610.4 765" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-29-TEX-I-1D441 d="M234 637Q231 637 226 637Q201 637 196 638T191 649Q191 676 202 682Q204 683 299 683Q376 683 387 683T401 677Q612 181 616 168L670 381Q723 592 723 606Q723 633 659 637Q635 637 635 648Q635 650 637 660Q641 676 643 679T653 683Q656 683 684 682T767 680Q817 680 843 681T873 682Q888 682 888 672Q888 650 880 642Q878 637 858 637Q787 633 769 597L620 7Q618 0 599 0Q585 0 582 2Q579 5 453 305L326 604L261 344Q196 88 196 79Q201 46 268 46H278Q284 41 284 38T282 19Q278 6 272 0H259Q228 2 151 2Q123 2 100 2T63 2T46 1Q31 1 31 10Q31 14 34 26T39 40Q41 46 62 46Q130 49 150 85Q154 91 221 362L289 634Q287 635 234 637Z"></path><path id=MJX-29-TEX-N-2212 d="M84 237T84 250T98 270H679Q694 262 694 250T679 230H98Q84 237 84 250Z"></path><path id=MJX-29-TEX-N-31 d="M213 578L200 573Q186 568 160 563T102 556H83V602H102Q149 604 189 617T245 641T273 663Q275 666 285 666Q294 666 302 660V361L303 61Q310 54 315 52T339 48T401 46H427V0H416Q395 3 257 3Q121 3 100 0H88V46H114Q136 46 152 46T177 47T193 50T201 52T207 57T213 61V578Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D441" xlink:href="#MJX-29-TEX-I-1D441"><path id=MJX-29-TEX-I-1D441 d="M234 637Q231 637 226 637Q201 637 196 638T191 649Q191 676 202 682Q204 683 299 683Q376 683 387 683T401 677Q612 181 616 168L670 381Q723 592 723 606Q723 633 659 637Q635 637 635 648Q635 650 637 660Q641 676 643 679T653 683Q656 683 684 682T767 680Q817 680 843 681T873 682Q888 682 888 672Q888 650 880 642Q878 637 858 637Q787 633 769 597L620 7Q618 0 599 0Q585 0 582 2Q579 5 453 305L326 604L261 344Q196 88 196 79Q201 46 268 46H278Q284 41 284 38T282 19Q278 6 272 0H259Q228 2 151 2Q123 2 100 2T63 2T46 1Q31 1 31 10Q31 14 34 26T39 40Q41 46 62 46Q130 49 150 85Q154 91 221 362L289 634Q287 635 234 637Z"></path></use></g><g transform="translate(1110.2,0)" data-mml-node="mo"><use data-c="2212" xlink:href="#MJX-29-TEX-N-2212"><path id=MJX-29-TEX-N-2212 d="M84 237T84 250T98 270H679Q694 262 694 250T679 230H98Q84 237 84 250Z"></path></use></g><g transform="translate(2110.4,0)" data-mml-node="mn"><use data-c="31" xlink:href="#MJX-29-TEX-N-31"><path id=MJX-29-TEX-N-31 d="M213 578L200 573Q186 568 160 563T102 556H83V602H102Q149 604 189 617T245 641T273 663Q275 666 285 666Q294 666 302 660V361L303 61Q310 54 315 52T339 48T401 46H427V0H416Q395 3 257 3Q121 3 100 0H88V46H114Q136 46 152 46T177 47T193 50T201 52T207 57T213 61V578Z"></path></use></g></g></g></svg></MJX-CONTAINER><SPAN>&nbsp;</SPAN>&#20010;&#36335;&#30001;&#22120;&#65292;&#20294;&#26159;&#36824;&#26377;&#19968;&#20010;&#28304;&#20027;&#26426;&#12290;&#23601;&#19968;&#20010;&#21253;&#32780;&#35328;&#65292;&#24635;&#20849;&#38656;&#35201;&#36827;&#34892;&#30340;&#20256;&#36755;&#27425;&#25968;&#20381;&#28982;&#20026;<SPAN>&nbsp;</SPAN><MJX-CONTAINER class=MathJax jax="SVG"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="2.009ex" height="1.545ex" focusable="false" viewBox="0 -683 888 683" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-30-TEX-I-1D441 d="M234 637Q231 637 226 637Q201 637 196 638T191 649Q191 676 202 682Q204 683 299 683Q376 683 387 683T401 677Q612 181 616 168L670 381Q723 592 723 606Q723 633 659 637Q635 637 635 648Q635 650 637 660Q641 676 643 679T653 683Q656 683 684 682T767 680Q817 680 843 681T873 682Q888 682 888 672Q888 650 880 642Q878 637 858 637Q787 633 769 597L620 7Q618 0 599 0Q585 0 582 2Q579 5 453 305L326 604L261 344Q196 88 196 79Q201 46 268 46H278Q284 41 284 38T282 19Q278 6 272 0H259Q228 2 151 2Q123 2 100 2T63 2T46 1Q31 1 31 10Q31 14 34 26T39 40Q41 46 62 46Q130 49 150 85Q154 91 221 362L289 634Q287 635 234 637Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D441" xlink:href="#MJX-30-TEX-I-1D441"><path id=MJX-30-TEX-I-1D441 d="M234 637Q231 637 226 637Q201 637 196 638T191 649Q191 676 202 682Q204 683 299 683Q376 683 387 683T401 677Q612 181 616 168L670 381Q723 592 723 606Q723 633 659 637Q635 637 635 648Q635 650 637 660Q641 676 643 679T653 683Q656 683 684 682T767 680Q817 680 843 681T873 682Q888 682 888 672Q888 650 880 642Q878 637 858 637Q787 633 769 597L620 7Q618 0 599 0Q585 0 582 2Q579 5 453 305L326 604L261 344Q196 88 196 79Q201 46 268 46H278Q284 41 284 38T282 19Q278 6 272 0H259Q228 2 151 2Q123 2 100 2T63 2T46 1Q31 1 31 10Q31 14 34 26T39 40Q41 46 62 46Q130 49 150 85Q154 91 221 362L289 634Q287 635 234 637Z"></path></use></g></g></g></svg></MJX-CONTAINER>&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#23558;&#39318;&#20010;&#21253;&#20256;&#36755;&#21040;&#30446;&#26631;&#22320;&#28857;&#20043;&#21518;&#65288;&#27492;&#26102;&#28040;&#32791;&#30340;&#26102;&#38388;&#20026;<SPAN>&nbsp;</SPAN><MJX-CONTAINER class=MathJax jax="SVG"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="5.853ex" height="2.798ex" focusable="false" viewBox="0 -877 2587.1 1236.8" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-31-TEX-I-1D441 d="M234 637Q231 637 226 637Q201 637 196 638T191 649Q191 676 202 682Q204 683 299 683Q376 683 387 683T401 677Q612 181 616 168L670 381Q723 592 723 606Q723 633 659 637Q635 637 635 648Q635 650 637 660Q641 676 643 679T653 683Q656 683 684 682T767 680Q817 680 843 681T873 682Q888 682 888 672Q888 650 880 642Q878 637 858 637Q787 633 769 597L620 7Q618 0 599 0Q585 0 582 2Q579 5 453 305L326 604L261 344Q196 88 196 79Q201 46 268 46H278Q284 41 284 38T282 19Q278 6 272 0H259Q228 2 151 2Q123 2 100 2T63 2T46 1Q31 1 31 10Q31 14 34 26T39 40Q41 46 62 46Q130 49 150 85Q154 91 221 362L289 634Q287 635 234 637Z"></path><path id=MJX-31-TEX-N-22C5 d="M78 250Q78 274 95 292T138 310Q162 310 180 294T199 251Q199 226 182 208T139 190T96 207T78 250Z"></path><path id=MJX-31-TEX-I-1D43F d="M228 637Q194 637 192 641Q191 643 191 649Q191 673 202 682Q204 683 217 683Q271 680 344 680Q485 680 506 683H518Q524 677 524 674T522 656Q517 641 513 637H475Q406 636 394 628Q387 624 380 600T313 336Q297 271 279 198T252 88L243 52Q243 48 252 48T311 46H328Q360 46 379 47T428 54T478 72T522 106T564 161Q580 191 594 228T611 270Q616 273 628 273H641Q647 264 647 262T627 203T583 83T557 9Q555 4 553 3T537 0T494 -1Q483 -1 418 -1T294 0H116Q32 0 32 10Q32 17 34 24Q39 43 44 45Q48 46 59 46H65Q92 46 125 49Q139 52 144 61Q147 65 216 339T285 628Q285 635 228 637Z"></path><path id=MJX-31-TEX-I-1D445 d="M230 637Q203 637 198 638T193 649Q193 676 204 682Q206 683 378 683Q550 682 564 680Q620 672 658 652T712 606T733 563T739 529Q739 484 710 445T643 385T576 351T538 338L545 333Q612 295 612 223Q612 212 607 162T602 80V71Q602 53 603 43T614 25T640 16Q668 16 686 38T712 85Q717 99 720 102T735 105Q755 105 755 93Q755 75 731 36Q693 -21 641 -21H632Q571 -21 531 4T487 82Q487 109 502 166T517 239Q517 290 474 313Q459 320 449 321T378 323H309L277 193Q244 61 244 59Q244 55 245 54T252 50T269 48T302 46H333Q339 38 339 37T336 19Q332 6 326 0H311Q275 2 180 2Q146 2 117 2T71 2T50 1Q33 1 33 10Q33 12 36 24Q41 43 46 45Q50 46 61 46H67Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628Q287 635 230 637ZM630 554Q630 586 609 608T523 636Q521 636 500 636T462 637H440Q393 637 386 627Q385 624 352 494T319 361Q319 360 388 360Q466 361 492 367Q556 377 592 426Q608 449 619 486T630 554Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D441" xlink:href="#MJX-31-TEX-I-1D441"><path id=MJX-31-TEX-I-1D441 d="M234 637Q231 637 226 637Q201 637 196 638T191 649Q191 676 202 682Q204 683 299 683Q376 683 387 683T401 677Q612 181 616 168L670 381Q723 592 723 606Q723 633 659 637Q635 637 635 648Q635 650 637 660Q641 676 643 679T653 683Q656 683 684 682T767 680Q817 680 843 681T873 682Q888 682 888 672Q888 650 880 642Q878 637 858 637Q787 633 769 597L620 7Q618 0 599 0Q585 0 582 2Q579 5 453 305L326 604L261 344Q196 88 196 79Q201 46 268 46H278Q284 41 284 38T282 19Q278 6 272 0H259Q228 2 151 2Q123 2 100 2T63 2T46 1Q31 1 31 10Q31 14 34 26T39 40Q41 46 62 46Q130 49 150 85Q154 91 221 362L289 634Q287 635 234 637Z"></path></use></g><g transform="translate(1110.2,0)" data-mml-node="mo"><use data-c="22C5" xlink:href="#MJX-31-TEX-N-22C5"><path id=MJX-31-TEX-N-22C5 d="M78 250Q78 274 95 292T138 310Q162 310 180 294T199 251Q199 226 182 208T139 190T96 207T78 250Z"></path></use></g><g transform="translate(1610.4,0)" data-mml-node="mfrac"><g transform="translate(247.6,394) scale(0.707)" data-mml-node="mi"><use data-c="1D43F" xlink:href="#MJX-31-TEX-I-1D43F"><path id=MJX-31-TEX-I-1D43F d="M228 637Q194 637 192 641Q191 643 191 649Q191 673 202 682Q204 683 217 683Q271 680 344 680Q485 680 506 683H518Q524 677 524 674T522 656Q517 641 513 637H475Q406 636 394 628Q387 624 380 600T313 336Q297 271 279 198T252 88L243 52Q243 48 252 48T311 46H328Q360 46 379 47T428 54T478 72T522 106T564 161Q580 191 594 228T611 270Q616 273 628 273H641Q647 264 647 262T627 203T583 83T557 9Q555 4 553 3T537 0T494 -1Q483 -1 418 -1T294 0H116Q32 0 32 10Q32 17 34 24Q39 43 44 45Q48 46 59 46H65Q92 46 125 49Q139 52 144 61Q147 65 216 339T285 628Q285 635 228 637Z"></path></use></g><g transform="translate(220,-345) scale(0.707)" data-mml-node="mi"><use data-c="1D445" xlink:href="#MJX-31-TEX-I-1D445"><path id=MJX-31-TEX-I-1D445 d="M230 637Q203 637 198 638T193 649Q193 676 204 682Q206 683 378 683Q550 682 564 680Q620 672 658 652T712 606T733 563T739 529Q739 484 710 445T643 385T576 351T538 338L545 333Q612 295 612 223Q612 212 607 162T602 80V71Q602 53 603 43T614 25T640 16Q668 16 686 38T712 85Q717 99 720 102T735 105Q755 105 755 93Q755 75 731 36Q693 -21 641 -21H632Q571 -21 531 4T487 82Q487 109 502 166T517 239Q517 290 474 313Q459 320 449 321T378 323H309L277 193Q244 61 244 59Q244 55 245 54T252 50T269 48T302 46H333Q339 38 339 37T336 19Q332 6 326 0H311Q275 2 180 2Q146 2 117 2T71 2T50 1Q33 1 33 10Q33 12 36 24Q41 43 46 45Q50 46 61 46H67Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628Q287 635 230 637ZM630 554Q630 586 609 608T523 636Q521 636 500 636T462 637H440Q393 637 386 627Q385 624 352 494T319 361Q319 360 388 360Q466 361 492 367Q556 377 592 426Q608 449 619 486T630 554Z"></path></use></g><rect width="736.7" height="60" x="120" y="220"></rect></g></g></g></svg></MJX-CONTAINER>&#65289;&#65292;&#31532;&#20108;&#20010;&#21253;&#23601;&#20301;&#20110;&#20498;&#25968;&#31532;&#19968;&#20010;&#36335;&#30001;&#22120;&#19978;&#65292;&#36825;&#20010;&#21253;&#20256;&#36755;&#21040;&#30446;&#30340;&#22320;&#25152;&#38656;&#35201;&#30340;&#26102;&#38388;&#20026;<SPAN>&nbsp;</SPAN><MJX-CONTAINER class=MathJax jax="SVG"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="2.21ex" height="2.798ex" focusable="false" viewBox="0 -877 976.7 1236.8" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-32-TEX-I-1D43F d="M228 637Q194 637 192 641Q191 643 191 649Q191 673 202 682Q204 683 217 683Q271 680 344 680Q485 680 506 683H518Q524 677 524 674T522 656Q517 641 513 637H475Q406 636 394 628Q387 624 380 600T313 336Q297 271 279 198T252 88L243 52Q243 48 252 48T311 46H328Q360 46 379 47T428 54T478 72T522 106T564 161Q580 191 594 228T611 270Q616 273 628 273H641Q647 264 647 262T627 203T583 83T557 9Q555 4 553 3T537 0T494 -1Q483 -1 418 -1T294 0H116Q32 0 32 10Q32 17 34 24Q39 43 44 45Q48 46 59 46H65Q92 46 125 49Q139 52 144 61Q147 65 216 339T285 628Q285 635 228 637Z"></path><path id=MJX-32-TEX-I-1D445 d="M230 637Q203 637 198 638T193 649Q193 676 204 682Q206 683 378 683Q550 682 564 680Q620 672 658 652T712 606T733 563T739 529Q739 484 710 445T643 385T576 351T538 338L545 333Q612 295 612 223Q612 212 607 162T602 80V71Q602 53 603 43T614 25T640 16Q668 16 686 38T712 85Q717 99 720 102T735 105Q755 105 755 93Q755 75 731 36Q693 -21 641 -21H632Q571 -21 531 4T487 82Q487 109 502 166T517 239Q517 290 474 313Q459 320 449 321T378 323H309L277 193Q244 61 244 59Q244 55 245 54T252 50T269 48T302 46H333Q339 38 339 37T336 19Q332 6 326 0H311Q275 2 180 2Q146 2 117 2T71 2T50 1Q33 1 33 10Q33 12 36 24Q41 43 46 45Q50 46 61 46H67Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628Q287 635 230 637ZM630 554Q630 586 609 608T523 636Q521 636 500 636T462 637H440Q393 637 386 627Q385 624 352 494T319 361Q319 360 388 360Q466 361 492 367Q556 377 592 426Q608 449 619 486T630 554Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mfrac"><g transform="translate(247.6,394) scale(0.707)" data-mml-node="mi"><use data-c="1D43F" xlink:href="#MJX-32-TEX-I-1D43F"><path id=MJX-32-TEX-I-1D43F d="M228 637Q194 637 192 641Q191 643 191 649Q191 673 202 682Q204 683 217 683Q271 680 344 680Q485 680 506 683H518Q524 677 524 674T522 656Q517 641 513 637H475Q406 636 394 628Q387 624 380 600T313 336Q297 271 279 198T252 88L243 52Q243 48 252 48T311 46H328Q360 46 379 47T428 54T478 72T522 106T564 161Q580 191 594 228T611 270Q616 273 628 273H641Q647 264 647 262T627 203T583 83T557 9Q555 4 553 3T537 0T494 -1Q483 -1 418 -1T294 0H116Q32 0 32 10Q32 17 34 24Q39 43 44 45Q48 46 59 46H65Q92 46 125 49Q139 52 144 61Q147 65 216 339T285 628Q285 635 228 637Z"></path></use></g><g transform="translate(220,-345) scale(0.707)" data-mml-node="mi"><use data-c="1D445" xlink:href="#MJX-32-TEX-I-1D445"><path id=MJX-32-TEX-I-1D445 d="M230 637Q203 637 198 638T193 649Q193 676 204 682Q206 683 378 683Q550 682 564 680Q620 672 658 652T712 606T733 563T739 529Q739 484 710 445T643 385T576 351T538 338L545 333Q612 295 612 223Q612 212 607 162T602 80V71Q602 53 603 43T614 25T640 16Q668 16 686 38T712 85Q717 99 720 102T735 105Q755 105 755 93Q755 75 731 36Q693 -21 641 -21H632Q571 -21 531 4T487 82Q487 109 502 166T517 239Q517 290 474 313Q459 320 449 321T378 323H309L277 193Q244 61 244 59Q244 55 245 54T252 50T269 48T302 46H333Q339 38 339 37T336 19Q332 6 326 0H311Q275 2 180 2Q146 2 117 2T71 2T50 1Q33 1 33 10Q33 12 36 24Q41 43 46 45Q50 46 61 46H67Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628Q287 635 230 637ZM630 554Q630 586 609 608T523 636Q521 636 500 636T462 637H440Q393 637 386 627Q385 624 352 494T319 361Q319 360 388 360Q466 361 492 367Q556 377 592 426Q608 449 619 486T630 554Z"></path></use></g><rect width="736.7" height="60" x="120" y="220"></rect></g></g></g></svg></MJX-CONTAINER>&#65292;&#36825;&#26679;&#36882;&#25512;&#19979;&#21435;&#23601;&#33021;&#24471;&#21040;&#31572;&#26696;&#65307;</FONT></LI></OL>
<H4 id=&#25490;&#38431;&#24310;&#36831;&#20002;&#21253;><FONT style="BACKGROUND-COLOR: #7be1e1">&#25490;&#38431;&#24310;&#36831;&#12289;&#20002;&#21253;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#37492;&#20110;&#27599;&#20010;&#21253;&#20132;&#25442;&#26426;&#37117;&#26377;&#30528;&#25968;&#20010;&#38142;&#36335;&#19982;&#20043;&#38142;&#25509;&#65292;&#21253;&#20132;&#25442;&#26426;&#20026;&#27599;&#20010;&#38142;&#36335;&#37117;&#37197;&#22791;&#20102;&#19968;&#20010;<STRONG>&#36755;&#20986;&#32531;&#23384;</STRONG>&#65288;<EM>output buffer</EM>&#65289;&#25110;&#32773;&#35828;<STRONG>&#36755;&#20986;&#38431;&#21015;</STRONG>&#65288;<EM>output queue</EM>&#65289;&#65292;&#29992;&#20110;&#26242;&#26102;&#20648;&#23384;&#38656;&#32463;&#27492;&#38142;&#36335;&#21457;&#36865;&#20986;&#21435;&#30340;&#25968;&#25454;&#12290;&#22914;&#26524;&#35813;&#38142;&#36335;&#32321;&#24537;&#65292;&#24453;&#21457;&#36865;&#30340;&#21253;&#24517;&#39035;&#22312;&#23545;&#24212;&#38142;&#36335;&#30340;&#36755;&#20986;&#38431;&#21015;&#20013;&#31561;&#24453;&#19968;&#27573;&#26102;&#38388;&#12290;&#22240;&#27492;&#65292;&#38500;&#20102;&#20648;&#23384;&#21644;&#36716;&#21457;&#24310;&#36831;&#65292;&#21253;&#36824;&#20250;&#21463;&#21040;<STRONG>&#25490;&#38431;&#24310;&#36831;</STRONG>&#65288;<EM>queuing delay</EM>&#65289;&#30340;&#24433;&#21709;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-9" name=ref-footnote-9>9</A></SUP></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;<STRONG>&#25317;&#22622;</STRONG>&#65288;<EM>congestion</EM>&#65289;&#20250;&#22312;&#36335;&#30001;&#22120;&#22788;&#29702;&#21253;&#30340;&#36895;&#29575;&#19981;&#21450;&#21253;&#34987;&#21457;&#36865;&#30340;&#36895;&#29575;&#26102;&#21457;&#29983;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-10" name=ref-footnote-10>10</A></SUP></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#32771;&#34385;&#21040;&#23454;&#38469;&#19978;&#36755;&#20986;&#38431;&#21015;&#30340;&#31354;&#38388;&#26159;&#26377;&#38480;&#30340;&#65292;&#22914;&#26524;&#24403;&#26576;&#20010;&#21253;&#21040;&#36798;&#21253;&#20132;&#25442;&#26426;&#26102;&#21457;&#29616;&#20854;&#36755;&#20986;&#38431;&#21015;&#24050;&#32463;&#28385;&#20102;&#65292;&#23601;&#20250;&#21457;&#29983;<STRONG>&#20002;&#21253;</STRONG>&#65288;<EM>packet loss</EM>&#65289;&#12290;&#20002;&#21253;&#26080;&#38750;&#26377;&#20004;&#31181;&#35299;&#20915;&#26041;&#26696;&#65306;&#33293;&#24323;&#25481;&#38431;&#21015;&#20013;&#30340;&#21253;&#25110;&#32773;&#33293;&#24323;&#25481;&#21018;&#21040;&#36798;&#30340;&#21253;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-11" name=ref-footnote-11>11</A></SUP></FONT></P>
<H4 id=&#36716;&#21457;&#34920;&#21644;&#36335;&#30001;&#31471;&#21475;><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#36716;&#21457;&#34920;&#21644;&#36335;&#30001;&#31471;&#21475;</FONT></STRONG></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#24456;&#22810;&#26102;&#20505;&#65292;&#19968;&#20010;&#36335;&#30001;&#22120;&#24448;&#24448;&#26377;&#22810;&#20010;&#38142;&#36335;&#19982;&#20043;&#30456;&#36830;&#65292;&#37027;&#20040;&#65292;<U>&#36335;&#30001;&#22914;&#20309;&#20915;&#23450;&#23558;&#21253;&#20998;&#21457;&#21040;&#21738;&#19968;&#26465;&#38142;&#36335;&#20013;</U>&#65311;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#39318;&#20808;&#65292;&#27599;&#20010;&#32456;&#31471;&#31995;&#32479;&#37117;&#25317;&#26377;&#30528;&#19968;&#20010; IP &#22320;&#22336;&#65292;&#31867;&#20284;&#20110;&#24314;&#31569;&#30340;&#22320;&#22336;&#19968;&#26679;&#65292;IP &#22320;&#22336;&#20063;&#26377;&#30528;&#19968;&#23450;&#30340;&#23618;&#32423;&#32467;&#26500;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#20854;&#27425;&#65292;&#24403;&#26576;&#20010;&#32456;&#31471;&#31995;&#32479;&#24819;&#35201;&#23558;&#26576;&#20010;&#21253;&#21457;&#36865;&#21040;&#26576;&#20010;&#32456;&#31471;&#31995;&#32479;&#26102;&#65292;&#28304;&#32456;&#31471;&#31995;&#32479;&#20250;&#23558;&#30446;&#26631;&#32456;&#31471;&#31995;&#32479;&#30340; IP &#22320;&#22336;&#25918;&#21040;&#21253;&#30340;&#22836;&#23383;&#33410;&#20013;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-12" name=ref-footnote-12>12</A></SUP>&#65307;</FONT></LI></UL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#22522;&#20110;&#20197;&#19978;&#32593;&#32476;&#29305;&#24615;&#65292;&#36335;&#30001;&#22120;&#20250;&#20351;&#29992;<STRONG>&#36716;&#21457;&#34920;</STRONG>&#65288;<EM>forwarding table</EM>&#65289;&#26681;&#25454;&#30446;&#26631;&#22320;&#22336;&#30340;&#19968;&#37096;&#20998;&#25110;&#32773;&#25972;&#20010;&#30446;&#26631;&#22320;&#22336;&#65292;&#30830;&#23450;&#24212;&#35813;&#23558;&#36825;&#20010;&#21253;&#21457;&#36865;&#21040;&#21738;&#19968;&#20010;&#20986;&#31449;&#38142;&#36335;&#65288;<EM>outbound links</EM>&#65289;&#20013;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#37027;&#20040;&#65292;&#27599;&#20010;&#36335;&#30001;&#22120;&#30340;&#36716;&#21457;&#34920;&#21448;&#26159;&#36890;&#36807;&#20160;&#20040;&#26679;&#30340;&#26041;&#24335;&#35774;&#23450;&#30340;&#21602;&#65311;&#31616;&#21333;&#26469;&#35828;&#23601;&#26159;&#36890;&#36807;&#19968;&#31995;&#21015;&#30340;<STRONG>&#36335;&#30001;&#21327;&#35758;</STRONG>&#33258;&#21160;&#35774;&#23450;&#30340;</FONT></P>
<H4 id=&#34394;&#25311;&#30005;&#36335;><FONT style="BACKGROUND-COLOR: #7be1e1">&#34394;&#25311;&#30005;&#36335;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#19979;&#38754;&#23558;&#35848;&#35848;&#34394;&#25311;&#30005;&#36335;</FONT></P>
<P><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#34394;&#25311;&#30005;&#36335;&#21644;&#30005;&#36335;&#20132;&#25442;&#24322;&#21516;&#28857;</FONT></STRONG></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#30005;&#36335;&#20132;&#25442;&#30456;&#27604;&#20110;&#34394;&#25311;&#30005;&#36335;&#33021;&#25552;&#20379;&#31283;&#23450;&#30340;&#27604;&#29305;&#20256;&#36755;&#36895;&#29575;&#21644;&#24310;&#36831;&#65292;&#36825;&#26159;&#22240;&#20026;&#34394;&#25311;&#30005;&#36335;&#20250;&#22240;&#20026;&#20197;&#19979;&#22240;&#32032;&#21463;&#21040;&#24433;&#21709;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#19981;&#21516;&#33410;&#28857;&#21253;&#38431;&#21015;&#38271;&#24230;&#19981;&#19968;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#24212;&#29992;&#25152;&#20445;&#35777;&#30340;&#27604;&#29305;&#36895;&#29575;&#19981;&#19968;&#65307;</FONT></LI></UL>
<P><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#34394;&#25311;&#30005;&#36335;&#30340;&#20248;&#21183;</FONT></STRONG></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#22522;&#20110;&#20998;&#32452;&#20132;&#25442;&#30340;&#34394;&#25311;&#30005;&#36335;&#22312;&#20256;&#36755;&#25968;&#25454;&#30340;&#36807;&#31243;&#20013;&#65292;<U>&#24635;&#26159;</U>&#20250;&#37319;&#29992;&#30456;&#21516;&#30340;&#36335;&#30001;&#65292;&#32463;&#36807;&#30456;&#21516;&#30340;&#33410;&#28857;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#36335;&#30001;&#22120;&#19981;&#20250;&#23545;&#25968;&#25454;&#21253;&#25191;&#34892;&#36335;&#30001;&#31639;&#27861;&#65292;&#21482;&#26377;&#19968;&#20010;&#23567;&#30340;<U>&#34394;&#25311;&#39057;&#36947;&#26631;&#35782;&#31526;</U>&#65288;VCI&#65289;&#20250;&#34987;&#26816;&#26597;&#65288;&#32780;&#19981;&#26159; IP &#22320;&#22336;&#65289;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#36335;&#30001;&#20449;&#24687;&#20165;&#22312;&#38142;&#25509;&#24314;&#31435;&#26102;&#20250;&#34987;&#20256;&#36755;&#65292;&#38543;&#21518;&#36335;&#30001;&#22120;&#23601;&#20250;&#20445;&#23384;&#23427;&#20204;&#30340;&#29366;&#24577;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#38142;&#36335;&#20197;&#21450;&#36335;&#30001;&#36164;&#28304;<U>&#26377;&#21487;&#33021;</U>&#20250;&#34987;&#39044;&#30041;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#21482;&#26377;&#22312;&#38142;&#25509;&#24314;&#31435;&#26102;&#27599;&#20010;&#33410;&#28857;&#25165;&#20250;&#23545;&#25968;&#25454;&#21253;&#25191;&#34892;&#36335;&#30001;&#65307;</FONT></LI></UL>
<P><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#34394;&#25311;&#30005;&#36335;&#30340;&#23454;&#29616;</FONT></STRONG></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#34394;&#25311;&#30005;&#36335;&#21253;&#25324;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#20174;&#28304;&#33410;&#28857;&#21040;&#30446;&#26631;&#33410;&#28857;&#30340;&#36335;&#24452;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">VC &#21495;&#65292;&#36335;&#24452;&#19978;&#27599;&#19968;&#26465;&#38142;&#36335;&#37117;&#26377;&#30528;&#33258;&#24049;&#30340; VC &#21495;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#27839;&#36335;&#30340;&#36716;&#21457;&#34920;&#20013;&#20250;&#26377;&#30456;&#20851;&#30340;&#34920;&#39033;&#20648;&#23384; VC &#21495;&#65307;</FONT></LI></UL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#25972;&#20010;&#36716;&#21457;&#36807;&#31243;&#30340;&#36923;&#36753;&#26159;&#65306;&#36335;&#24452;&#19978;&#30340;&#25968;&#25454;&#21253;&#27599;&#21040;&#36798;&#19968;&#26465;&#26032;&#30340;&#38142;&#36335;&#65292;&#20854; VC &#21495;&#37117;&#20250;&#34987;&#26367;&#25442;&#25104;&#23545;&#24212;&#38142;&#36335;&#30340; VC &#21495;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#19968;&#20010;&#36335;&#30001;&#22120;&#21487;&#20197;&#21442;&#19982;&#32452;&#25104;&#22810;&#26465;&#34394;&#25311;&#30005;&#36335;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220324102438456 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220324102438456.png"></FONT></P>
<P><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#34394;&#25311;&#30005;&#36335;&#19982;&#25968;&#25454;&#25253;</FONT></STRONG></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220324102735723 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220324102735723.png"></FONT></P>
<H3 id=&#30005;&#36335;&#20132;&#25442;><FONT style="BACKGROUND-COLOR: #7be1e1">&#30005;&#36335;&#20132;&#25442;</FONT></H3>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#30005;&#36335;&#20132;&#25442;</U>&#65288;<EM>Circuit Switching</EM>&#65289;&#20013;&#20250;&#35805;&#25152;&#38656;&#35201;&#30340;&#36164;&#28304;&#20250;&#34987;<U>&#39044;&#30041;</U>&#65292;&#20063;&#23601;&#26159;&#35828;&#65292;&#23613;&#31649;&#32593;&#32476;&#20013;&#26377;&#21097;&#20313;&#30340;&#36164;&#28304;&#65292;&#20294;&#26159;&#19981;&#33021;&#20687;&#20998;&#32452;&#20132;&#25442;&#19968;&#26679;&#65292;&#19968;&#20221;&#20250;&#35805;&#23558;&#36825;&#25152;&#26377;&#30340;&#36164;&#28304;&#20104;&#20197;&#29420;&#21344;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-13" name=ref-footnote-13>13</A></SUP>&#12290;&#27492;&#22806;&#65292;&#23601;&#31639;&#26576;&#26465;&#38142;&#25509;&#20013;&#24182;&#27809;&#26377;&#21457;&#36865;&#25110;&#25509;&#25910;&#20219;&#20309;&#25968;&#25454;&#65292;&#36825;&#26465;&#38142;&#25509;&#20063;&#20250;&#34987;&#19968;&#30452;&#20445;&#30041;&#30452;&#21040;&#26174;&#24335;&#30340;&#26029;&#24320;&#36830;&#25509;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-14" name=ref-footnote-14>14</A></SUP></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#29305;&#24615;&#65292;&#30005;&#36335;&#20132;&#25442;&#32593;&#32476;&#20013;&#27599;&#19968;&#20221;&#20250;&#35805;&#37117;&#38656;&#35201;&#24314;&#31435;&#19968;&#26465;<STRONG>&#32447;&#36335;</STRONG>&#65288;<EM>circuit</EM>&#65289;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#32447;&#36335;&#38656;&#35201;&#39044;&#20808;&#24314;&#31435;&#65292;&#36825;&#20063;&#23601;&#24847;&#21619;&#30528;&#20004;&#20010;&#20027;&#26426;&#20043;&#38388;&#24418;&#25104;&#20102;<U>&#31471;&#21040;&#31471;</U>&#65288;<EM>end-to-end</EM>&#65289;&#30340;&#38142;&#25509;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#32447;&#36335;&#30340;&#24314;&#31435;&#24847;&#21619;&#30528;<U>&#36335;&#24452;</U>&#65288;<EM>path</EM>&#65289;&#19978;&#30340;&#20132;&#25442;&#26426;&#21644;&#21508;&#31181;&#35774;&#22791;&#37117;&#20250;&#20026;&#27492;&#32447;&#36335;&#20445;&#25345;&#38142;&#25509;&#29366;&#24577;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#25110;&#20026;&#32447;&#36335;&#39044;&#30041;&#37096;&#20998;&#22266;&#23450;&#30340;&#20256;&#36755;&#36895;&#29575;&#65292;&#20063;&#23601;&#26159;&#35828;&#65292;&#20256;&#36755;&#26041;&#21644;&#25509;&#25910;&#26041;&#33267;&#23569;&#34987;&#20445;&#35777;&#33021;&#20197;&#19968;&#23450;&#30340;&#36895;&#29575;&#20256;&#36755;&#25968;&#25454;&#65307;</FONT></LI></UL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#37027;&#20040;&#65292;&#19968;&#26465;<U>&#38142;&#36335;</U>&#65288;<EM>link</EM>&#65289;&#26159;&#22914;&#20309;&#23481;&#32435;&#22810;&#26465;<U>&#32447;&#36335;</U>&#65288;<EM>circuit</EM>&#65289;&#30340;&#21602;&#65292;&#36825;&#23601;&#28041;&#21450;&#21040;&#20197;&#19979;&#20004;&#20010;&#25216;&#26415;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#39057;&#20998;&#22797;&#29992;</U>&#65288;<EM>frequency-division multiplexing</EM>&#65292;FDM&#65289;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#26102;&#20998;&#22797;&#29992;</U>&#65288;<EM>time-division multiplexing</EM>&#65292;TDM&#65289;&#65307;</FONT></LI></UL>
<H4 id=fdm><FONT style="BACKGROUND-COLOR: #7be1e1">FDM</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#23558;&#39057;&#24102;&#30340;&#23485;&#24230;&#65288;&#24102;&#23485;&#65292;bandwidth&#65289;&#22343;&#31561;&#30340;&#20999;&#21106;&#65292;&#32447;&#36335;&#21482;&#33021;&#20351;&#29992;&#19968;&#37096;&#20998;&#39057;&#24102;&#36827;&#34892;&#36890;&#20449;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220306191017208 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220306191017208.png"></FONT></P>
<H4 id=tdm><FONT style="BACKGROUND-COLOR: #7be1e1">TDM</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#23545;&#20110;&#26102;&#20998;&#22797;&#29992;&#26469;&#35828;&#65292;&#26102;&#38388;&#20250;&#34987;&#20998;&#25104;&#38271;&#24230;&#22266;&#23450;&#30340;&#24103;&#65292;&#36825;&#20123;&#24103;&#21448;&#20250;&#34987;&#20998;&#25104;&#19968;&#23450;&#25968;&#37327;&#30340;<STRONG>&#26102;&#38553;</STRONG>&#65288;<EM>time slots</EM>&#65289;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#27599;&#24403;&#32593;&#32476;&#20013;&#24314;&#31435;&#36215;&#19968;&#20010;&#38142;&#25509;&#65292;&#23601;&#20250;&#22312;&#27599;&#19968;&#20010;&#26102;&#38388;&#24103;&#20013;&#20026;&#20854;&#20998;&#37197;&#19968;&#20010;&#26102;&#38553;&#65292;&#35813;&#38142;&#25509;&#20165;&#22312;&#27492;&#26102;&#38553;&#20869;&#21487;&#20197;&#20256;&#36755;&#25968;&#25454;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220306191043955 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220306191043955.png"></FONT></P>
<H4 id=stdm><FONT style="BACKGROUND-COLOR: #7be1e1">STDM</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#23613;&#31649;&#22343;&#34913;&#12289;&#22266;&#23450;&#21010;&#20998;&#30475;&#36215;&#26469;&#24456;&#20844;&#24179;&#65292;&#20294;&#26159;&#23545;&#20110;&#19981;&#22343;&#21248;&#30340;&#12289;&#31361;&#21457;&#30340;&#25968;&#25454;&#20381;&#28982;&#20250;&#26377;&#24456;&#22810;&#36164;&#28304;&#34987;&#28010;&#36153;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220306191148379 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220306191148379.png"></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#22240;&#27492;&#65292;&#21518;&#26469;&#26377;&#20986;&#29616;&#19968;&#31181;&#22522;&#20110;&#21382;&#21490;&#32479;&#35745;&#25968;&#25454;&#23545;&#32593;&#32476;&#36164;&#28304;&#30340;&#21010;&#20998;&#26041;&#24335;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220306191543991 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220306191543991.png"></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#35841;&#21457;&#30340;&#22810;&#65292;&#35841;&#23601;&#33021;&#25343;&#21040;&#26356;&#22810;&#30340;&#36164;&#28304;</FONT></P>
<H4 id=&#30005;&#36335;&#20132;&#25442;&#19982;&#20998;&#32452;&#20132;&#25442;><FONT style="BACKGROUND-COLOR: #7be1e1">&#30005;&#36335;&#20132;&#25442;&#19982;&#20998;&#32452;&#20132;&#25442;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#23454;&#36341;&#20013;&#65292;&#20855;&#20307;&#22312;&#36825;&#20004;&#31181;&#20132;&#25442;&#26041;&#24335;&#20013;&#36873;&#25321;&#21738;&#19968;&#31181;&#24456;&#22823;&#31243;&#24230;&#19978;&#21462;&#20915;&#20110;&#32593;&#32476;&#28304;&#20027;&#26426;&#20256;&#36755;&#25968;&#25454;&#30340;&#27169;&#24335;&#65292;&#22914;&#26524;&#28304;&#33410;&#28857;&#20250;&#20197;&#24658;&#23450;&#27604;&#29305;&#29575;&#65288;CBR&#65289;&#20256;&#36755;&#25968;&#25454;&#65292;&#36873;&#25321;&#30005;&#36335;&#20132;&#25442;&#21487;&#33021;&#26356;&#22909;&#65292;<U>&#36825;&#26159;&#22240;&#20026;&#22914;&#26524;&#28304;&#20027;&#26426;&#30340;&#27604;&#29305;&#29575;&#24658;&#23450;&#30340;&#35805;</U></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#27492;&#22806;&#65292;&#38754;&#21521;&#36830;&#25509;&#24335;&#20256;&#36755;&#23454;&#38469;&#19978;&#21644;&#30005;&#36335;&#20132;&#25442;&#19981;&#26159;&#30456;&#20114;&#32465;&#23450;&#30340;&#65292;&#20998;&#32452;&#20132;&#25442;&#20063;&#21487;&#20197;&#23454;&#29616;&#38754;&#21521;&#36830;&#25509;&#24335;&#20256;&#36755;&#12290;&#22240;&#27492;&#30005;&#36335;&#20132;&#25442;&#21644;&#20998;&#32452;&#20132;&#25442;&#20004;&#32773;<U>&#22312;&#24310;&#36831;&#19978;</U>&#26368;&#22823;&#30340;&#24046;&#21035;&#26159;&#20174;&#28304;&#20027;&#26426;&#21040;&#30446;&#26631;&#20027;&#26426;&#30340;&#36335;&#30001;&#19978;&#65292;&#25152;&#26377;&#38142;&#36335;&#23545;&#24212;&#30340;&#36335;&#30001;&#22120;&#26159;&#21542;&#20026;<U>&#23384;&#20648;&#36716;&#21457;&#24335;&#20256;&#36755;</U>&#12290;&#22914;&#26524;&#26159;&#20998;&#32452;&#20132;&#25442;&#65288;&#26080;&#35770;&#26159;&#25968;&#25454;&#25253;&#32593;&#32476;&#36824;&#26159;&#34394;&#25311;&#30005;&#36335;&#32593;&#32476;&#65289;&#65292;&#37027;&#20040;&#36335;&#30001;&#19978;&#27599;&#19968;&#20010;&#36335;&#30001;&#22120;&#30340;&#20256;&#36755;&#24310;&#36831;&#37117;&#35201;&#34987;&#35745;&#31639;&#22312;&#20854;&#20013;&#65292;&#30005;&#36335;&#20132;&#25442;&#21017;&#19981;&#29992;&#65292;&#21482;&#38656;&#35201;&#23558;&#38142;&#25509;&#24314;&#31435;&#30340;&#26102;&#38388;&#31639;&#22312;&#37324;&#36793;&#21363;&#21487;</FONT></P>
<H3 id=&#32593;&#32476;&#30340;&#32593;&#32476;><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#30340;&#32593;&#32476;</FONT></H3>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#26082;&#28982; ISP &#33021;&#23558;&#19981;&#21516;&#30340;&#32456;&#31471;&#29992;&#25143;&#36830;&#25509;&#36215;&#26469;&#65292;&#37027;&#20040;&#36825;&#20123; ISP &#20043;&#38388;&#21448;&#26159;&#22914;&#20309;&#36830;&#25509;&#36215;&#26469;&#30340;&#21602;&#65311;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#31572;&#26696;&#26159;&#36890;&#36807;&#24314;&#31435;<STRONG>&#32593;&#32476;&#30340;&#32593;&#32476;</STRONG>&#65288;<EM>network of network</EM>&#65289;&#65292;&#20026;&#20102;&#26356;&#22909;&#35299;&#37322;&#20160;&#20040;&#26159;&#32593;&#32476;&#30340;&#32593;&#32476;&#65292;&#25105;&#20204;&#19981;&#22952;&#20197;&#36880;&#28176;&#22686;&#21152;&#22797;&#26434;&#24230;&#30340;&#24418;&#24335;&#65292;&#23637;&#29616;&#20170;&#22825;&#20114;&#32852;&#32593;&#30340;&#26679;&#23376;</FONT></P>
<H4 id=&#32593;&#32476;&#32467;&#26500;&#19968;><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#32467;&#26500;&#19968;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#26368;&#31616;&#21333;&#65292;&#30452;&#25509;&#30340;&#26041;&#27861;&#26159;&#23558;&#25152;&#26377;&#30452;&#25509;&#19982;&#32456;&#31471;&#29992;&#25143;&#30452;&#25509;&#23545;&#25509;&#30340; ISP &#29992;&#19968;&#20010;&#26356;&#22823;&#30340;&#12289;&#20840;&#29699;&#24615;&#30340; ISP &#36830;&#25509;&#36215;&#26469;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#30001;&#20110;&#24213;&#23618; ISP &#23454;&#38469;&#19978;&#38656;&#35201;&#21521;&#20840;&#29699; ISP &#25903;&#20184;&#21521;&#20854;&#23427;&#24213;&#23618; ISP &#36890;&#20449;&#26102;&#25152;&#20135;&#29983;&#30340;&#36153;&#29992;&#65288;&#27605;&#31455;&#26159;&#36825;&#20010;&#20840;&#29699;&#36816;&#33829;&#21830;&#23558;&#36825;&#20004;&#20010; ISP &#36830;&#25509;&#36215;&#26469;&#30340;&#65289;&#22240;&#27492;&#25105;&#20204;&#19981;&#22952;&#23558;&#36825;&#20010;<U>&#25317;&#26377;&#20132;&#25442;&#25968;&#25454;&#38656;&#27714;&#30340; ISP</U><SPAN>&nbsp;</SPAN>&#31216;&#20026;<STRONG>&#28040;&#36153;&#32773;</STRONG>&#65288;<EM>customer</EM>&#65289;&#65292;&#23558;<U>&#36830;&#25509;&#21508;&#24213;&#23618; ISP &#30340;&#20840;&#29699; ISP</U><SPAN>&nbsp;</SPAN>&#31216;&#20026;<STRONG>&#25552;&#20379;&#32773;</STRONG>&#65288;<EM>provider</EM>&#65289;</FONT></P>
<H4 id=&#32593;&#32476;&#32467;&#26500;&#20108;><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#32467;&#26500;&#20108;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#24456;&#26174;&#28982;&#65292;&#24403;&#32593;&#32476;&#30340;&#35268;&#27169;&#32487;&#32493;&#22686;&#22823;&#65292;&#21333;&#20010;&#30340;&#20840;&#29699; ISP &#24050;&#32463;&#19981;&#36275;&#20197;&#28385;&#36275;&#24066;&#22330;&#30340;&#38656;&#27714;&#20102;&#12290;&#20026;&#27492;&#33258;&#28982;&#20250;&#20986;&#29616;&#22810;&#23478;&#20840;&#29699;&#24615;&#30340; ISP&#65292;&#36825;&#20123; ISP &#24444;&#27492;&#30456;&#36830;&#65292;&#26500;&#25104;&#26356;&#21152;&#22797;&#26434;&#30340;&#32593;&#36335;</FONT></P>
<H4 id=&#32593;&#32476;&#32467;&#26500;&#19977;><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#32467;&#26500;&#19977;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#26377;&#26102;&#20505;&#65292;&#22312;&#19968;&#20123;&#32593;&#27665;&#25968;&#37327;&#24040;&#22823;&#30340;&#22320;&#21306;&#65292;&#20165;&#19968;&#20010;&#20840;&#29699; ISP &#20063;&#19981;&#36275;&#20197;&#28040;&#32791;&#25152;&#26377;&#30340;&#25509;&#20837;&#32593;&#32476;&#38656;&#27714;&#12290;&#22522;&#20110;&#27492;&#65292;&#20986;&#29616;&#20102;<STRONG>&#22320;&#21306;&#24615; ISP</STRONG>&#65288;<EM>regional ISP</EM>&#65289;&#29992;&#20197;&#23558;&#24213;&#23618; ISP &#36830;&#25509;&#36215;&#26469;&#65292;&#20877;&#23558;&#25968;&#25454;&#36716;&#21457;&#21040;<STRONG>&#31532;&#19968;&#23618;&#32593;&#32476;</STRONG>&#65288;<EM>tier-1 ISP</EM>&#65289;&#20013;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-15" name=ref-footnote-15>15</A></SUP></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#24635;&#30340;&#26469;&#35828;&#65292;&#32593;&#32476;&#32467;&#26500;&#19977;&#22823;&#33268;&#21576;&#65306;&#32456;&#31471;&#31995;&#32479; =&gt; &#24213;&#23618; ISP =&gt; &#22320;&#21306;&#24615; ISP =&gt; &#31532;&#19968;&#23618;&#32593;&#32476; ISP</FONT></P>
<H4 id=&#32593;&#32476;&#32467;&#26500;&#22235;><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#32467;&#26500;&#22235;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#24403;&#28982;&#65292;&#20170;&#22825;&#30340;&#32593;&#32476;&#24456;&#26174;&#28982;&#19981;&#20165;&#20165;&#26159;&#31616;&#21333;&#30340;&#12289;&#30001; ISP &#36816;&#34892;&#21830;&#24418;&#25104;&#30340;&#23618;&#32423;&#32467;&#26500;&#36825;&#20040;&#31616;&#21333;&#12290;&#38500;&#20102;&#23618;&#32423;&#32467;&#26500;&#26412;&#36523;&#65292;&#32593;&#32476;&#20013;&#36824;&#21253;&#25324;&#21508;&#31181;&#21508;&#26679;&#30340;&#29289;&#29702;&#22522;&#30784;&#35774;&#26045;&#65306;<U>&#20837;&#32593;&#28857;</U>&#65288;<EM>points of presence</EM>&#65289;&#12289;<U>&#22810;&#23487;&#20027;</U>&#65288;<EM>mult-homing</EM>&#65289;&#12289;<U>&#23545;&#31561;&#36830;&#25509;</U>&#65288;<EM>peering</EM>&#65289;&#20197;&#21450;<U>&#20114;&#32852;&#32593;&#20132;&#25442;&#20013;&#24515;</U>&#65288;<EM>internet exchange points</EM>&#65289;</FONT></P>
<P><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#20837;&#32593;&#28857;</FONT></STRONG></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">PoP &#23454;&#38469;&#19978;&#23601;&#26159;&#19968;&#20010;<U>&#25552;&#20379;&#32773;</U>&#65288;provider&#65289;&#25918;&#32622;&#36335;&#30001;&#22120;&#30340;&#22320;&#26041;&#65292;&#28040;&#36153;&#32773;&#33021;&#22312;&#36825;&#37324;&#25509;&#20837;&#25552;&#20379;&#32773;&#30340;&#32593;&#32476;</FONT></P>
<P><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#22810;&#23487;&#20027;</FONT></STRONG></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">Mult-home &#25351;&#30340;&#26159;&#19968;&#20010;&#32456;&#31471;&#31995;&#32479;&#25110;&#32773;&#28040;&#36153;&#32773;&#36873;&#25321;&#25509;&#20837;&#20102;&#22810;&#20010;&#25552;&#20379;&#32773;&#65292;&#20174;&#32780;&#30830;&#20445;&#20854;&#20013;&#19968;&#20010;&#25552;&#20379;&#32773;&#20986;&#29616;&#38382;&#39064;&#26102;&#19981;&#33267;&#20110;&#27809;&#26377;&#32593;&#32476;&#21487;&#29992;</FONT></P>
<P><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#23545;&#31561;&#36830;&#25509;</FONT></STRONG></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#23545;&#31561;&#36830;&#25509;&#26159;&#19968;&#31181;&#20026;&#20102;&#20943;&#23569;&#32593;&#32476;&#36890;&#20449;&#33457;&#36153;&#32780;&#20351;&#29992;&#30340;&#38142;&#25509;&#26041;&#24335;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#21407;&#26412;&#22914;&#26524;&#20004;&#20010;&#24213;&#23618; ISP &#24819;&#35201;&#30456;&#20114;&#36830;&#25509;&#30340;&#35805;&#24517;&#39035;&#20808;&#35201;&#23558;&#25968;&#25454;&#19978;&#20256;&#21040;&#22320;&#21306; ISP &#19978;&#65292;&#20877;&#30001;&#22320;&#21306; ISP &#23558;&#25968;&#25454;&#36716;&#21457;&#21040;&#21478;&#19968;&#20010;&#24213;&#23618; ISP &#19978;&#12290;&#20294;&#22914;&#26524;&#36825;&#20004;&#20010;&#24213;&#23618; ISP &#21457;&#29616;&#24444;&#27492;&#20043;&#38388;&#30452;&#25509;&#30456;&#36830;&#24182;&#36890;&#20449;&#30340;&#24320;&#38144;&#35201;&#36828;&#23567;&#20110;&#20043;&#21069;&#37319;&#29992;&#30340;&#26041;&#26696;&#65292;&#37027;&#20040;&#24456;&#33258;&#28982;&#30340;&#36825;&#20004;&#20010;&#22320;&#21306; ISP &#23601;&#33021;&#30452;&#25509;&#36890;&#20449;&#65292;&#36825;&#23601;&#26159;&#25152;&#35859;&#30340;<STRONG>&#23545;&#31561;&#36830;&#25509;</STRONG>&#65288;&#19968;&#33324;&#26469;&#35828;&#65292;&#23545;&#31561;&#36830;&#25509;&#24847;&#21619;&#30528;&#24182;&#19981;&#38656;&#35201;&#30456;&#20114;&#25903;&#20184;&#32593;&#32476;&#36830;&#25509;&#36153;&#29992;&#65289;</FONT></P>
<P><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#20114;&#32852;&#32593;&#20132;&#25442;&#20013;&#24515;</FONT></STRONG></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">IXP &#23454;&#38469;&#19978;&#23601;&#26159;&#19968;&#20010;&#30001;&#31532;&#19977;&#26041;&#25152;&#25552;&#20379;&#30340;&#24314;&#31569;&#29289;&#65292;&#22312;&#36825;&#20010;&#22320;&#26041;&#35768;&#22810; ISP &#21487;&#20197;&#23454;&#29616;&#30456;&#20114;&#20043;&#38388;&#30340;&#23545;&#31561;&#36830;&#25509;</FONT></P>
<H4 id=&#32593;&#32476;&#32467;&#26500;&#20116;><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#32467;&#26500;&#20116;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#32467;&#26500;&#20116;&#22312;&#32593;&#32476;&#32467;&#26500;&#22235;&#30340;&#22522;&#30784;&#19978;&#28155;&#21152;&#20102;<STRONG>&#20869;&#23481;&#20998;&#21457;&#32593;&#32476;</STRONG>&#65288;<EM>content-provider network</EM>&#65289;&#65292;Google &#23601;&#26159;&#19968;&#20010;&#36825;&#26041;&#38754;&#30340;&#20363;&#23376;&#12290;Google &#30340;&#20869;&#23481;&#20998;&#21457;&#32593;&#32476;&#26159;&#19968;&#20010;&#29420;&#31435;&#30340;&#32593;&#32476;&#20307;&#31995;&#65292;&#23427;&#36890;&#36807;&#35753;&#20840;&#29699;&#21508;&#22320;&#30340; Google &#26381;&#21153;&#22120;&#65288;&#36825;&#20123;&#23567;&#22411;&#30340;&#25968;&#25454;&#20013;&#24515;&#36890;&#24120;&#20301;&#20110; IXP &#20013;&#65289;&#30452;&#25509;&#30456;&#36830;&#65292;&#32469;&#36807;<U>&#31532;&#19968;&#23618;&#32593;&#32476;</U>&#65292;&#35753;&#32456;&#31471;&#29992;&#25143;&#33021;&#26356;&#24555;&#30340;&#35775;&#38382;&#21040;&#20301;&#20110;&#20854;&#23427;&#22320;&#21306;&#30340; Google &#20869;&#23481;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220306161628917 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220306161628917.png"></FONT></P>
<H2 id=&#20998;&#32452;&#20132;&#25442;&#30340;&#24310;&#36831;&#20002;&#21253;&#21644;&#21534;&#21520;&#37327;><FONT style="BACKGROUND-COLOR: #7be1e1">&#20998;&#32452;&#20132;&#25442;&#30340;&#24310;&#36831;&#12289;&#20002;&#21253;&#21644;&#21534;&#21520;&#37327;</FONT></H2>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#26412;&#23567;&#33410;&#20027;&#35201;&#20171;&#32461;&#20998;&#32452;&#20132;&#25442;&#32593;&#32476;&#20256;&#36755;&#25968;&#25454;&#26102;&#20250;&#36935;&#21040;&#30340;&#38382;&#39064;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#24635;&#33410;&#28857;&#24310;&#36831;&#65306;&#33410;&#28857;&#22788;&#29702;&#24310;&#36831;&#12289;&#25490;&#38431;&#24310;&#36831;&#12289;&#20256;&#36755;&#24310;&#36831;&#12289;&#20256;&#25773;&#24310;&#36831;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#21253;&#20256;&#36755;&#36895;&#29575;&#21644;&#21253;&#21040;&#36798;&#36895;&#29575;&#23558;&#22914;&#20309;&#24433;&#21709;&#25490;&#38431;&#24310;&#36831;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#31471;&#21040;&#31471;&#20256;&#36755;&#24310;&#36831;&#20174;&#24635;&#20307;&#19978;&#30475;&#26159;&#20160;&#20040;&#24773;&#24418;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#19981;&#21516;&#20256;&#36755;&#38142;&#36335;&#30340;&#21534;&#21520;&#37327;&#23545;&#31995;&#32479;&#25972;&#20307;&#21534;&#21520;&#37327;&#30340;&#24433;&#21709;&#65307;</FONT></LI></UL>
<H3 id=&#24310;&#36831;&#30340;&#31181;&#31867;><FONT style="BACKGROUND-COLOR: #7be1e1">&#24310;&#36831;&#30340;&#31181;&#31867;</FONT></H3>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#22914;&#19978;&#25152;&#35265;&#65292;&#20998;&#32452;&#20132;&#25442;&#32593;&#32476;&#20013;&#24310;&#36831;&#20027;&#35201;&#20998;&#25104;&#22235;&#31181;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220306164943413 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220306164943413.png"></FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#33410;&#28857;&#22788;&#29702;&#24310;&#36831;</U>&#65288;<EM>nodal processing delay</EM>&#65289;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#25490;&#38431;&#24310;&#36831;</U>&#65288;<EM>queuing delay</EM>&#65289;; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#20256;&#36755;&#24310;&#36831;</U>&#65288;<EM>transmission delay</EM>&#65289;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#20256;&#25773;&#24310;&#36831;</U>&#65288;<EM>propagation delay</EM>&#65289;&#65307;</FONT></LI></UL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#19978;&#36848;&#22235;&#20010;&#24310;&#36831;&#30340;&#24635;&#21644;&#23601;&#31216;&#20026;<STRONG>&#24635;&#33410;&#28857;&#24310;&#36831;</STRONG>&#65288;<EM>total nodal delay</EM>&#65289;</FONT></P>
<P><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#22788;&#29702;&#24310;&#36831;</FONT></STRONG></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#22788;&#29702;&#24310;&#36831;&#20027;&#35201;&#30001;&#20004;&#37096;&#20998;&#32452;&#25104;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-16" name=ref-footnote-16>16</A></SUP>&#65292;&#23545;&#36335;&#30001;&#22120;&#30340;&#26368;&#22823;&#21534;&#21520;&#37327;&#26377;&#30528;&#26497;&#22823;&#30340;&#24433;&#21709;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#26816;&#26597;&#21253;&#30340;&#22836;&#23383;&#33410;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#30830;&#23450;&#24212;&#24403;&#23558;&#21253;&#36716;&#21457;&#21040;&#21738;&#19968;&#26465;&#38142;&#36335;&#20013;&#65307;</FONT></LI></UL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#39640;&#36895;&#36335;&#30001;&#22120;&#30340;&#22788;&#29702;&#24310;&#36831;&#25968;&#37327;&#32423;&#26159;&#24494;&#31186;</FONT></P>
<P><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#25490;&#38431;&#24310;&#36831;</FONT></STRONG></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#25490;&#38431;&#24310;&#36831;&#23454;&#38469;&#19978;&#23601;&#26159;&#21253;&#21040;&#36798;&#23545;&#24212;&#38142;&#36335;&#30340;<U>&#36755;&#20986;&#32531;&#23384;</U>&#65288;<EM>output buffer</EM>&#65289;&#20043;&#21518;&#65292;&#31561;&#24453;&#36335;&#30001;&#22120;&#20256;&#36755;&#30340;&#36825;&#27573;&#26102;&#38388;&#12290;&#20027;&#35201;&#20026;&#20197;&#19979;&#20004;&#20010;&#22240;&#32032;&#24433;&#21709;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-17" name=ref-footnote-17>17</A></SUP>&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#36755;&#20986;&#32531;&#23384;&#20013;&#24403;&#21069;&#27491;&#22312;&#25490;&#38431;&#30340;&#21253;&#30340;&#25968;&#30446;&#21644;&#38271;&#24230;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#36335;&#30001;&#22120;&#30340;&#20256;&#36755;&#36895;&#29575;&#65307;</FONT></LI></UL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#23454;&#38469;&#20013;&#25490;&#38431;&#24310;&#36831;&#30340;&#25968;&#37327;&#32423;&#22823;&#27010;&#22312;&#24494;&#31186;&#21644;&#27627;&#31186;&#20043;&#38388;</FONT></P>
<P><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#20256;&#36755;&#24310;&#36831;</FONT></STRONG></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#20256;&#36755;&#24310;&#36831;&#25351;&#30340;&#26159;&#23558;<U>&#25972;&#20010;&#21253;&#20013;&#30340;&#25152;&#26377;&#27604;&#29305;&#37117;&#21457;&#36865;&#21040;&#38142;&#36335;&#25152;&#29992;&#30340;&#26102;&#38388;</U></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#20256;&#36755;&#24310;&#36831;&#30340;&#25968;&#37327;&#32423;&#22823;&#27010;&#22312;&#24494;&#31186;&#21644;&#27627;&#31186;&#20043;&#38388;</FONT></P>
<P><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#20256;&#25773;&#24310;&#36831;</FONT></STRONG></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#20256;&#25773;&#24310;&#36831;&#25351;&#30340;&#26159;&#23558;&#25972;&#20010;&#21253;&#20013;&#30340;&#25152;&#26377; bit &#20256;&#36755;&#21040;&#21478;&#19968;&#20010;&#36335;&#30001;&#22120;&#25152;&#38656;&#35201;&#30340;&#26102;&#38388;&#65292;&#21462;&#20915;&#20110;&#38142;&#36335;&#25152;&#29992;&#30340;&#20256;&#36755;&#20171;&#36136;&#65292;&#24182;&#19981;&#21462;&#20915;&#20110;&#36335;&#30001;&#22120;&#30340;&#20256;&#36755;&#36895;&#29575;&#12290;&#20165;&#26377;&#24403;&#21253;&#20013;&#26368;&#21518;&#19968;&#20010; bit &#20063;&#21040;&#36798;&#30446;&#30340;&#22320;&#36335;&#30001;&#22120;&#20043;&#21518;&#65292;&#35813;&#36335;&#30001;&#22120;&#25165;&#20250;&#24320;&#22987;&#22788;&#29702;&#36825;&#20010;&#21253;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#19975;&#32500;&#32593;&#20013;&#30340;&#20256;&#25773;&#24310;&#36831;&#30340;&#25968;&#37327;&#32423;&#22823;&#27010;&#26159;&#24494;&#31186;</FONT></P>
<H3 id=&#25490;&#38431;&#24310;&#36831;&#21644;&#20002;&#21253;><FONT style="BACKGROUND-COLOR: #7be1e1">&#25490;&#38431;&#24310;&#36831;&#21644;&#20002;&#21253;</FONT></H3>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#36825;&#37096;&#20998;&#30340;&#20869;&#23481;&#19982;</FONT><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#&#25490;&#38431;&#24310;&#36831;&#20002;&#21253;"><FONT style="BACKGROUND-COLOR: #7be1e1">&#20043;&#21069;</FONT></A><FONT style="BACKGROUND-COLOR: #7be1e1">&#19981;&#21516;&#65292;&#20027;&#35201;&#25506;&#31350;&#30340;&#26159;&#21253;&#21040;&#36798;&#36895;&#29575;&#21644;&#21253;&#20256;&#36755;&#36895;&#29575;&#23545;&#25490;&#38431;&#24310;&#36831;&#30340;&#24433;&#21709;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#23558;<SPAN>&nbsp;</SPAN><MJX-CONTAINER class=MathJax jax="SVG"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="1.717ex" height="1.593ex" focusable="false" viewBox="0 -683 759 704" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-44-TEX-I-1D445 d="M230 637Q203 637 198 638T193 649Q193 676 204 682Q206 683 378 683Q550 682 564 680Q620 672 658 652T712 606T733 563T739 529Q739 484 710 445T643 385T576 351T538 338L545 333Q612 295 612 223Q612 212 607 162T602 80V71Q602 53 603 43T614 25T640 16Q668 16 686 38T712 85Q717 99 720 102T735 105Q755 105 755 93Q755 75 731 36Q693 -21 641 -21H632Q571 -21 531 4T487 82Q487 109 502 166T517 239Q517 290 474 313Q459 320 449 321T378 323H309L277 193Q244 61 244 59Q244 55 245 54T252 50T269 48T302 46H333Q339 38 339 37T336 19Q332 6 326 0H311Q275 2 180 2Q146 2 117 2T71 2T50 1Q33 1 33 10Q33 12 36 24Q41 43 46 45Q50 46 61 46H67Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628Q287 635 230 637ZM630 554Q630 586 609 608T523 636Q521 636 500 636T462 637H440Q393 637 386 627Q385 624 352 494T319 361Q319 360 388 360Q466 361 492 367Q556 377 592 426Q608 449 619 486T630 554Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D445" xlink:href="#MJX-44-TEX-I-1D445"><path id=MJX-44-TEX-I-1D445 d="M230 637Q203 637 198 638T193 649Q193 676 204 682Q206 683 378 683Q550 682 564 680Q620 672 658 652T712 606T733 563T739 529Q739 484 710 445T643 385T576 351T538 338L545 333Q612 295 612 223Q612 212 607 162T602 80V71Q602 53 603 43T614 25T640 16Q668 16 686 38T712 85Q717 99 720 102T735 105Q755 105 755 93Q755 75 731 36Q693 -21 641 -21H632Q571 -21 531 4T487 82Q487 109 502 166T517 239Q517 290 474 313Q459 320 449 321T378 323H309L277 193Q244 61 244 59Q244 55 245 54T252 50T269 48T302 46H333Q339 38 339 37T336 19Q332 6 326 0H311Q275 2 180 2Q146 2 117 2T71 2T50 1Q33 1 33 10Q33 12 36 24Q41 43 46 45Q50 46 61 46H67Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628Q287 635 230 637ZM630 554Q630 586 609 608T523 636Q521 636 500 636T462 637H440Q393 637 386 627Q385 624 352 494T319 361Q319 360 388 360Q466 361 492 367Q556 377 592 426Q608 449 619 486T630 554Z"></path></use></g></g></g></svg></MJX-CONTAINER><SPAN>&nbsp;</SPAN>&#35760;&#20026;&#20256;&#36755;&#36895;&#29575;&#65288;bits/sec&#65289;&#65292;&#23558;<SPAN>&nbsp;</SPAN><MJX-CONTAINER class=MathJax jax="SVG"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="1.197ex" height="1.02ex" focusable="false" viewBox="0 -441 529 451" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-34-TEX-I-1D44E d="M33 157Q33 258 109 349T280 441Q331 441 370 392Q386 422 416 422Q429 422 439 414T449 394Q449 381 412 234T374 68Q374 43 381 35T402 26Q411 27 422 35Q443 55 463 131Q469 151 473 152Q475 153 483 153H487Q506 153 506 144Q506 138 501 117T481 63T449 13Q436 0 417 -8Q409 -10 393 -10Q359 -10 336 5T306 36L300 51Q299 52 296 50Q294 48 292 46Q233 -10 172 -10Q117 -10 75 30T33 157ZM351 328Q351 334 346 350T323 385T277 405Q242 405 210 374T160 293Q131 214 119 129Q119 126 119 118T118 106Q118 61 136 44T179 26Q217 26 254 59T298 110Q300 114 325 217T351 328Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D44E" xlink:href="#MJX-34-TEX-I-1D44E"><path id=MJX-34-TEX-I-1D44E d="M33 157Q33 258 109 349T280 441Q331 441 370 392Q386 422 416 422Q429 422 439 414T449 394Q449 381 412 234T374 68Q374 43 381 35T402 26Q411 27 422 35Q443 55 463 131Q469 151 473 152Q475 153 483 153H487Q506 153 506 144Q506 138 501 117T481 63T449 13Q436 0 417 -8Q409 -10 393 -10Q359 -10 336 5T306 36L300 51Q299 52 296 50Q294 48 292 46Q233 -10 172 -10Q117 -10 75 30T33 157ZM351 328Q351 334 346 350T323 385T277 405Q242 405 210 374T160 293Q131 214 119 129Q119 126 119 118T118 106Q118 61 136 44T179 26Q217 26 254 59T298 110Q300 114 325 217T351 328Z"></path></use></g></g></g></svg></MJX-CONTAINER><SPAN>&nbsp;</SPAN>&#35760;&#20026;&#21253;&#24179;&#22343;&#21040;&#36798;&#36895;&#29575;&#65288;packets/sec&#65289;&#65292;&#23558;<SPAN>&nbsp;</SPAN><MJX-CONTAINER class=MathJax jax="SVG"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="1.541ex" height="1.545ex" focusable="false" viewBox="0 -683 681 683" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-43-TEX-I-1D43F d="M228 637Q194 637 192 641Q191 643 191 649Q191 673 202 682Q204 683 217 683Q271 680 344 680Q485 680 506 683H518Q524 677 524 674T522 656Q517 641 513 637H475Q406 636 394 628Q387 624 380 600T313 336Q297 271 279 198T252 88L243 52Q243 48 252 48T311 46H328Q360 46 379 47T428 54T478 72T522 106T564 161Q580 191 594 228T611 270Q616 273 628 273H641Q647 264 647 262T627 203T583 83T557 9Q555 4 553 3T537 0T494 -1Q483 -1 418 -1T294 0H116Q32 0 32 10Q32 17 34 24Q39 43 44 45Q48 46 59 46H65Q92 46 125 49Q139 52 144 61Q147 65 216 339T285 628Q285 635 228 637Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D43F" xlink:href="#MJX-43-TEX-I-1D43F"><path id=MJX-43-TEX-I-1D43F d="M228 637Q194 637 192 641Q191 643 191 649Q191 673 202 682Q204 683 217 683Q271 680 344 680Q485 680 506 683H518Q524 677 524 674T522 656Q517 641 513 637H475Q406 636 394 628Q387 624 380 600T313 336Q297 271 279 198T252 88L243 52Q243 48 252 48T311 46H328Q360 46 379 47T428 54T478 72T522 106T564 161Q580 191 594 228T611 270Q616 273 628 273H641Q647 264 647 262T627 203T583 83T557 9Q555 4 553 3T537 0T494 -1Q483 -1 418 -1T294 0H116Q32 0 32 10Q32 17 34 24Q39 43 44 45Q48 46 59 46H65Q92 46 125 49Q139 52 144 61Q147 65 216 339T285 628Q285 635 228 637Z"></path></use></g></g></g></svg></MJX-CONTAINER><SPAN>&nbsp;</SPAN>&#35760;&#20026;&#21253;&#30340;&#38271;&#24230;&#65288;bit&#65289;&#65307;&#30001;&#27492;&#65292;&#20415;&#21487;&#23558;<SPAN>&nbsp;</SPAN><MJX-CONTAINER class=MathJax jax="SVG"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="2.738ex" height="1.568ex" focusable="false" viewBox="0 -683 1210 693" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-36-TEX-I-1D43F d="M228 637Q194 637 192 641Q191 643 191 649Q191 673 202 682Q204 683 217 683Q271 680 344 680Q485 680 506 683H518Q524 677 524 674T522 656Q517 641 513 637H475Q406 636 394 628Q387 624 380 600T313 336Q297 271 279 198T252 88L243 52Q243 48 252 48T311 46H328Q360 46 379 47T428 54T478 72T522 106T564 161Q580 191 594 228T611 270Q616 273 628 273H641Q647 264 647 262T627 203T583 83T557 9Q555 4 553 3T537 0T494 -1Q483 -1 418 -1T294 0H116Q32 0 32 10Q32 17 34 24Q39 43 44 45Q48 46 59 46H65Q92 46 125 49Q139 52 144 61Q147 65 216 339T285 628Q285 635 228 637Z"></path><path id=MJX-36-TEX-I-1D44E d="M33 157Q33 258 109 349T280 441Q331 441 370 392Q386 422 416 422Q429 422 439 414T449 394Q449 381 412 234T374 68Q374 43 381 35T402 26Q411 27 422 35Q443 55 463 131Q469 151 473 152Q475 153 483 153H487Q506 153 506 144Q506 138 501 117T481 63T449 13Q436 0 417 -8Q409 -10 393 -10Q359 -10 336 5T306 36L300 51Q299 52 296 50Q294 48 292 46Q233 -10 172 -10Q117 -10 75 30T33 157ZM351 328Q351 334 346 350T323 385T277 405Q242 405 210 374T160 293Q131 214 119 129Q119 126 119 118T118 106Q118 61 136 44T179 26Q217 26 254 59T298 110Q300 114 325 217T351 328Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D43F" xlink:href="#MJX-36-TEX-I-1D43F"><path id=MJX-36-TEX-I-1D43F d="M228 637Q194 637 192 641Q191 643 191 649Q191 673 202 682Q204 683 217 683Q271 680 344 680Q485 680 506 683H518Q524 677 524 674T522 656Q517 641 513 637H475Q406 636 394 628Q387 624 380 600T313 336Q297 271 279 198T252 88L243 52Q243 48 252 48T311 46H328Q360 46 379 47T428 54T478 72T522 106T564 161Q580 191 594 228T611 270Q616 273 628 273H641Q647 264 647 262T627 203T583 83T557 9Q555 4 553 3T537 0T494 -1Q483 -1 418 -1T294 0H116Q32 0 32 10Q32 17 34 24Q39 43 44 45Q48 46 59 46H65Q92 46 125 49Q139 52 144 61Q147 65 216 339T285 628Q285 635 228 637Z"></path></use></g><g transform="translate(681,0)" data-mml-node="mi"><use data-c="1D44E" xlink:href="#MJX-36-TEX-I-1D44E"><path id=MJX-36-TEX-I-1D44E d="M33 157Q33 258 109 349T280 441Q331 441 370 392Q386 422 416 422Q429 422 439 414T449 394Q449 381 412 234T374 68Q374 43 381 35T402 26Q411 27 422 35Q443 55 463 131Q469 151 473 152Q475 153 483 153H487Q506 153 506 144Q506 138 501 117T481 63T449 13Q436 0 417 -8Q409 -10 393 -10Q359 -10 336 5T306 36L300 51Q299 52 296 50Q294 48 292 46Q233 -10 172 -10Q117 -10 75 30T33 157ZM351 328Q351 334 346 350T323 385T277 405Q242 405 210 374T160 293Q131 214 119 129Q119 126 119 118T118 106Q118 61 136 44T179 26Q217 26 254 59T298 110Q300 114 325 217T351 328Z"></path></use></g></g></g></svg></MJX-CONTAINER><SPAN>&nbsp;</SPAN>&#35760;&#20026;&#27599;&#31186;&#21040;&#36798;&#36335;&#30001;&#22120;&#30340;&#27604;&#29305;&#25968;&#30446;&#65292;<MJX-CONTAINER class=MathJax jax="SVG"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="5.586ex" height="2.262ex" focusable="false" viewBox="0 -750 2469 1000" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-37-TEX-I-1D43F d="M228 637Q194 637 192 641Q191 643 191 649Q191 673 202 682Q204 683 217 683Q271 680 344 680Q485 680 506 683H518Q524 677 524 674T522 656Q517 641 513 637H475Q406 636 394 628Q387 624 380 600T313 336Q297 271 279 198T252 88L243 52Q243 48 252 48T311 46H328Q360 46 379 47T428 54T478 72T522 106T564 161Q580 191 594 228T611 270Q616 273 628 273H641Q647 264 647 262T627 203T583 83T557 9Q555 4 553 3T537 0T494 -1Q483 -1 418 -1T294 0H116Q32 0 32 10Q32 17 34 24Q39 43 44 45Q48 46 59 46H65Q92 46 125 49Q139 52 144 61Q147 65 216 339T285 628Q285 635 228 637Z"></path><path id=MJX-37-TEX-I-1D44E d="M33 157Q33 258 109 349T280 441Q331 441 370 392Q386 422 416 422Q429 422 439 414T449 394Q449 381 412 234T374 68Q374 43 381 35T402 26Q411 27 422 35Q443 55 463 131Q469 151 473 152Q475 153 483 153H487Q506 153 506 144Q506 138 501 117T481 63T449 13Q436 0 417 -8Q409 -10 393 -10Q359 -10 336 5T306 36L300 51Q299 52 296 50Q294 48 292 46Q233 -10 172 -10Q117 -10 75 30T33 157ZM351 328Q351 334 346 350T323 385T277 405Q242 405 210 374T160 293Q131 214 119 129Q119 126 119 118T118 106Q118 61 136 44T179 26Q217 26 254 59T298 110Q300 114 325 217T351 328Z"></path><path id=MJX-37-TEX-N-2F d="M423 750Q432 750 438 744T444 730Q444 725 271 248T92 -240Q85 -250 75 -250Q68 -250 62 -245T56 -231Q56 -221 230 257T407 740Q411 750 423 750Z"></path><path id=MJX-37-TEX-I-1D445 d="M230 637Q203 637 198 638T193 649Q193 676 204 682Q206 683 378 683Q550 682 564 680Q620 672 658 652T712 606T733 563T739 529Q739 484 710 445T643 385T576 351T538 338L545 333Q612 295 612 223Q612 212 607 162T602 80V71Q602 53 603 43T614 25T640 16Q668 16 686 38T712 85Q717 99 720 102T735 105Q755 105 755 93Q755 75 731 36Q693 -21 641 -21H632Q571 -21 531 4T487 82Q487 109 502 166T517 239Q517 290 474 313Q459 320 449 321T378 323H309L277 193Q244 61 244 59Q244 55 245 54T252 50T269 48T302 46H333Q339 38 339 37T336 19Q332 6 326 0H311Q275 2 180 2Q146 2 117 2T71 2T50 1Q33 1 33 10Q33 12 36 24Q41 43 46 45Q50 46 61 46H67Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628Q287 635 230 637ZM630 554Q630 586 609 608T523 636Q521 636 500 636T462 637H440Q393 637 386 627Q385 624 352 494T319 361Q319 360 388 360Q466 361 492 367Q556 377 592 426Q608 449 619 486T630 554Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D43F" xlink:href="#MJX-37-TEX-I-1D43F"><path id=MJX-37-TEX-I-1D43F d="M228 637Q194 637 192 641Q191 643 191 649Q191 673 202 682Q204 683 217 683Q271 680 344 680Q485 680 506 683H518Q524 677 524 674T522 656Q517 641 513 637H475Q406 636 394 628Q387 624 380 600T313 336Q297 271 279 198T252 88L243 52Q243 48 252 48T311 46H328Q360 46 379 47T428 54T478 72T522 106T564 161Q580 191 594 228T611 270Q616 273 628 273H641Q647 264 647 262T627 203T583 83T557 9Q555 4 553 3T537 0T494 -1Q483 -1 418 -1T294 0H116Q32 0 32 10Q32 17 34 24Q39 43 44 45Q48 46 59 46H65Q92 46 125 49Q139 52 144 61Q147 65 216 339T285 628Q285 635 228 637Z"></path></use></g><g transform="translate(681,0)" data-mml-node="mi"><use data-c="1D44E" xlink:href="#MJX-37-TEX-I-1D44E"><path id=MJX-37-TEX-I-1D44E d="M33 157Q33 258 109 349T280 441Q331 441 370 392Q386 422 416 422Q429 422 439 414T449 394Q449 381 412 234T374 68Q374 43 381 35T402 26Q411 27 422 35Q443 55 463 131Q469 151 473 152Q475 153 483 153H487Q506 153 506 144Q506 138 501 117T481 63T449 13Q436 0 417 -8Q409 -10 393 -10Q359 -10 336 5T306 36L300 51Q299 52 296 50Q294 48 292 46Q233 -10 172 -10Q117 -10 75 30T33 157ZM351 328Q351 334 346 350T323 385T277 405Q242 405 210 374T160 293Q131 214 119 129Q119 126 119 118T118 106Q118 61 136 44T179 26Q217 26 254 59T298 110Q300 114 325 217T351 328Z"></path></use></g><g transform="translate(1210,0)" data-mml-node="TeXAtom" data-mjx-texclass="ORD"><g data-mml-node="mo"><use data-c="2F" xlink:href="#MJX-37-TEX-N-2F"><path id=MJX-37-TEX-N-2F d="M423 750Q432 750 438 744T444 730Q444 725 271 248T92 -240Q85 -250 75 -250Q68 -250 62 -245T56 -231Q56 -221 230 257T407 740Q411 750 423 750Z"></path></use></g></g><g transform="translate(1710,0)" data-mml-node="mi"><use data-c="1D445" xlink:href="#MJX-37-TEX-I-1D445"><path id=MJX-37-TEX-I-1D445 d="M230 637Q203 637 198 638T193 649Q193 676 204 682Q206 683 378 683Q550 682 564 680Q620 672 658 652T712 606T733 563T739 529Q739 484 710 445T643 385T576 351T538 338L545 333Q612 295 612 223Q612 212 607 162T602 80V71Q602 53 603 43T614 25T640 16Q668 16 686 38T712 85Q717 99 720 102T735 105Q755 105 755 93Q755 75 731 36Q693 -21 641 -21H632Q571 -21 531 4T487 82Q487 109 502 166T517 239Q517 290 474 313Q459 320 449 321T378 323H309L277 193Q244 61 244 59Q244 55 245 54T252 50T269 48T302 46H333Q339 38 339 37T336 19Q332 6 326 0H311Q275 2 180 2Q146 2 117 2T71 2T50 1Q33 1 33 10Q33 12 36 24Q41 43 46 45Q50 46 61 46H67Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628Q287 635 230 637ZM630 554Q630 586 609 608T523 636Q521 636 500 636T462 637H440Q393 637 386 627Q385 624 352 494T319 361Q319 360 388 360Q466 361 492 367Q556 377 592 426Q608 449 619 486T630 554Z"></path></use></g></g></g></svg></MJX-CONTAINER><SPAN>&nbsp;</SPAN>&#35760;&#20026;<STRONG>&#36890;&#20449;&#37327;&#24378;&#24230;</STRONG>&#65288;<EM>traffic intensity</EM>&#65289;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#22914;&#26524;<SPAN>&nbsp;</SPAN><MJX-CONTAINER class=MathJax jax="SVG"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="9.734ex" height="2.262ex" focusable="false" viewBox="0 -750 4302.6 1000" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-38-TEX-I-1D43F d="M228 637Q194 637 192 641Q191 643 191 649Q191 673 202 682Q204 683 217 683Q271 680 344 680Q485 680 506 683H518Q524 677 524 674T522 656Q517 641 513 637H475Q406 636 394 628Q387 624 380 600T313 336Q297 271 279 198T252 88L243 52Q243 48 252 48T311 46H328Q360 46 379 47T428 54T478 72T522 106T564 161Q580 191 594 228T611 270Q616 273 628 273H641Q647 264 647 262T627 203T583 83T557 9Q555 4 553 3T537 0T494 -1Q483 -1 418 -1T294 0H116Q32 0 32 10Q32 17 34 24Q39 43 44 45Q48 46 59 46H65Q92 46 125 49Q139 52 144 61Q147 65 216 339T285 628Q285 635 228 637Z"></path><path id=MJX-38-TEX-I-1D44E d="M33 157Q33 258 109 349T280 441Q331 441 370 392Q386 422 416 422Q429 422 439 414T449 394Q449 381 412 234T374 68Q374 43 381 35T402 26Q411 27 422 35Q443 55 463 131Q469 151 473 152Q475 153 483 153H487Q506 153 506 144Q506 138 501 117T481 63T449 13Q436 0 417 -8Q409 -10 393 -10Q359 -10 336 5T306 36L300 51Q299 52 296 50Q294 48 292 46Q233 -10 172 -10Q117 -10 75 30T33 157ZM351 328Q351 334 346 350T323 385T277 405Q242 405 210 374T160 293Q131 214 119 129Q119 126 119 118T118 106Q118 61 136 44T179 26Q217 26 254 59T298 110Q300 114 325 217T351 328Z"></path><path id=MJX-38-TEX-N-2F d="M423 750Q432 750 438 744T444 730Q444 725 271 248T92 -240Q85 -250 75 -250Q68 -250 62 -245T56 -231Q56 -221 230 257T407 740Q411 750 423 750Z"></path><path id=MJX-38-TEX-I-1D445 d="M230 637Q203 637 198 638T193 649Q193 676 204 682Q206 683 378 683Q550 682 564 680Q620 672 658 652T712 606T733 563T739 529Q739 484 710 445T643 385T576 351T538 338L545 333Q612 295 612 223Q612 212 607 162T602 80V71Q602 53 603 43T614 25T640 16Q668 16 686 38T712 85Q717 99 720 102T735 105Q755 105 755 93Q755 75 731 36Q693 -21 641 -21H632Q571 -21 531 4T487 82Q487 109 502 166T517 239Q517 290 474 313Q459 320 449 321T378 323H309L277 193Q244 61 244 59Q244 55 245 54T252 50T269 48T302 46H333Q339 38 339 37T336 19Q332 6 326 0H311Q275 2 180 2Q146 2 117 2T71 2T50 1Q33 1 33 10Q33 12 36 24Q41 43 46 45Q50 46 61 46H67Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628Q287 635 230 637ZM630 554Q630 586 609 608T523 636Q521 636 500 636T462 637H440Q393 637 386 627Q385 624 352 494T319 361Q319 360 388 360Q466 361 492 367Q556 377 592 426Q608 449 619 486T630 554Z"></path><path id=MJX-38-TEX-N-3E d="M84 520Q84 528 88 533T96 539L99 540Q106 540 253 471T544 334L687 265Q694 260 694 250T687 235Q685 233 395 96L107 -40H101Q83 -38 83 -20Q83 -19 83 -17Q82 -10 98 -1Q117 9 248 71Q326 108 378 132L626 250L378 368Q90 504 86 509Q84 513 84 520Z"></path><path id=MJX-38-TEX-N-31 d="M213 578L200 573Q186 568 160 563T102 556H83V602H102Q149 604 189 617T245 641T273 663Q275 666 285 666Q294 666 302 660V361L303 61Q310 54 315 52T339 48T401 46H427V0H416Q395 3 257 3Q121 3 100 0H88V46H114Q136 46 152 46T177 47T193 50T201 52T207 57T213 61V578Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D43F" xlink:href="#MJX-38-TEX-I-1D43F"><path id=MJX-38-TEX-I-1D43F d="M228 637Q194 637 192 641Q191 643 191 649Q191 673 202 682Q204 683 217 683Q271 680 344 680Q485 680 506 683H518Q524 677 524 674T522 656Q517 641 513 637H475Q406 636 394 628Q387 624 380 600T313 336Q297 271 279 198T252 88L243 52Q243 48 252 48T311 46H328Q360 46 379 47T428 54T478 72T522 106T564 161Q580 191 594 228T611 270Q616 273 628 273H641Q647 264 647 262T627 203T583 83T557 9Q555 4 553 3T537 0T494 -1Q483 -1 418 -1T294 0H116Q32 0 32 10Q32 17 34 24Q39 43 44 45Q48 46 59 46H65Q92 46 125 49Q139 52 144 61Q147 65 216 339T285 628Q285 635 228 637Z"></path></use></g><g transform="translate(681,0)" data-mml-node="mi"><use data-c="1D44E" xlink:href="#MJX-38-TEX-I-1D44E"><path id=MJX-38-TEX-I-1D44E d="M33 157Q33 258 109 349T280 441Q331 441 370 392Q386 422 416 422Q429 422 439 414T449 394Q449 381 412 234T374 68Q374 43 381 35T402 26Q411 27 422 35Q443 55 463 131Q469 151 473 152Q475 153 483 153H487Q506 153 506 144Q506 138 501 117T481 63T449 13Q436 0 417 -8Q409 -10 393 -10Q359 -10 336 5T306 36L300 51Q299 52 296 50Q294 48 292 46Q233 -10 172 -10Q117 -10 75 30T33 157ZM351 328Q351 334 346 350T323 385T277 405Q242 405 210 374T160 293Q131 214 119 129Q119 126 119 118T118 106Q118 61 136 44T179 26Q217 26 254 59T298 110Q300 114 325 217T351 328Z"></path></use></g><g transform="translate(1210,0)" data-mml-node="TeXAtom" data-mjx-texclass="ORD"><g data-mml-node="mo"><use data-c="2F" xlink:href="#MJX-38-TEX-N-2F"><path id=MJX-38-TEX-N-2F d="M423 750Q432 750 438 744T444 730Q444 725 271 248T92 -240Q85 -250 75 -250Q68 -250 62 -245T56 -231Q56 -221 230 257T407 740Q411 750 423 750Z"></path></use></g></g><g transform="translate(1710,0)" data-mml-node="mi"><use data-c="1D445" xlink:href="#MJX-38-TEX-I-1D445"><path id=MJX-38-TEX-I-1D445 d="M230 637Q203 637 198 638T193 649Q193 676 204 682Q206 683 378 683Q550 682 564 680Q620 672 658 652T712 606T733 563T739 529Q739 484 710 445T643 385T576 351T538 338L545 333Q612 295 612 223Q612 212 607 162T602 80V71Q602 53 603 43T614 25T640 16Q668 16 686 38T712 85Q717 99 720 102T735 105Q755 105 755 93Q755 75 731 36Q693 -21 641 -21H632Q571 -21 531 4T487 82Q487 109 502 166T517 239Q517 290 474 313Q459 320 449 321T378 323H309L277 193Q244 61 244 59Q244 55 245 54T252 50T269 48T302 46H333Q339 38 339 37T336 19Q332 6 326 0H311Q275 2 180 2Q146 2 117 2T71 2T50 1Q33 1 33 10Q33 12 36 24Q41 43 46 45Q50 46 61 46H67Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628Q287 635 230 637ZM630 554Q630 586 609 608T523 636Q521 636 500 636T462 637H440Q393 637 386 627Q385 624 352 494T319 361Q319 360 388 360Q466 361 492 367Q556 377 592 426Q608 449 619 486T630 554Z"></path></use></g><g transform="translate(2746.8,0)" data-mml-node="mo"><use data-c="3E" xlink:href="#MJX-38-TEX-N-3E"><path id=MJX-38-TEX-N-3E d="M84 520Q84 528 88 533T96 539L99 540Q106 540 253 471T544 334L687 265Q694 260 694 250T687 235Q685 233 395 96L107 -40H101Q83 -38 83 -20Q83 -19 83 -17Q82 -10 98 -1Q117 9 248 71Q326 108 378 132L626 250L378 368Q90 504 86 509Q84 513 84 520Z"></path></use></g><g transform="translate(3802.6,0)" data-mml-node="mn"><use data-c="31" xlink:href="#MJX-38-TEX-N-31"><path id=MJX-38-TEX-N-31 d="M213 578L200 573Q186 568 160 563T102 556H83V602H102Q149 604 189 617T245 641T273 663Q275 666 285 666Q294 666 302 660V361L303 61Q310 54 315 52T339 48T401 46H427V0H416Q395 3 257 3Q121 3 100 0H88V46H114Q136 46 152 46T177 47T193 50T201 52T207 57T213 61V578Z"></path></use></g></g></g></svg></MJX-CONTAINER><SPAN>&nbsp;</SPAN>&#65292;&#23548;&#33268;&#30340;&#32467;&#26524;&#23601;&#26159;&#36335;&#30001;&#22120;&#23436;&#20840;&#27809;&#26377;&#21150;&#27861;&#22788;&#29702;&#36825;&#20040;&#22810;&#25968;&#25454;&#65292;&#24179;&#22343;&#25490;&#38431;&#24310;&#36831;&#23558;&#36235;&#36817;&#20110;&#27491;&#26080;&#31351;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#37027;&#20040;&#65292;<MJX-CONTAINER class=MathJax jax="SVG"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="9.734ex" height="2.262ex" focusable="false" viewBox="0 -750 4302.6 1000" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-39-TEX-I-1D43F d="M228 637Q194 637 192 641Q191 643 191 649Q191 673 202 682Q204 683 217 683Q271 680 344 680Q485 680 506 683H518Q524 677 524 674T522 656Q517 641 513 637H475Q406 636 394 628Q387 624 380 600T313 336Q297 271 279 198T252 88L243 52Q243 48 252 48T311 46H328Q360 46 379 47T428 54T478 72T522 106T564 161Q580 191 594 228T611 270Q616 273 628 273H641Q647 264 647 262T627 203T583 83T557 9Q555 4 553 3T537 0T494 -1Q483 -1 418 -1T294 0H116Q32 0 32 10Q32 17 34 24Q39 43 44 45Q48 46 59 46H65Q92 46 125 49Q139 52 144 61Q147 65 216 339T285 628Q285 635 228 637Z"></path><path id=MJX-39-TEX-I-1D44E d="M33 157Q33 258 109 349T280 441Q331 441 370 392Q386 422 416 422Q429 422 439 414T449 394Q449 381 412 234T374 68Q374 43 381 35T402 26Q411 27 422 35Q443 55 463 131Q469 151 473 152Q475 153 483 153H487Q506 153 506 144Q506 138 501 117T481 63T449 13Q436 0 417 -8Q409 -10 393 -10Q359 -10 336 5T306 36L300 51Q299 52 296 50Q294 48 292 46Q233 -10 172 -10Q117 -10 75 30T33 157ZM351 328Q351 334 346 350T323 385T277 405Q242 405 210 374T160 293Q131 214 119 129Q119 126 119 118T118 106Q118 61 136 44T179 26Q217 26 254 59T298 110Q300 114 325 217T351 328Z"></path><path id=MJX-39-TEX-N-2F d="M423 750Q432 750 438 744T444 730Q444 725 271 248T92 -240Q85 -250 75 -250Q68 -250 62 -245T56 -231Q56 -221 230 257T407 740Q411 750 423 750Z"></path><path id=MJX-39-TEX-I-1D445 d="M230 637Q203 637 198 638T193 649Q193 676 204 682Q206 683 378 683Q550 682 564 680Q620 672 658 652T712 606T733 563T739 529Q739 484 710 445T643 385T576 351T538 338L545 333Q612 295 612 223Q612 212 607 162T602 80V71Q602 53 603 43T614 25T640 16Q668 16 686 38T712 85Q717 99 720 102T735 105Q755 105 755 93Q755 75 731 36Q693 -21 641 -21H632Q571 -21 531 4T487 82Q487 109 502 166T517 239Q517 290 474 313Q459 320 449 321T378 323H309L277 193Q244 61 244 59Q244 55 245 54T252 50T269 48T302 46H333Q339 38 339 37T336 19Q332 6 326 0H311Q275 2 180 2Q146 2 117 2T71 2T50 1Q33 1 33 10Q33 12 36 24Q41 43 46 45Q50 46 61 46H67Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628Q287 635 230 637ZM630 554Q630 586 609 608T523 636Q521 636 500 636T462 637H440Q393 637 386 627Q385 624 352 494T319 361Q319 360 388 360Q466 361 492 367Q556 377 592 426Q608 449 619 486T630 554Z"></path><path id=MJX-39-TEX-N-2264 d="M674 636Q682 636 688 630T694 615T687 601Q686 600 417 472L151 346L399 228Q687 92 691 87Q694 81 694 76Q694 58 676 56H670L382 192Q92 329 90 331Q83 336 83 348Q84 359 96 365Q104 369 382 500T665 634Q669 636 674 636ZM84 -118Q84 -108 99 -98H678Q694 -104 694 -118Q694 -130 679 -138H98Q84 -131 84 -118Z"></path><path id=MJX-39-TEX-N-31 d="M213 578L200 573Q186 568 160 563T102 556H83V602H102Q149 604 189 617T245 641T273 663Q275 666 285 666Q294 666 302 660V361L303 61Q310 54 315 52T339 48T401 46H427V0H416Q395 3 257 3Q121 3 100 0H88V46H114Q136 46 152 46T177 47T193 50T201 52T207 57T213 61V578Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D43F" xlink:href="#MJX-39-TEX-I-1D43F"><path id=MJX-39-TEX-I-1D43F d="M228 637Q194 637 192 641Q191 643 191 649Q191 673 202 682Q204 683 217 683Q271 680 344 680Q485 680 506 683H518Q524 677 524 674T522 656Q517 641 513 637H475Q406 636 394 628Q387 624 380 600T313 336Q297 271 279 198T252 88L243 52Q243 48 252 48T311 46H328Q360 46 379 47T428 54T478 72T522 106T564 161Q580 191 594 228T611 270Q616 273 628 273H641Q647 264 647 262T627 203T583 83T557 9Q555 4 553 3T537 0T494 -1Q483 -1 418 -1T294 0H116Q32 0 32 10Q32 17 34 24Q39 43 44 45Q48 46 59 46H65Q92 46 125 49Q139 52 144 61Q147 65 216 339T285 628Q285 635 228 637Z"></path></use></g><g transform="translate(681,0)" data-mml-node="mi"><use data-c="1D44E" xlink:href="#MJX-39-TEX-I-1D44E"><path id=MJX-39-TEX-I-1D44E d="M33 157Q33 258 109 349T280 441Q331 441 370 392Q386 422 416 422Q429 422 439 414T449 394Q449 381 412 234T374 68Q374 43 381 35T402 26Q411 27 422 35Q443 55 463 131Q469 151 473 152Q475 153 483 153H487Q506 153 506 144Q506 138 501 117T481 63T449 13Q436 0 417 -8Q409 -10 393 -10Q359 -10 336 5T306 36L300 51Q299 52 296 50Q294 48 292 46Q233 -10 172 -10Q117 -10 75 30T33 157ZM351 328Q351 334 346 350T323 385T277 405Q242 405 210 374T160 293Q131 214 119 129Q119 126 119 118T118 106Q118 61 136 44T179 26Q217 26 254 59T298 110Q300 114 325 217T351 328Z"></path></use></g><g transform="translate(1210,0)" data-mml-node="TeXAtom" data-mjx-texclass="ORD"><g data-mml-node="mo"><use data-c="2F" xlink:href="#MJX-39-TEX-N-2F"><path id=MJX-39-TEX-N-2F d="M423 750Q432 750 438 744T444 730Q444 725 271 248T92 -240Q85 -250 75 -250Q68 -250 62 -245T56 -231Q56 -221 230 257T407 740Q411 750 423 750Z"></path></use></g></g><g transform="translate(1710,0)" data-mml-node="mi"><use data-c="1D445" xlink:href="#MJX-39-TEX-I-1D445"><path id=MJX-39-TEX-I-1D445 d="M230 637Q203 637 198 638T193 649Q193 676 204 682Q206 683 378 683Q550 682 564 680Q620 672 658 652T712 606T733 563T739 529Q739 484 710 445T643 385T576 351T538 338L545 333Q612 295 612 223Q612 212 607 162T602 80V71Q602 53 603 43T614 25T640 16Q668 16 686 38T712 85Q717 99 720 102T735 105Q755 105 755 93Q755 75 731 36Q693 -21 641 -21H632Q571 -21 531 4T487 82Q487 109 502 166T517 239Q517 290 474 313Q459 320 449 321T378 323H309L277 193Q244 61 244 59Q244 55 245 54T252 50T269 48T302 46H333Q339 38 339 37T336 19Q332 6 326 0H311Q275 2 180 2Q146 2 117 2T71 2T50 1Q33 1 33 10Q33 12 36 24Q41 43 46 45Q50 46 61 46H67Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628Q287 635 230 637ZM630 554Q630 586 609 608T523 636Q521 636 500 636T462 637H440Q393 637 386 627Q385 624 352 494T319 361Q319 360 388 360Q466 361 492 367Q556 377 592 426Q608 449 619 486T630 554Z"></path></use></g><g transform="translate(2746.8,0)" data-mml-node="mo"><use data-c="2264" xlink:href="#MJX-39-TEX-N-2264"><path id=MJX-39-TEX-N-2264 d="M674 636Q682 636 688 630T694 615T687 601Q686 600 417 472L151 346L399 228Q687 92 691 87Q694 81 694 76Q694 58 676 56H670L382 192Q92 329 90 331Q83 336 83 348Q84 359 96 365Q104 369 382 500T665 634Q669 636 674 636ZM84 -118Q84 -108 99 -98H678Q694 -104 694 -118Q694 -130 679 -138H98Q84 -131 84 -118Z"></path></use></g><g transform="translate(3802.6,0)" data-mml-node="mn"><use data-c="31" xlink:href="#MJX-39-TEX-N-31"><path id=MJX-39-TEX-N-31 d="M213 578L200 573Q186 568 160 563T102 556H83V602H102Q149 604 189 617T245 641T273 663Q275 666 285 666Q294 666 302 660V361L303 61Q310 54 315 52T339 48T401 46H427V0H416Q395 3 257 3Q121 3 100 0H88V46H114Q136 46 152 46T177 47T193 50T201 52T207 57T213 61V578Z"></path></use></g></g></g></svg></MJX-CONTAINER><SPAN>&nbsp;</SPAN>&#23601;&#19975;&#20107;&#22823;&#21513;&#20102;&#21527;&#65292;&#24182;&#19981;&#26159;&#36825;&#26679;&#30340;&#12290;&#36825;&#22312;&#24456;&#22823;&#19968;&#37096;&#20998;&#31243;&#24230;&#19978;&#26159;&#30001;&#20110;&#23454;&#38469;&#19978;&#21253;&#21040;&#36798;&#30340;&#24773;&#20917;&#26159;<U>&#38543;&#26426;</U>&#30340;&#65292;&#36825;&#24448;&#24448;&#20250;&#23548;&#33268;&#24456;&#22810;&#26102;&#20505;&#21253;&#20250;&#36830;&#32493;&#19988;&#22823;&#37327;&#30340;&#21040;&#36798;&#38142;&#36335;&#65292;&#20351;&#20854;&#21464;&#24471;&#30456;&#24403;&#38271;&#65292;&#26377;&#26102;&#20505;&#21253;&#21040;&#36798;&#30340;&#36895;&#29575;&#21448;&#30456;&#24403;&#23567;&#65292;&#23548;&#33268;&#38431;&#21015;&#19968;&#19979;&#23376;&#32553;&#20943;&#65292;<U>&#20294;&#36825;&#20123;&#38382;&#39064;&#26159;&#24179;&#22343;&#20540;&#19981;&#33021;&#21453;&#26144;&#20986;&#26469;&#30340;</U>&#12290;&#22240;&#27492;&#65292;&#24403;&#36890;&#20449;&#37327;&#24378;&#24230;&#25509;&#36817;&#20110; 1 &#30340;&#26102;&#20505;&#65292;&#21253;&#30340;&#24179;&#22343;&#25490;&#38431;&#24310;&#36831;&#24448;&#24448;&#21576;&#29616;&#20986;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220306172144806 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220306172144806.png"></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#31616;&#21333;&#26469;&#35828;&#65292;<U>&#24403;&#36890;&#20449;&#37327;&#24378;&#24230;&#25509;&#36817;&#20110; 1 &#30340;&#26102;&#20505;&#65292;&#20854;&#22686;&#21152;&#19968;&#28857;&#28857;&#37117;&#20250;&#23548;&#33268;&#21253;&#30340;&#24179;&#22343;&#25490;&#38431;&#24310;&#36831;&#28608;&#22686;</U></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#24456;&#26174;&#28982;&#65292;&#24179;&#22343;&#25490;&#38431;&#24310;&#36831;&#30340;&#22686;&#38271;&#24448;&#24448;&#24847;&#21619;&#30528;&#20002;&#21253;&#21457;&#29983;&#30340;&#36234;&#26469;&#36234;&#39057;&#32321;</FONT></P>
<H3 id=&#31471;&#21040;&#31471;&#24310;&#36831;><FONT style="BACKGROUND-COLOR: #7be1e1">&#31471;&#21040;&#31471;&#24310;&#36831;</FONT></H3>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">Traceroute &#26159;&#19968;&#31181;&#27979;&#37327;&#20174;&#28304;&#20027;&#26426;&#21040;&#30446;&#26631;&#20027;&#26426;&#20043;&#38388;&#24635;&#24310;&#36831;&#30340;&#31243;&#24207;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#20351;&#29992;&#20027;&#26426;&#21517;&#35774;&#23450;&#30446;&#26631;&#20027;&#26426;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#27839;&#36335;&#19978;&#38656;&#35201;&#32463;&#36807;&#22810;&#23569;&#20010;&#36335;&#30001;&#22120;&#28304;&#20027;&#26426;&#23601;&#20250;&#21457;&#36865;&#22810;&#23569;&#20010;&#21253;&#65292;&#36825;&#20123;&#21253;&#20174; 1 &#21040; n &#32534;&#21495;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#24403;&#27839;&#36335;&#19978;&#30340;&#36335;&#30001;&#22120;&#25509;&#21463;&#21040;&#26576;&#20010;&#29305;&#23450;&#30340;&#21253;&#30340;&#26102;&#20505;&#65292;&#35813;&#36335;&#30001;&#22120;&#24182;&#19981;&#20250;&#32487;&#32493;&#23558;&#21253;&#20256;&#36882;&#19979;&#21435;&#65292;&#32780;&#26159;&#20250;&#23558;&#19968;&#26465;&#21253;&#21547;&#36335;&#30001;&#22120;&#21517;&#23383;&#21644;&#22320;&#22336;&#30340;&#28040;&#24687;&#20256;&#22238;&#21040;&#28304;&#20027;&#26426;&#20013;&#65307;</FONT></LI></UL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#22522;&#20110;&#27839;&#36335;&#19978;&#36820;&#22238;&#30340;&#20449;&#24687;&#65292;&#31243;&#24207;&#23601;&#33021;&#37325;&#26032;&#26500;&#24314;&#20986;&#20174;&#28304;&#20027;&#26426;&#21040;&#30446;&#26631;&#20027;&#26426;&#30340;<U>&#36335;&#30001;</U>&#65288;route&#65289;&#24182;&#30830;&#23450;&#24448;&#36820;&#26053;&#31243;&#30340;&#24310;&#36831;&#20449;&#24687;&#12290;&#19979;&#38754;&#26159;&#19968;&#27425;&#27979;&#37327;&#32467;&#26524;&#65288;&#26143;&#21495;&#34920;&#31034;&#33410;&#28857;&#26080;&#21709;&#24212;&#65289;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220306173226907 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220306173226907.png"></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#30001;&#20110;<U>&#25490;&#38431;&#24310;&#36831;&#38750;&#24120;&#19981;&#31283;&#23450;</U>&#65292;&#19981;&#21516;&#26102;&#38388;&#28857;&#30340;&#25490;&#38431;&#24310;&#36831;&#24448;&#24448;&#19981;&#30456;&#21516;&#12290;&#22240;&#27492;&#23613;&#31649;&#36335;&#30001;&#22120; 12 &#27604;&#36335;&#30001;&#22120; 11 &#31163;&#28304;&#20027;&#26426;&#30340;&#36317;&#31163;&#26356;&#36828;&#65292;&#20294;&#26159;&#30001;&#20110;&#25490;&#38431;&#24310;&#36831;&#30340;&#21407;&#22240;&#65292;&#36335;&#30001;&#22120; 12 &#30340;&#24448;&#36820;&#24310;&#36831;&#21364;&#27604;&#36335;&#30001;&#22120; 11 &#26356;&#23567;</FONT></P>
<H3 id=&#21534;&#21520;&#37327;><FONT style="BACKGROUND-COLOR: #7be1e1">&#21534;&#21520;&#37327;</FONT></H3>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#21534;&#21520;&#37327;</U>&#65288;<EM>through</EM>&#65289;&#23454;&#38469;&#19978;&#26377;&#20004;&#31181;&#23450;&#20041;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><STRONG>&#30636;&#38388;&#21534;&#21520;&#37327;</STRONG>&#65288;<EM>instantaneous throughput</EM>&#65289;&#65306;&#30636;&#38388;&#21534;&#21520;&#37327;&#26159;&#20027;&#26426; B &#25509;&#21463;&#25968;&#25454;&#30340;&#36895;&#29575;&#65288;bit/s&#65289;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><STRONG>&#24179;&#22343;&#21534;&#21520;&#37327;</STRONG>&#65288;<EM>average throughput</EM>&#65289;&#65306;&#22914;&#26524;&#23558;&#22823;&#23567;&#20026;<SPAN>&nbsp;</SPAN><MJX-CONTAINER class=MathJax jax="SVG"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="1.695ex" height="1.538ex" focusable="false" viewBox="0 -680 749 680" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-40-TEX-I-1D439 d="M48 1Q31 1 31 11Q31 13 34 25Q38 41 42 43T65 46Q92 46 125 49Q139 52 144 61Q146 66 215 342T285 622Q285 629 281 629Q273 632 228 634H197Q191 640 191 642T193 659Q197 676 203 680H742Q749 676 749 669Q749 664 736 557T722 447Q720 440 702 440H690Q683 445 683 453Q683 454 686 477T689 530Q689 560 682 579T663 610T626 626T575 633T503 634H480Q398 633 393 631Q388 629 386 623Q385 622 352 492L320 363H375Q378 363 398 363T426 364T448 367T472 374T489 386Q502 398 511 419T524 457T529 475Q532 480 548 480H560Q567 475 567 470Q567 467 536 339T502 207Q500 200 482 200H470Q463 206 463 212Q463 215 468 234T473 274Q473 303 453 310T364 317H309L277 190Q245 66 245 60Q245 46 334 46H359Q365 40 365 39T363 19Q359 6 353 0H336Q295 2 185 2Q120 2 86 2T48 1Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D439" xlink:href="#MJX-40-TEX-I-1D439"><path id=MJX-40-TEX-I-1D439 d="M48 1Q31 1 31 11Q31 13 34 25Q38 41 42 43T65 46Q92 46 125 49Q139 52 144 61Q146 66 215 342T285 622Q285 629 281 629Q273 632 228 634H197Q191 640 191 642T193 659Q197 676 203 680H742Q749 676 749 669Q749 664 736 557T722 447Q720 440 702 440H690Q683 445 683 453Q683 454 686 477T689 530Q689 560 682 579T663 610T626 626T575 633T503 634H480Q398 633 393 631Q388 629 386 623Q385 622 352 492L320 363H375Q378 363 398 363T426 364T448 367T472 374T489 386Q502 398 511 419T524 457T529 475Q532 480 548 480H560Q567 475 567 470Q567 467 536 339T502 207Q500 200 482 200H470Q463 206 463 212Q463 215 468 234T473 274Q473 303 453 310T364 317H309L277 190Q245 66 245 60Q245 46 334 46H359Q365 40 365 39T363 19Q359 6 353 0H336Q295 2 185 2Q120 2 86 2T48 1Z"></path></use></g></g></g></svg></MJX-CONTAINER><SPAN>&nbsp;</SPAN>&#20010; bit &#30340;&#25991;&#20214;&#20174; A &#21457;&#36865;&#21040; B &#38656;&#35201;&#29992;<SPAN>&nbsp;</SPAN><MJX-CONTAINER class=MathJax jax="SVG"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="1.593ex" height="1.532ex" focusable="false" viewBox="0 -677 704 677" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-41-TEX-I-1D447 d="M40 437Q21 437 21 445Q21 450 37 501T71 602L88 651Q93 669 101 677H569H659Q691 677 697 676T704 667Q704 661 687 553T668 444Q668 437 649 437Q640 437 637 437T631 442L629 445Q629 451 635 490T641 551Q641 586 628 604T573 629Q568 630 515 631Q469 631 457 630T439 622Q438 621 368 343T298 60Q298 48 386 46Q418 46 427 45T436 36Q436 31 433 22Q429 4 424 1L422 0Q419 0 415 0Q410 0 363 1T228 2Q99 2 64 0H49Q43 6 43 9T45 27Q49 40 55 46H83H94Q174 46 189 55Q190 56 191 56Q196 59 201 76T241 233Q258 301 269 344Q339 619 339 625Q339 630 310 630H279Q212 630 191 624Q146 614 121 583T67 467Q60 445 57 441T43 437H40Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D447" xlink:href="#MJX-41-TEX-I-1D447"><path id=MJX-41-TEX-I-1D447 d="M40 437Q21 437 21 445Q21 450 37 501T71 602L88 651Q93 669 101 677H569H659Q691 677 697 676T704 667Q704 661 687 553T668 444Q668 437 649 437Q640 437 637 437T631 442L629 445Q629 451 635 490T641 551Q641 586 628 604T573 629Q568 630 515 631Q469 631 457 630T439 622Q438 621 368 343T298 60Q298 48 386 46Q418 46 427 45T436 36Q436 31 433 22Q429 4 424 1L422 0Q419 0 415 0Q410 0 363 1T228 2Q99 2 64 0H49Q43 6 43 9T45 27Q49 40 55 46H83H94Q174 46 189 55Q190 56 191 56Q196 59 201 76T241 233Q258 301 269 344Q339 619 339 625Q339 630 310 630H279Q212 630 191 624Q146 614 121 583T67 467Q60 445 57 441T43 437H40Z"></path></use></g></g></g></svg></MJX-CONTAINER><SPAN>&nbsp;</SPAN>&#31186;&#65292;&#37027;&#20040;&#36825;&#27573;&#26102;&#38388;&#30340;&#24179;&#22343;&#21534;&#21520;&#37327;&#23601;&#20026;<SPAN>&nbsp;</SPAN><MJX-CONTAINER class=MathJax jax="SVG"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="4.419ex" height="2.262ex" focusable="false" viewBox="0 -750 1953 1000" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-42-TEX-I-1D439 d="M48 1Q31 1 31 11Q31 13 34 25Q38 41 42 43T65 46Q92 46 125 49Q139 52 144 61Q146 66 215 342T285 622Q285 629 281 629Q273 632 228 634H197Q191 640 191 642T193 659Q197 676 203 680H742Q749 676 749 669Q749 664 736 557T722 447Q720 440 702 440H690Q683 445 683 453Q683 454 686 477T689 530Q689 560 682 579T663 610T626 626T575 633T503 634H480Q398 633 393 631Q388 629 386 623Q385 622 352 492L320 363H375Q378 363 398 363T426 364T448 367T472 374T489 386Q502 398 511 419T524 457T529 475Q532 480 548 480H560Q567 475 567 470Q567 467 536 339T502 207Q500 200 482 200H470Q463 206 463 212Q463 215 468 234T473 274Q473 303 453 310T364 317H309L277 190Q245 66 245 60Q245 46 334 46H359Q365 40 365 39T363 19Q359 6 353 0H336Q295 2 185 2Q120 2 86 2T48 1Z"></path><path id=MJX-42-TEX-N-2F d="M423 750Q432 750 438 744T444 730Q444 725 271 248T92 -240Q85 -250 75 -250Q68 -250 62 -245T56 -231Q56 -221 230 257T407 740Q411 750 423 750Z"></path><path id=MJX-42-TEX-I-1D447 d="M40 437Q21 437 21 445Q21 450 37 501T71 602L88 651Q93 669 101 677H569H659Q691 677 697 676T704 667Q704 661 687 553T668 444Q668 437 649 437Q640 437 637 437T631 442L629 445Q629 451 635 490T641 551Q641 586 628 604T573 629Q568 630 515 631Q469 631 457 630T439 622Q438 621 368 343T298 60Q298 48 386 46Q418 46 427 45T436 36Q436 31 433 22Q429 4 424 1L422 0Q419 0 415 0Q410 0 363 1T228 2Q99 2 64 0H49Q43 6 43 9T45 27Q49 40 55 46H83H94Q174 46 189 55Q190 56 191 56Q196 59 201 76T241 233Q258 301 269 344Q339 619 339 625Q339 630 310 630H279Q212 630 191 624Q146 614 121 583T67 467Q60 445 57 441T43 437H40Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D439" xlink:href="#MJX-42-TEX-I-1D439"><path id=MJX-42-TEX-I-1D439 d="M48 1Q31 1 31 11Q31 13 34 25Q38 41 42 43T65 46Q92 46 125 49Q139 52 144 61Q146 66 215 342T285 622Q285 629 281 629Q273 632 228 634H197Q191 640 191 642T193 659Q197 676 203 680H742Q749 676 749 669Q749 664 736 557T722 447Q720 440 702 440H690Q683 445 683 453Q683 454 686 477T689 530Q689 560 682 579T663 610T626 626T575 633T503 634H480Q398 633 393 631Q388 629 386 623Q385 622 352 492L320 363H375Q378 363 398 363T426 364T448 367T472 374T489 386Q502 398 511 419T524 457T529 475Q532 480 548 480H560Q567 475 567 470Q567 467 536 339T502 207Q500 200 482 200H470Q463 206 463 212Q463 215 468 234T473 274Q473 303 453 310T364 317H309L277 190Q245 66 245 60Q245 46 334 46H359Q365 40 365 39T363 19Q359 6 353 0H336Q295 2 185 2Q120 2 86 2T48 1Z"></path></use></g><g transform="translate(749,0)" data-mml-node="TeXAtom" data-mjx-texclass="ORD"><g data-mml-node="mo"><use data-c="2F" xlink:href="#MJX-42-TEX-N-2F"><path id=MJX-42-TEX-N-2F d="M423 750Q432 750 438 744T444 730Q444 725 271 248T92 -240Q85 -250 75 -250Q68 -250 62 -245T56 -231Q56 -221 230 257T407 740Q411 750 423 750Z"></path></use></g></g><g transform="translate(1249,0)" data-mml-node="mi"><use data-c="1D447" xlink:href="#MJX-42-TEX-I-1D447"><path id=MJX-42-TEX-I-1D447 d="M40 437Q21 437 21 445Q21 450 37 501T71 602L88 651Q93 669 101 677H569H659Q691 677 697 676T704 667Q704 661 687 553T668 444Q668 437 649 437Q640 437 637 437T631 442L629 445Q629 451 635 490T641 551Q641 586 628 604T573 629Q568 630 515 631Q469 631 457 630T439 622Q438 621 368 343T298 60Q298 48 386 46Q418 46 427 45T436 36Q436 31 433 22Q429 4 424 1L422 0Q419 0 415 0Q410 0 363 1T228 2Q99 2 64 0H49Q43 6 43 9T45 27Q49 40 55 46H83H94Q174 46 189 55Q190 56 191 56Q196 59 201 76T241 233Q258 301 269 344Q339 619 339 625Q339 630 310 630H279Q212 630 191 624Q146 614 121 583T67 467Q60 445 57 441T43 437H40Z"></path></use></g></g></g></svg></MJX-CONTAINER>&#65307;</FONT></LI></UL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#19968;&#33324;&#24773;&#20917;&#19979;&#37117;&#26159;&#20351;&#29992;&#24179;&#22343;&#21534;&#21520;&#37327;&#20316;&#20026;&#34913;&#37327;&#25351;&#26631;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#32771;&#34385;&#36825;&#26679;&#19968;&#20010;&#38382;&#39064;&#65292;&#22312;&#27809;&#26377;&#25317;&#22622;&#30340;&#24773;&#20917;&#19979;&#65292;&#31995;&#32479;&#30340;&#25972;&#20307;&#21534;&#21520;&#37327;&#30001;&#35841;&#26469;&#20915;&#23450;&#65311;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#31616;&#21333;&#26469;&#35828;&#65292;<STRONG>&#29942;&#39048;&#38142;&#36335;</STRONG>&#65288;<EM>bottleneck link</EM>&#65289;&#30340;&#21534;&#21520;&#37327;&#20915;&#23450;&#20102;&#31995;&#32479;&#30340;&#25972;&#20307;&#21534;&#21520;&#37327;&#12290;&#24403;&#31995;&#32479;&#20013;&#19981;&#23384;&#22312;&#27969;&#37327;&#20849;&#20139;&#30340;&#26102;&#20505;&#65292;&#29942;&#39048;&#38142;&#36335;&#23601;&#26159;&#21534;&#21520;&#37327;&#26368;&#23567;&#30340;&#38142;&#36335;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220306182541940 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220306182541940.png"></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#20294;&#26159;&#22914;&#26524;&#26377;&#22810;&#20010;&#38142;&#25509;&#20849;&#20139;&#21516;&#19968;&#26465;&#20027;&#24178;&#32593;&#38142;&#36335;&#65292;&#23613;&#31649;&#20027;&#24178;&#32593;&#30340;&#21534;&#21520;&#37327;&#36828;&#22823;&#20110;&#25509;&#20837;&#32593;&#30340;&#21534;&#21520;&#37327;&#65292;&#21534;&#21520;&#37327;&#29942;&#39048;&#23601;&#19981;&#19968;&#23450;&#26159;&#21534;&#21520;&#37327;&#26368;&#23567;&#30340;&#38142;&#36335;&#20102;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220306182707243 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220306182707243.png"></FONT></P>
<H2 id=&#32593;&#32476;&#20998;&#23618;><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#20998;&#23618;</FONT></H2>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#20026;&#20351;&#32593;&#32476;&#21327;&#35758;&#20197;&#32467;&#26500;&#21270;&#30340;&#24418;&#24335;&#32452;&#32455;&#65292;&#32593;&#32476;&#35774;&#35745;&#32773;&#20250;&#23558;&#36825;&#20123;&#21327;&#35758;&#65288;&#20197;&#21450;&#23454;&#29616;&#36825;&#20123;&#21327;&#35758;&#30340;&#36719;&#20214;&#21644;&#30828;&#20214;&#65289;&#20197;&#21327;&#35758;<STRONG>&#23618;</STRONG>&#65288;<EM>layer</EM>&#65289;&#30340;&#26041;&#24335;&#32452;&#32455;&#36215;&#26469;&#65292;&#24182;&#20351;&#27599;&#20010;&#21327;&#35758;&#37117;&#23646;&#20110;&#29305;&#23450;&#30340;&#19968;&#23618;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#22914;&#26524;&#24819;&#35201;&#20197;&#23618;&#32423;&#32467;&#26500;&#30340;&#26041;&#24335;&#30475;&#24453;&#25972;&#20010;&#32593;&#32476;&#30340;&#35805;&#65292;&#25105;&#20204;&#19981;&#22952;&#20808;&#32473;&#20986;&#20004;&#20010;&#23450;&#20041;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><STRONG>&#26381;&#21153;</STRONG>&#65288;<EM>service</EM>&#65289;&#26159;&#26576;&#19968;&#23618;&#25552;&#20379;&#32473;&#19978;&#19968;&#23618;&#30340;&#21151;&#33021;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#26576;&#19968;&#23618;&#30340;<STRONG>&#26381;&#21153;&#27169;&#24335;</STRONG>&#65288;<EM>service model</EM>&#65289;&#20063;&#23601;&#26159;&#19978;&#36848;&#23450;&#20041;&#30340;&#31616;&#31216;&#65307;</FONT></LI></UL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#37027;&#20040;&#65292;&#27599;&#19968;&#23618;&#31350;&#31455;&#35201;&#22914;&#20309;&#25552;&#20379;&#29305;&#23450;&#30340;&#26381;&#21153;&#21602;&#65311;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#22312;&#26412;&#23618;&#20013;&#25191;&#34892;&#29305;&#23450;&#30340;&#21151;&#33021;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#30452;&#25509;&#20351;&#29992;&#19979;&#19968;&#23618;&#25152;&#25552;&#20379;&#30340;&#26381;&#21153;&#65307;</FONT></LI></UL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#21327;&#35758;&#23618;&#36824;&#20855;&#26377;&#20004;&#20010;&#29305;&#28857;&#65306;</FONT></P>
<OL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#21327;&#35758;&#23618;&#26082;&#33021;&#34987;&#36719;&#20214;&#23454;&#29616;&#65292;&#20063;&#33021;&#34987;&#30828;&#20214;&#23454;&#29616;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#21508;&#21327;&#35758;&#23618;&#24182;&#38750;&#20840;&#37096;&#20301;&#20110;&#26576;&#20010;&#20027;&#26426;&#19978;&#25110;&#32773;&#35828;&#21253;&#20132;&#25442;&#26426;&#19978;&#65292;&#32780;&#26159;&#20998;&#25955;&#30340;&#20301;&#20110;&#19981;&#21516;&#20027;&#26426;&#12289;&#21253;&#20132;&#25442;&#26426;&#12289;&#29483;&#31561;&#21508;&#31181;&#21508;&#26679;&#30340;&#32593;&#32476;&#29289;&#29702;&#32452;&#20214;&#19978;&#65307;</FONT></LI></OL>
<H3 id=&#20877;&#35848;&#21327;&#35758;><FONT style="BACKGROUND-COLOR: #7be1e1">&#20877;&#35848;&#21327;&#35758;</FONT></H3>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#19978;&#30340;<U>&#23454;&#20307;</U>&#65288;<EM>entity</EM>&#65289;&#25351;&#30340;&#26159;&#20219;&#24847;&#20004;&#20010;&#33021;&#22815;&#36827;&#34892;&#36890;&#20449;&#30340;&#36719;&#20214;&#25110;&#30828;&#20214;&#36827;&#31243;&#12290;<U>&#21327;&#35758;</U>&#65288;<EM>protocol</EM>&#65289;&#21017;&#23450;&#20041;&#20102;&#32593;&#32476;&#19978;&#20219;&#24847;&#20004;&#20010;&#23545;&#31561;&#23454;&#20307;&#20043;&#38388;&#65292;&#25152;&#25910;&#21457;&#20449;&#24687;&#30340;&#26684;&#24335;&#21644;&#39034;&#24207;&#65292;&#20197;&#21450;&#25509;&#21463;&#21644;&#20256;&#36755;&#20449;&#24687;&#26102;&#24212;&#24403;&#25191;&#34892;&#30340;&#21160;&#20316;&#25110;&#32773;&#24212;&#24403;&#21457;&#29983;&#30340;&#20107;&#20214;&#12290;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#22312;&#21327;&#35758;&#30340;&#25511;&#21046;&#19979;&#65292;&#20004;&#20010;&#23545;&#31561;&#23454;&#20307;&#38388;&#30340;&#36890;&#20449;&#26368;&#32456;&#33021;&#25104;&#20026;&#25552;&#20379;&#32473;&#19978;&#23618;&#30340;&#26381;&#21153;&#12290;&#26356;&#30830;&#20999;&#30340;&#35762;&#65292;&#19978;&#23618;&#21482;&#33021;&#30475;&#35265;&#19979;&#23618;&#25552;&#20379;&#30340;&#26381;&#21153;&#32780;&#19981;&#33021;&#30475;&#35265;&#19979;&#23618;&#25152;&#29992;&#30340;&#21327;&#35758;&#65288;<U>&#26381;&#21153;&#26159;&#22402;&#30452;&#30340;&#65292;&#21327;&#35758;&#26159;&#27700;&#24179;&#30340;</U>&#65289;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#26381;&#21153;&#35775;&#38382;&#28857;&#65288;SAP&#65289;&#26159;&#19978;&#19979;&#23618;&#20132;&#20114;&#30340;&#22320;&#26041;&#65292;&#19978;&#19979;&#23618;&#36890;&#36807;&#20132;&#25442;&#21407;&#35821;&#36827;&#34892;&#36890;&#20449;&#65288;&#19981;&#28041;&#21450;&#21040;&#32593;&#32476;&#36890;&#20449;&#65292;&#30001;&#25805;&#20316;&#31995;&#32479;&#36827;&#34892;&#31649;&#29702;&#65289;&#65292;&#32780;&#30456;&#37051;&#23618;&#20043;&#38388;&#30340;&#23454;&#20307;&#36890;&#20449;&#38656;&#35201;&#20511;&#21161;&#32593;&#32476;&#36827;&#34892;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#21327;&#35758;&#24517;&#39035;&#23558;&#25152;&#26377;&#19981;&#21033;&#30340;&#26465;&#20214;&#37117;&#20107;&#20808;&#20272;&#35745;&#21040;&#65292;&#19981;&#33021;&#20551;&#23450;&#19968;&#20999;&#37117;&#26159;&#27491;&#24120;&#30340;&#65292;&#19981;&#33021;&#20551;&#35774;&#19968;&#20999;&#37117;&#26159;&#27491;&#24120;&#21644;&#38750;&#24120;&#29702;&#24819;&#30340;&#65292;&#20063;&#23601;&#26159;&#38656;&#35201;&#20180;&#32454;&#26816;&#27979;&#21327;&#35758;&#26159;&#21542;&#33021;&#24212;&#20184;&#21508;&#31181;&#24322;&#24120;&#21327;&#35758;</FONT></P>
<H3 id=&#32593;&#32476;&#21327;&#35758;&#26632;><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#21327;&#35758;&#26632;</FONT></H3>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#32593;&#32476;&#21327;&#35758;&#26632;</U>&#65288;<EM>protocol stack</EM>&#65289;&#20316;&#20026;&#21508;&#21327;&#35758;&#23618;&#24418;&#25104;&#30340;&#23618;&#27425;&#32467;&#26500;&#65292;&#22823;&#33268;&#21576;&#29616;&#22914;&#19979;&#24418;&#24335;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220306183020574 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220306183020574.png"></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#21508;&#23618;&#30340;&#20316;&#29992;&#22522;&#26412;&#21487;&#24402;&#32467;&#20026;&#65306;</FONT></P>
<UL>
<LI>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#24212;&#29992;&#23618;&#65306;&#23558;&#29992;&#25143;&#20135;&#29983;&#30340;&#25968;&#25454;&#25171;&#21253;&#25104;&#28040;&#24687;&#24182;&#21457;&#36865;&#21040;&#20256;&#36755;&#23618;&#65307;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#38024;&#23545;&#19968;&#31867;&#20855;&#20307;&#24212;&#29992;&#25552;&#20379;&#30340;&#21327;&#35758;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">FTP&#65292;SMTP&#65292;HTTP&#65307;</FONT></LI></UL>
<LI>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#20256;&#36755;&#23618;&#65306;&#20351;&#29992; TCP/UCP &#21327;&#35758;&#25511;&#21046;&#25968;&#25454;&#20256;&#36755;&#30340;&#36895;&#24230;&#31561;&#21508;&#31181;&#21508;&#26679;&#30340;&#21442;&#25968;&#65292;&#20174;&#32780;&#25552;&#39640;&#32593;&#32476;&#30340;&#21487;&#20381;&#36182;&#24615;&#65307;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#20027;&#26426;&#21040;&#20027;&#26426;&#65292;&#31471;&#21475;&#21040;&#31471;&#21475;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">TCP&#65292;UDP&#65307;</FONT></LI></UL>
<LI>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#23618;&#65306;&#20351;&#29992; IP &#21327;&#35758;&#20026;&#25968;&#25454;&#28155;&#21152;&#19968;&#20123;&#20803;&#20449;&#24687;&#65292;&#24182;&#20351;&#29992;&#36335;&#30001;&#21327;&#35758;&#35268;&#21010;&#36335;&#30001;&#65307;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#28304;&#33410;&#28857;&#21040;&#30446;&#26631;&#33410;&#28857;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">IP&#65292;&#36335;&#30001;&#21327;&#35758;&#65307;</FONT></LI></UL>
<LI>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#38142;&#36335;&#23618;&#65306;&#26681;&#25454;&#25968;&#25454;&#21253;&#23545;&#24212;&#38142;&#36335;&#30340;&#31867;&#22411;&#65292;&#30830;&#23450;&#20351;&#29992;&#20309;&#31181;&#21327;&#35758;&#20256;&#36755;&#25968;&#25454;&#21253;&#65307;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#30456;&#37051;&#33410;&#28857;&#20043;&#38388;&#30340;&#36890;&#20449;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">PPP&#65292;Ethernet&#65307;</FONT></LI></UL>
<LI>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#29289;&#29702;&#23618;&#65306;&#26681;&#25454;&#38142;&#36335;&#30340;&#29289;&#29702;&#23186;&#20171;&#65292;&#36873;&#25321;&#30456;&#24212;&#30340;&#20256;&#36755;&#21327;&#35758;&#65307;</FONT></P></LI></UL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#26412;&#36136;&#19978;&#65292;&#32593;&#32476;&#21457;&#36865;&#25968;&#25454;&#30340;&#36807;&#31243;&#23454;&#38469;&#19978;&#26159;&#19968;&#20010;&#19981;&#26029;&#23558;&#25968;&#25454;&#23553;&#35013;&#24182;&#21152;&#20197;&#20256;&#36755;&#30340;&#36807;&#31243;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-18" name=ref-footnote-18>18</A></SUP>&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#24212;&#29992;&#23618;&#23558;&#28040;&#24687;&#20256;&#36882;&#32473;&#20256;&#36755;&#23618;&#65292;&#21363;&#25152;&#35859;<STRONG>&#24212;&#29992;&#23618;&#28040;&#24687;</STRONG>&#65288;<EM>application-layer message</EM>&#65289;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#20256;&#36755;&#23618;&#23545;&#28040;&#24687;&#36827;&#34892;&#23553;&#35013;&#24182;&#22312;&#20854;&#19978;&#28155;&#21152;&#39069;&#22806;&#30340;&#20449;&#24687;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-19" name=ref-footnote-19>19</A></SUP>&#65292;&#29983;&#25104;<STRONG>&#20256;&#36755;&#23618;&#27573;</STRONG>&#65288;<EM>transport-layer segment</EM>&#65289;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#23618;&#20250;&#23558;&#27573;&#21152;&#20197;&#23553;&#35013;&#65292;&#21516;&#26102;&#20063;&#22312;&#20854;&#20013;&#28155;&#21152;&#39069;&#22806;&#30340;&#25968;&#25454;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-20" name=ref-footnote-20>20</A></SUP>&#65292;&#29983;&#25104;<STRONG>&#32593;&#32476;&#23618;&#25968;&#25454;&#25253;</STRONG>&#65288;<EM>network-layer datagram</EM>&#65289;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#38142;&#36335;&#23618;&#20063;&#20250;&#23558;&#39069;&#22806;&#30340;&#25968;&#25454;&#28155;&#21152;&#36827;&#21435;&#24182;&#29983;&#25104;<STRONG>&#38142;&#25509;&#23618;&#24103;</STRONG>&#65288;<EM>link-layer frame</EM>&#65289;&#65307;</FONT></LI></UL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#24635;&#30340;&#26469;&#35828;&#65292;&#27599;&#23618;&#21253;&#37117;&#30001;&#20197;&#19979;&#20004;&#20010;&#37096;&#20998;&#32452;&#25104;&#65306;<EM>header field</EM><SPAN>&nbsp;</SPAN>&#21644;<SPAN>&nbsp;</SPAN><EM>payload field</EM>&#65288;&#21518;&#32773;&#23601;&#26159;&#20174;&#19978;&#23618;&#25509;&#21463;&#21040;&#30340;&#25968;&#25454;&#21253;&#65289;</FONT></P>
<H4 id=&#24212;&#29992;&#23618;><FONT style="BACKGROUND-COLOR: #7be1e1">&#24212;&#29992;&#23618;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#24212;&#29992;&#23618;</U>&#65288;<EM>application layer</EM>&#65289;&#26159;&#32593;&#32476;&#24212;&#29992;&#21450;&#30456;&#20851;&#30340;&#21327;&#35758;&#25152;&#22788;&#30340;&#20301;&#32622;&#65292;&#32593;&#32476;&#24212;&#29992;&#20250;&#20511;&#21161;&#30456;&#20851;&#30340;&#21327;&#35758;&#19982;&#20301;&#20110;&#20854;&#23427;&#32456;&#31471;&#31995;&#32479;&#19978;&#30340;&#32593;&#32476;&#24212;&#29992;&#20132;&#25442;&#25968;&#25454;&#21253;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#24212;&#29992;&#23618;&#20013;&#21253;&#21547;&#38750;&#24120;&#22810;&#30340;&#21327;&#35758;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">HTTP&#65306;&#25552;&#20379;&#32593;&#39029;&#25991;&#26723;&#30340;&#35831;&#27714;&#21644;&#20256;&#36865;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">SMTP&#65306;&#25552;&#20379;&#30005;&#23376;&#37038;&#20214;&#30340;&#20256;&#36865;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">FTP&#65306;&#25552;&#20379;&#20004;&#20010;&#32456;&#31471;&#31995;&#32479;&#30340;&#25991;&#20214;&#20256;&#36865;&#65307;</FONT></LI></UL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#24212;&#29992;&#23618;&#20013;&#30340;&#25968;&#25454;&#21253;&#34987;&#31216;&#20026;<STRONG>&#28040;&#24687;</STRONG>&#65288;<EM>message</EM>&#65289;</FONT></P>
<H4 id=&#20256;&#36755;&#23618;><FONT style="BACKGROUND-COLOR: #7be1e1">&#20256;&#36755;&#23618;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#20256;&#36755;&#23618;</U>&#65288;<EM>transport layer</EM>&#65289;&#25552;&#20379;&#19981;&#21516;&#32456;&#31471;&#31995;&#32479;&#38388;<U>&#28040;&#24687;</U>&#20256;&#36882;&#30340;&#26381;&#21153;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#20256;&#36755;&#23618;&#20013;&#20856;&#22411;&#30340;&#20256;&#36755;&#21327;&#35758;&#26377;&#20004;&#31181;&#65292;TCP &#21644; UDP&#65306;</FONT></P>
<UL>
<LI>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">TCP &#25552;&#20379;&#30340;&#26381;&#21153;&#26159;<STRONG>&#38754;&#21521;&#36830;&#25509;&#22411;</STRONG>&#65288;<EM>connection-oriented</EM>&#65289;&#30340;&#26381;&#21153;&#65292;&#21151;&#33021;&#20027;&#35201;&#21253;&#25324;&#20197;&#19979;&#22235;&#20010;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#25552;&#20379;&#21487;&#38752;&#65292;&#26377;&#24207;&#30340;&#23383;&#33410;&#27969;&#20256;&#36755;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><STRONG>&#27969;&#25511;&#21046;</STRONG>&#65288;<EM>flow control</EM>&#65289;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-21" name=ref-footnote-21>21</A></SUP>&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#23558;&#30456;&#23545;&#36739;&#38271;&#30340;&#28040;&#24687;&#20998;&#21106;&#25104;&#30456;&#23545;&#36739;&#30701;&#30340;<STRONG>&#27573;</STRONG>&#65288;<EM>segment</EM>&#65289;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#25552;&#20379;<STRONG>&#25317;&#22622;&#25511;&#21046;</STRONG>&#65288;<EM>congestion-control</EM>&#65289;&#32467;&#26500;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-22" name=ref-footnote-22>22</A></SUP>&#65307;</FONT></LI></UL>
<LI>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">UDP: UDP &#25552;&#20379;&#30340;&#26381;&#21153;&#26159;&#26080;&#36830;&#25509;&#22411;&#30340;&#65292;&#30456;&#23545;&#20110; TCP&#65292;&#20854;&#21151;&#33021;&#31616;&#21333;&#24456;&#22810;&#12290;&#26082;&#27809;&#26377;&#27969;&#25511;&#21046;&#65292;&#20063;&#27809;&#26377;&#25317;&#22622;&#25511;&#21046;&#65292;&#22240;&#27492;&#23601;&#19981;&#20445;&#35777;&#20219;&#20309;&#21487;&#20381;&#36182;&#24615;&#65307;</FONT></P></LI></UL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#22914;&#26524;&#20256;&#36755;&#23618;&#20351;&#29992;&#30340;&#26159; TCP &#21327;&#35758;&#65292;&#37027;&#20040;&#20854;&#20013;&#30340;&#25968;&#25454;&#21253;&#34987;&#31216;&#20026;<STRONG>&#25253;&#25991;&#27573;</STRONG>&#65288;<EM>segment</EM>&#65289;&#65307;&#22914;&#26524;&#20351;&#29992;&#30340;&#26159; UDP &#23601;&#31216;&#20026;<STRONG>&#25968;&#25454;&#25253;</STRONG>&#65288;<EM>datagram</EM>&#65289;</FONT></P>
<H4 id=&#32593;&#32476;&#23618;><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#23618;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#32593;&#32476;&#23618;</U>&#65288;<EM>network layer</EM>&#65289;&#30340;&#21151;&#33021;&#26159;&#23558;&#19968;&#20010;&#20027;&#26426;&#19978;&#30340;<STRONG>&#25968;&#25454;&#25253;</STRONG>&#65288;<EM>datagram</EM>&#65289;&#20256;&#36755;&#21040;&#21478;&#19968;&#21488;&#20027;&#26426;&#19978;&#65288;&#20174;&#28304;&#33410;&#28857;&#21040;&#30446;&#26631;&#33410;&#28857;&#65289;&#65292;&#26412;&#23618;&#30340;&#21327;&#35758;&#38500;&#20102;&#21253;&#25324;&#29992;&#20110;&#30830;&#23450;&#25968;&#25454;&#21253;&#36335;&#30001;&#65288;&#33258;&#36215;&#28857;&#21040;&#32456;&#28857;&#30340;&#36335;&#30001;&#65289;&#30340;&#36335;&#30001;&#21327;&#35758;&#65292;&#36824;&#21253;&#25324;<U><SPAN>&nbsp;</SPAN>IP &#21327;&#35758;</U></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#26412;&#23618;&#20013;&#30340; IP &#21327;&#35758;&#23450;&#20041;&#20102;&#25968;&#25454;&#25253;&#20013;&#30340;&#23383;&#27573;&#65292;&#20197;&#21450;&#32456;&#31471;&#31995;&#32479;&#20197;&#21450;&#36335;&#30001;&#22120;&#24212;&#24403;&#24590;&#26679;&#22788;&#29702;&#36825;&#20123;&#23383;&#27573;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#23618;&#20013;&#30340;&#25968;&#25454;&#21253;&#34987;&#31216;&#20026;<STRONG>&#25968;&#25454;&#25253;</STRONG>&#65288;<EM>datagram</EM>&#65289;</FONT></P>
<H4 id=&#38142;&#36335;&#23618;><FONT style="BACKGROUND-COLOR: #7be1e1">&#38142;&#36335;&#23618;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#22914;&#26524;&#32593;&#32476;&#23618;&#24819;&#35201;&#23558;&#25968;&#25454;&#25253;&#36716;&#21457;&#21040;&#36335;&#30001;&#19978;&#30340;&#19979;&#19968;&#20010;&#33410;&#28857;&#65292;&#23601;&#24517;&#39035;&#20511;&#21161;<U>&#38142;&#36335;&#23618;</U>&#65288;<EM>link layer</EM>&#65289;&#30340;&#24110;&#21161;&#65306;&#27599;&#20010;&#32593;&#32476;&#32452;&#20214;&#20013;&#30340;&#32593;&#32476;&#23618;&#37117;&#20250;&#23558;&#25968;&#25454;&#25253;&#20256;&#36755;&#32473;&#20854;&#19979;&#30340;&#38142;&#36335;&#23618;&#65292;&#20877;&#30001;&#23427;&#23558;&#25968;&#25454;&#25253;&#20256;&#36865;&#32473;&#19979;&#19968;&#20010;&#33410;&#28857;&#20013;&#30340;&#38142;&#36335;&#23618;&#12290;&#25968;&#25454;&#25253;&#21040;&#36798;&#21518;&#65292;&#33410;&#28857;&#38142;&#36335;&#23618;&#21017;&#20250;&#23558;&#25509;&#21463;&#21040;&#30340;&#25968;&#25454;&#25253;&#20256;&#36865;&#32473;&#20854;&#19978;&#30340;&#32593;&#32476;&#23618;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#20294;&#26159;&#38142;&#36335;&#23618;&#20855;&#20307;&#20250;&#25552;&#20379;&#20160;&#20040;&#26381;&#21153;&#24456;&#22823;&#31243;&#24230;&#19978;&#21462;&#20915;&#20110;&#20004;&#33410;&#28857;&#20043;&#38388;&#25152;&#20351;&#29992;&#30340;<U>&#38142;&#36335;&#24418;&#24335;</U>&#21450;&#23545;&#24212;&#30340;&#21327;&#35758;&#12290;&#23545;&#20110;&#26576;&#19968;&#20010;&#25968;&#25454;&#25253;&#26469;&#35828;&#65292;&#20854;&#21487;&#33021;&#22312;&#19968;&#26465;&#38142;&#36335;&#19978;&#34987;&#20197;&#22826;&#32593;&#23545;&#24212;&#30340;&#38142;&#36335;&#23618;&#21327;&#35758;&#25152;&#22788;&#29702;&#65292;&#22312;&#21478;&#19968;&#26465;&#38142;&#36335;&#19978;&#34987; PPP &#23545;&#24212;&#30340;&#38142;&#36335;&#23618;&#21327;&#35758;&#25152;&#22788;&#29702;&#12290;&#22240;&#27492;&#65292;&#20301;&#20110;&#19981;&#21516;&#36335;&#30001;&#22120;&#19978;&#30340;&#32593;&#32476;&#23618;&#24448;&#24448;&#20250;&#25910;&#21040;&#19981;&#21516;&#38142;&#36335;&#23618;&#21327;&#35758;&#30340;&#26381;&#21153;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#38142;&#36335;&#23618;&#20013;&#30340;&#25968;&#25454;&#21253;&#34987;&#31216;&#20026;<STRONG>&#24103;</STRONG>&#65288;<EM>frame</EM>&#65289;</FONT></P>
<H4 id=&#29289;&#29702;&#23618;><FONT style="BACKGROUND-COLOR: #7be1e1">&#29289;&#29702;&#23618;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#29289;&#29702;&#23618;</U>&#65288;<EM>physical layer</EM>&#65289;&#20256;&#36755;&#23545;&#35937;&#30340;&#21333;&#20301;&#26159;&#24103;&#20013;&#30340;&#21333;&#19968;&#19968;&#20010; bit&#12290;&#31867;&#20284;&#20110;&#38142;&#36335;&#23618;&#65292;&#26412;&#23618;&#30340;&#21327;&#35758;&#65288;&#21450;&#26381;&#21153;&#65289;&#20063;&#20381;&#36182;&#20110;&#38142;&#36335;&#30340;&#20855;&#20307;&#31867;&#22411;&#65292;&#26356;&#36827;&#19968;&#27493;&#30340;&#65292;&#29978;&#33267;&#20250;&#20381;&#36182;&#20110;&#38142;&#36335;&#19978;&#20855;&#20307;&#30340;&#20256;&#36755;&#20171;&#36136;&#65288;&#21452;&#32478;&#32447;&#65292;&#20809;&#32420;&#37117;&#26377;&#21508;&#33258;&#23545;&#24212;&#30340;&#21327;&#35758;&#65289;&#65307;&#25152;&#20351;&#29992;&#30340;&#21327;&#35758;&#19981;&#21516;&#65292;&#38142;&#36335;&#19978; bit &#30340;&#20256;&#36755;&#26041;&#24335;&#33258;&#28982;&#20063;&#19981;&#21516;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#29289;&#29702;&#23618;&#30340;&#25968;&#25454;&#25253;&#23601;&#31616;&#21333;&#30340;&#34987;&#31216;&#20026;<STRONG>&#21253;</STRONG>&#65288;<EM>packet</EM>&#65289;</FONT></P>
<H3 id=&#23553;&#35013;><FONT style="BACKGROUND-COLOR: #7be1e1">&#23553;&#35013;</FONT></H3>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#20013;&#30340;&#29289;&#29702;&#32452;&#20214;&#24182;&#19981;&#20250;&#23454;&#29616;&#20840;&#37096;&#30340;&#21327;&#35758;&#23618;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220306183944464 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220306183944464.png"></FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#20027;&#26426;</U>&#23454;&#29616;&#20102;&#32593;&#32476;&#21327;&#35758;&#26632;&#20013;&#30340;&#20840;&#37096;&#23618;&#65288;&#22240;&#29305;&#32593;&#26550;&#26500;&#23558;&#38750;&#24120;&#22810;&#30340;&#22797;&#26434;&#24230;&#25918;&#22312;&#20102;&#32593;&#32476;&#36793;&#32536;&#20013;&#65289;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#36335;&#30001;&#22120;</U>&#20165;&#23454;&#29616;&#20102;&#21327;&#35758;&#26632;&#30340;&#24213;&#19979;&#19977;&#23618;&#65288;&#29289;&#29702;&#23618;&#12289;&#38142;&#36335;&#23618;&#12289;&#32593;&#32476;&#23618;&#65289;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#38142;&#25509;&#23618;&#20132;&#25442;&#26426;</U>&#20165;&#23454;&#29616;&#20102;&#21327;&#35758;&#26632;&#30340;&#24213;&#19979;&#20004;&#23618;&#65288;&#29289;&#29702;&#23618;&#12289;&#38142;&#36335;&#23618;&#65289;&#22240;&#27492;&#23427;&#24182;&#19981;&#33021;&#35782;&#21035; IP &#22320;&#22336;&#65292;&#32780;&#21482;&#33021;&#35782;&#21035;&#31532;&#20108;&#23618;&#30340;&#22320;&#22336;&#65288;&#20197;&#22826;&#32593;&#22320;&#22336;&#65289;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#38598;&#32447;&#22120;</U>&#20165;&#23454;&#29616;&#20102;&#26368;&#24213;&#19979;&#30340;&#19968;&#23618;&#65288;&#29289;&#29702;&#23618;&#65289;&#65307;</FONT></LI></UL><FONT style="BACKGROUND-COLOR: #7be1e1">
<HR>
</FONT>
<DIV class=footnotes-area><FONT style="BACKGROUND-COLOR: #7be1e1">
<HR>
</FONT>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>1</SPAN><SPAN>&nbsp;</SPAN>&#38656;&#35201;&#27880;&#24847;&#30340;&#26159;&#65292;&#32593;&#32476;&#24212;&#29992;&#23454;&#38469;&#19978;&#26159;&#36816;&#34892;&#22312;&#32456;&#31471;&#31995;&#32479;&#32780;&#19981;&#26159;&#20301;&#20110;&#32593;&#32476;&#26680;&#24515;&#30340;&#21253;&#20132;&#25442;&#26426;&#19978;&#30340;<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-1" name=dfref-footnote-1><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>2</SPAN><SPAN>&nbsp;</SPAN>&#24213;&#23618;&#30340; ISP &#21017;&#26159;&#36890;&#36807;&#22269;&#23478;&#32423;&#30340;&#19978;&#23618; ISP &#23454;&#29616;&#30456;&#20114;&#20043;&#38388;&#30340;&#38142;&#25509;&#30340;&#65288;&#35201;&#19981;&#28982;&#20998;&#23646;&#19981;&#21516; ISP &#30340;&#32456;&#31471;&#35774;&#22791;&#35201;&#22914;&#20309;&#30456;&#36830;&#65311;&#65289;&#65292;&#27492;&#22806;&#65292;&#26080;&#35770;&#26159;&#24213;&#23618; ISP &#36824;&#26159;&#19978;&#23618; ISP &#37117;&#26159;&#30456;&#20114;&#29420;&#31435;&#30340;&#65292;&#23427;&#20204;&#26377;&#30528;&#21508;&#33258;&#30340; IP &#21327;&#35758;&#65292;&#20063;&#36981;&#24490;&#32773;&#29305;&#23450;&#30340;&#21629;&#21517;&#21644;&#23547;&#22336;&#32422;&#23450;<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-2" name=dfref-footnote-2><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>3</SPAN><SPAN>&nbsp;</SPAN>A protocol defines the format and the order of messages exchanged between two or more communicating entities, as well as the actions taken on the transmission and/or receipt of a message or other event.<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-3" name=dfref-footnote-3><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>4</SPAN><SPAN>&nbsp;</SPAN>&#26377;&#20004;&#31181;&#25551;&#36848;&#32593;&#32476;&#35774;&#22791;&#30340;&#26041;&#24335;&#65306;&#23558;&#22240;&#29305;&#32593;&#19978;&#30340;&#32456;&#31471;&#35774;&#22791;&#20998;&#25104;&#23458;&#25143;&#31471;&#21644;&#26381;&#21153;&#22120;&#65288;<EM>client-server</EM>&#65292;CS&#65289;&#65307;&#20134;&#25110;&#26159;&#23558;&#32593;&#32476;&#19978;&#25152;&#26377;&#30340;&#35774;&#22791;&#19968;&#35270;&#21516;&#20161;&#65288;<EM>peer-to-peer</EM>&#65292;PTP&#65289;<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-4" name=dfref-footnote-4><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>5</SPAN><SPAN>&nbsp;</SPAN>&#21363;&#23454;&#29616;<STRONG>&#20303;&#23429;&#23485;&#24102;&#25509;&#20837;</STRONG>&#65288;<EM>broadband residential access</EM>&#65289;&#30340;&#26041;&#24335;<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-5" name=dfref-footnote-5><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>6</SPAN><SPAN>&nbsp;</SPAN>&#30001;&#20110;&#37096;&#20998;&#24102;&#23485;&#20998;&#32473;&#20102;&#30005;&#35805;&#32447;&#65292;&#22240;&#27492;&#24448;&#24448;&#26377;&#19968;&#31181;&#34987;&#31216;&#20026; ADSL &#30340;&#32593;&#32476;&#65292;&#20854;&#19978;&#34892;&#19979;&#34892;&#36895;&#24230;&#24448;&#24448;&#19981;&#19968;&#33268;<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-6" name=dfref-footnote-6><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>7</SPAN><SPAN>&nbsp;</SPAN>&#26377;&#32447;&#20114;&#32852;&#32593;&#31995;&#32479;&#34987;&#31216;&#20026; HFC &#30340;&#24456;&#22823;&#19968;&#37096;&#20998;&#21407;&#22240;&#22312;&#20110;&#20854;&#29289;&#29702;&#29305;&#24615;&#65292;&#26377;&#32447;&#30005;&#35270;&#21069;&#31471;&#65288;Cable Head End&#65289;&#20250;&#20351;&#29992;&#20809;&#32420;&#26469;&#21644;&#27599;&#20010;&#31038;&#21306;&#20013;&#35774;&#32622;&#30340;&#20809;&#32420;&#33410;&#28857;&#65288;fiber node&#65289;&#30456;&#36830;&#25509;&#65292;&#32780;&#36825;&#20123;&#20809;&#32420;&#33410;&#28857;&#21017;&#20250;&#20351;&#29992;&#21516;&#36724;&#30005;&#32518;&#65288;coaxial cable&#65289;&#21644;&#31038;&#21306;&#20013;&#30340;&#27599;&#23478;&#27599;&#25143;&#30456;&#36830;&#65292;&#36825;&#23601;&#26159;&#20854;&#35813;&#31995;&#32479;&#34987;&#31216;&#20026;&#28151;&#21512;&#20809;&#32420;&#21516;&#36724;&#30005;&#32518;&#31995;&#32479;&#30340;&#21407;&#22240;<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-7" name=dfref-footnote-7><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>8</SPAN><SPAN>&nbsp;</SPAN>&#19968;&#33324;&#23558;<SPAN>&nbsp;</SPAN><MJX-CONTAINER class=MathJax jax="SVG"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="1.541ex" height="1.545ex" focusable="false" viewBox="0 -683 681 683" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-43-TEX-I-1D43F d="M228 637Q194 637 192 641Q191 643 191 649Q191 673 202 682Q204 683 217 683Q271 680 344 680Q485 680 506 683H518Q524 677 524 674T522 656Q517 641 513 637H475Q406 636 394 628Q387 624 380 600T313 336Q297 271 279 198T252 88L243 52Q243 48 252 48T311 46H328Q360 46 379 47T428 54T478 72T522 106T564 161Q580 191 594 228T611 270Q616 273 628 273H641Q647 264 647 262T627 203T583 83T557 9Q555 4 553 3T537 0T494 -1Q483 -1 418 -1T294 0H116Q32 0 32 10Q32 17 34 24Q39 43 44 45Q48 46 59 46H65Q92 46 125 49Q139 52 144 61Q147 65 216 339T285 628Q285 635 228 637Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D43F" xlink:href="#MJX-43-TEX-I-1D43F"><path id=MJX-43-TEX-I-1D43F d="M228 637Q194 637 192 641Q191 643 191 649Q191 673 202 682Q204 683 217 683Q271 680 344 680Q485 680 506 683H518Q524 677 524 674T522 656Q517 641 513 637H475Q406 636 394 628Q387 624 380 600T313 336Q297 271 279 198T252 88L243 52Q243 48 252 48T311 46H328Q360 46 379 47T428 54T478 72T522 106T564 161Q580 191 594 228T611 270Q616 273 628 273H641Q647 264 647 262T627 203T583 83T557 9Q555 4 553 3T537 0T494 -1Q483 -1 418 -1T294 0H116Q32 0 32 10Q32 17 34 24Q39 43 44 45Q48 46 59 46H65Q92 46 125 49Q139 52 144 61Q147 65 216 339T285 628Q285 635 228 637Z"></path></use></g></g></g></svg></MJX-CONTAINER><SPAN>&nbsp;</SPAN>&#32422;&#23450;&#20026;&#19968;&#20010;&#21253;&#30340;&#38271;&#24230;&#65292;&#20063;&#23601;&#26159;&#20854;bit&#25968;&#30446;&#65307;&#23558;<SPAN>&nbsp;</SPAN><MJX-CONTAINER class=MathJax jax="SVG"><svg role=img aria-hidden=true xmlns="http://www.w3.org/2000/svg" width="1.717ex" height="1.593ex" focusable="false" viewBox="0 -683 759 704" xmlns:xlink="http://www.w3.org/1999/xlink"><defs><path id=MJX-44-TEX-I-1D445 d="M230 637Q203 637 198 638T193 649Q193 676 204 682Q206 683 378 683Q550 682 564 680Q620 672 658 652T712 606T733 563T739 529Q739 484 710 445T643 385T576 351T538 338L545 333Q612 295 612 223Q612 212 607 162T602 80V71Q602 53 603 43T614 25T640 16Q668 16 686 38T712 85Q717 99 720 102T735 105Q755 105 755 93Q755 75 731 36Q693 -21 641 -21H632Q571 -21 531 4T487 82Q487 109 502 166T517 239Q517 290 474 313Q459 320 449 321T378 323H309L277 193Q244 61 244 59Q244 55 245 54T252 50T269 48T302 46H333Q339 38 339 37T336 19Q332 6 326 0H311Q275 2 180 2Q146 2 117 2T71 2T50 1Q33 1 33 10Q33 12 36 24Q41 43 46 45Q50 46 61 46H67Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628Q287 635 230 637ZM630 554Q630 586 609 608T523 636Q521 636 500 636T462 637H440Q393 637 386 627Q385 624 352 494T319 361Q319 360 388 360Q466 361 492 367Q556 377 592 426Q608 449 619 486T630 554Z"></path></defs><g stroke="currentColor" fill="currentColor" stroke-width="0" transform="scale(1,-1)"><g data-mml-node="math"><g data-mml-node="mi"><use data-c="1D445" xlink:href="#MJX-44-TEX-I-1D445"><path id=MJX-44-TEX-I-1D445 d="M230 637Q203 637 198 638T193 649Q193 676 204 682Q206 683 378 683Q550 682 564 680Q620 672 658 652T712 606T733 563T739 529Q739 484 710 445T643 385T576 351T538 338L545 333Q612 295 612 223Q612 212 607 162T602 80V71Q602 53 603 43T614 25T640 16Q668 16 686 38T712 85Q717 99 720 102T735 105Q755 105 755 93Q755 75 731 36Q693 -21 641 -21H632Q571 -21 531 4T487 82Q487 109 502 166T517 239Q517 290 474 313Q459 320 449 321T378 323H309L277 193Q244 61 244 59Q244 55 245 54T252 50T269 48T302 46H333Q339 38 339 37T336 19Q332 6 326 0H311Q275 2 180 2Q146 2 117 2T71 2T50 1Q33 1 33 10Q33 12 36 24Q41 43 46 45Q50 46 61 46H67Q94 46 127 49Q141 52 146 61Q149 65 218 339T287 628Q287 635 230 637ZM630 554Q630 586 609 608T523 636Q521 636 500 636T462 637H440Q393 637 386 627Q385 624 352 494T319 361Q319 360 388 360Q466 361 492 367Q556 377 592 426Q608 449 619 486T630 554Z"></path></use></g></g></g></svg></MJX-CONTAINER><SPAN>&nbsp;</SPAN>&#32422;&#23450;&#20026;bit&#20256;&#36755;&#36895;&#29575;&#65292;&#21333;&#20301;&#26159; bit &#27599;&#31186;<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-8" name=dfref-footnote-8><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>9</SPAN><SPAN>&nbsp;</SPAN>&#25490;&#38431;&#24310;&#36831;&#20027;&#35201;&#21463;&#21040;&#32593;&#32476;&#25317;&#22622;&#31243;&#24230;&#30340;&#24433;&#21709;<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-9" name=dfref-footnote-9><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>10</SPAN><SPAN>&nbsp;</SPAN>&#23454;&#38469;&#19978;&#65292;&#26681;&#26412;&#19981;&#29992;&#31561;&#21040;&#21253;&#25509;&#21463;&#36895;&#29575;&#31561;&#20110;&#21253;&#21457;&#36865;&#36895;&#29575;&#65292;&#22312;&#27492;&#20043;&#21069;&#32593;&#32476;&#25317;&#22622;&#20197;&#21450;&#21457;&#29983;&#20102;<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-10" name=dfref-footnote-10><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>11</SPAN><SPAN>&nbsp;</SPAN>&#26681;&#25454;&#32593;&#32476;&#36873;&#29992;&#30340;&#21327;&#35758;&#19981;&#21516;&#65292;&#26377;&#21487;&#33021;&#37325;&#20256;&#20063;&#26377;&#21487;&#33021;&#19981;&#37325;&#20256;<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-11" name=dfref-footnote-11><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>12</SPAN><SPAN>&nbsp;</SPAN>&#36825;&#20284;&#20046;&#26159;&#22312;&#23558;&#28040;&#24687;&#20998;&#27573;&#26102;&#23436;&#25104;&#30340;<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-12" name=dfref-footnote-12><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>13</SPAN><SPAN>&nbsp;</SPAN>&#26681;&#25454;&#35745;&#31639;&#65292;&#20998;&#32452;&#20132;&#25442;&#33021;&#26356;&#39640;&#25928;&#30340;&#20351;&#29992;&#32593;&#32476;<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-13" name=dfref-footnote-13><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>14</SPAN><SPAN>&nbsp;</SPAN>&#25968;&#25454;&#32593;&#32476;&#26159;&#31361;&#21457;&#24615;&#36755;&#20986;&#65292;&#36825;&#19968;&#28857;&#21644;&#30005;&#35805;&#24335;&#32593;&#32476;&#19981;&#21516;&#65292;&#22240;&#27492;&#21487;&#20197;&#35828;&#30005;&#36335;&#20132;&#25442;&#32593;&#32476;&#30340;&#25928;&#29575;&#26159;&#24456;&#20302;&#30340;&#12290;&#36825;&#26159;&#30001;&#20110;&#24456;&#22810;&#26102;&#20505;&#37117;&#19981;&#33021;&#20805;&#20998;&#21457;&#25381;&#32593;&#32476;&#30340;&#25928;&#29575;&#65288;CPU Time&#65289;<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-14" name=dfref-footnote-14><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>15</SPAN><SPAN>&nbsp;</SPAN>&#36825;&#37324;&#30340;&#31532;&#19968;&#23618;&#32593;&#32476;&#25351;&#30340;&#26159;&#20043;&#21069;&#25552;&#21040;&#30340;&#20840;&#29699; ISP<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-15" name=dfref-footnote-15><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>16</SPAN><SPAN>&nbsp;</SPAN>&#20854;&#23427;&#30340;&#36824;&#21487;&#33021;&#26377;&#26816;&#26597;&#22312;&#21253;&#20256;&#36755;&#36807;&#31243;&#20013;&#20986;&#29616;&#30340; bit &#32423;&#21035;&#30340;&#38169;&#35823;&#65288;<EM>bit-level error</EM>&#65289;<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-16" name=dfref-footnote-16><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>17</SPAN><SPAN>&nbsp;</SPAN>&#24456;&#26174;&#28982;&#65292;&#21644;&#21253;&#21040;&#36798;&#36895;&#29575;&#27809;&#26377;&#20851;&#31995;<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-17" name=dfref-footnote-17><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>18</SPAN><SPAN>&nbsp;</SPAN>&#19968;&#33324;&#24773;&#20917;&#19979;&#27599;&#19968;&#23618;&#26032;&#21152;&#30340;&#20449;&#24687;&#37117;&#26159;&#21152;&#22312;&#21407;&#26377;&#25968;&#25454;&#21253;&#30340;&#22836;&#37096;&#65292;&#24456;&#22823;&#19968;&#37096;&#20998;&#21407;&#22240;&#26159;&#35753;&#36825;&#20123;&#20449;&#24687;&#26356;&#21152;&#23481;&#26131;&#34987;&#22788;&#29702;<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-18" name=dfref-footnote-18><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>19</SPAN><SPAN>&nbsp;</SPAN>&#36825;&#20123;&#26032;&#21152;&#36827;&#21435;&#30340;&#28040;&#24687;&#34987;&#31216;&#20026;&#20256;&#36755;&#23618;&#22836;&#28040;&#24687;&#65288;<EM>transport-layer header information</EM>&#65289;&#20250;&#34987;&#25509;&#21463;&#27979;&#30340;&#20256;&#36755;&#23618;&#25152;&#20351;&#29992;&#65292;&#20854;&#21487;&#33021;&#20250;&#34987;&#29992;&#20316;&#30830;&#23450;&#21738;&#20010;&#24212;&#29992;&#24212;&#24403;&#25509;&#21463;&#27492;&#28040;&#24687;&#65292;&#20063;&#26377;&#21487;&#33021;&#20250;&#21253;&#21547;&#19968;&#20123;&#29992;&#20110;&#26816;&#27979;&#38169;&#35823;&#30340;&#25968;&#25454;&#65288;&#20197;&#20415;&#30830;&#23450;&#28040;&#24687;&#22312;&#20256;&#36755;&#30340;&#36884;&#20013;&#26377;&#27809;&#26377;&#34987;&#26356;&#25913;&#65289;<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-19" name=dfref-footnote-19><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>20</SPAN><SPAN>&nbsp;</SPAN>&#36825;&#20123;&#28040;&#24687;&#20013;&#21253;&#21547;&#28304;&#20027;&#26426;&#21644;&#30446;&#26631;&#20027;&#26426;&#22320;&#22336;&#20449;&#24687;<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-20" name=dfref-footnote-20><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>21</SPAN><SPAN>&nbsp;</SPAN>&#21305;&#37197;&#25509;&#21463;&#32773;&#21644;&#21457;&#36865;&#32773;&#30340;&#36895;&#24230;&#65292;&#21542;&#21017;&#65292;&#35201;&#19981;&#23601;&#26159;&#25509;&#25910;&#31471;&#19981;&#33021;&#25910;&#21040;&#25152;&#26377;&#25968;&#25454;&#65292;&#35201;&#19981;&#23601;&#26159;&#22823;&#37327;&#30340;&#24102;&#23485;&#34987;&#28010;&#36153;<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-21" name=dfref-footnote-21><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV>
<DIV class=footnote-line><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=md-fn-count>22</SPAN><SPAN>&nbsp;</SPAN>&#32593;&#32476;&#25317;&#22622;&#26102;&#65292;&#25511;&#21046;&#20854;&#20256;&#36755;&#36895;&#29575;<SPAN>&nbsp;</SPAN></FONT><A title=&#22238;&#21040;&#25991;&#26723; class=reversefootnote href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#ref-footnote-22" name=dfref-footnote-22><FONT style="BACKGROUND-COLOR: #7be1e1">&#8617;</FONT></A></DIV></DIV><BR><BR><FONT style="BACKGROUND-COLOR: #7be1e1">