<STRONG><FONT style="BACKGROUND-COLOR: #7be1e1" color=blue>Introduction : &#32593;&#32476;&#26680;&#24515; : </FONT></STRONG>
<H3 id=&#30005;&#36335;&#20132;&#25442;><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> Introduction : &#32593;&#32476;&#26680;&#24515; : &#30005;&#36335;&#20132;&#25442;</SPAN></FONT></FONT></H3>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#30005;&#36335;&#20132;&#25442;</U>&#65288;<EM>Circuit Switching</EM>&#65289;&#20013;&#20250;&#35805;&#25152;&#38656;&#35201;&#30340;&#36164;&#28304;&#20250;&#34987;<U>&#39044;&#30041;</U>&#65292;&#20063;&#23601;&#26159;&#35828;&#65292;&#23613;&#31649;&#32593;&#32476;&#20013;&#26377;&#21097;&#20313;&#30340;&#36164;&#28304;&#65292;&#20294;&#26159;&#19981;&#33021;&#20687;&#20998;&#32452;&#20132;&#25442;&#19968;&#26679;&#65292;&#19968;&#20221;&#20250;&#35805;&#23558;&#36825;&#25152;&#26377;&#30340;&#36164;&#28304;&#20104;&#20197;&#29420;&#21344;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-13" name=ref-footnote-13>13</A></SUP>&#12290;&#27492;&#22806;&#65292;&#23601;&#31639;&#26576;&#26465;&#38142;&#25509;&#20013;&#24182;&#27809;&#26377;&#21457;&#36865;&#25110;&#25509;&#25910;&#20219;&#20309;&#25968;&#25454;&#65292;&#36825;&#26465;&#38142;&#25509;&#20063;&#20250;&#34987;&#19968;&#30452;&#20445;&#30041;&#30452;&#21040;&#26174;&#24335;&#30340;&#26029;&#24320;&#36830;&#25509;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-14" name=ref-footnote-14>14</A></SUP></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#29305;&#24615;&#65292;&#30005;&#36335;&#20132;&#25442;&#32593;&#32476;&#20013;&#27599;&#19968;&#20221;&#20250;&#35805;&#37117;&#38656;&#35201;&#24314;&#31435;&#19968;&#26465;<STRONG>&#32447;&#36335;</STRONG>&#65288;<EM>circuit</EM>&#65289;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#32447;&#36335;&#38656;&#35201;&#39044;&#20808;&#24314;&#31435;&#65292;&#36825;&#20063;&#23601;&#24847;&#21619;&#30528;&#20004;&#20010;&#20027;&#26426;&#20043;&#38388;&#24418;&#25104;&#20102;<U>&#31471;&#21040;&#31471;</U>&#65288;<EM>end-to-end</EM>&#65289;&#30340;&#38142;&#25509;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#32447;&#36335;&#30340;&#24314;&#31435;&#24847;&#21619;&#30528;<U>&#36335;&#24452;</U>&#65288;<EM>path</EM>&#65289;&#19978;&#30340;&#20132;&#25442;&#26426;&#21644;&#21508;&#31181;&#35774;&#22791;&#37117;&#20250;&#20026;&#27492;&#32447;&#36335;&#20445;&#25345;&#38142;&#25509;&#29366;&#24577;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#25110;&#20026;&#32447;&#36335;&#39044;&#30041;&#37096;&#20998;&#22266;&#23450;&#30340;&#20256;&#36755;&#36895;&#29575;&#65292;&#20063;&#23601;&#26159;&#35828;&#65292;&#20256;&#36755;&#26041;&#21644;&#25509;&#25910;&#26041;&#33267;&#23569;&#34987;&#20445;&#35777;&#33021;&#20197;&#19968;&#23450;&#30340;&#36895;&#29575;&#20256;&#36755;&#25968;&#25454;&#65307;</FONT></LI></UL>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#37027;&#20040;&#65292;&#19968;&#26465;<U>&#38142;&#36335;</U>&#65288;<EM>link</EM>&#65289;&#26159;&#22914;&#20309;&#23481;&#32435;&#22810;&#26465;<U>&#32447;&#36335;</U>&#65288;<EM>circuit</EM>&#65289;&#30340;&#21602;&#65292;&#36825;&#23601;&#28041;&#21450;&#21040;&#20197;&#19979;&#20004;&#20010;&#25216;&#26415;&#65306;</FONT></P>
<UL>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#39057;&#20998;&#22797;&#29992;</U>&#65288;<EM>frequency-division multiplexing</EM>&#65292;FDM&#65289;&#65307; </FONT>
<LI><FONT style="BACKGROUND-COLOR: #7be1e1"><U>&#26102;&#20998;&#22797;&#29992;</U>&#65288;<EM>time-division multiplexing</EM>&#65292;TDM&#65289;&#65307;</FONT></LI></UL>
<H4 id=fdm><FONT style="BACKGROUND-COLOR: #7be1e1">FDM</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#23558;&#39057;&#24102;&#30340;&#23485;&#24230;&#65288;&#24102;&#23485;&#65292;bandwidth&#65289;&#22343;&#31561;&#30340;&#20999;&#21106;&#65292;&#32447;&#36335;&#21482;&#33021;&#20351;&#29992;&#19968;&#37096;&#20998;&#39057;&#24102;&#36827;&#34892;&#36890;&#20449;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220306191017208 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220306191017208.png"></FONT></P>
<H4 id=tdm><FONT style="BACKGROUND-COLOR: #7be1e1">TDM</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#23545;&#20110;&#26102;&#20998;&#22797;&#29992;&#26469;&#35828;&#65292;&#26102;&#38388;&#20250;&#34987;&#20998;&#25104;&#38271;&#24230;&#22266;&#23450;&#30340;&#24103;&#65292;&#36825;&#20123;&#24103;&#21448;&#20250;&#34987;&#20998;&#25104;&#19968;&#23450;&#25968;&#37327;&#30340;<STRONG>&#26102;&#38553;</STRONG>&#65288;<EM>time slots</EM>&#65289;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#27599;&#24403;&#32593;&#32476;&#20013;&#24314;&#31435;&#36215;&#19968;&#20010;&#38142;&#25509;&#65292;&#23601;&#20250;&#22312;&#27599;&#19968;&#20010;&#26102;&#38388;&#24103;&#20013;&#20026;&#20854;&#20998;&#37197;&#19968;&#20010;&#26102;&#38553;&#65292;&#35813;&#38142;&#25509;&#20165;&#22312;&#27492;&#26102;&#38553;&#20869;&#21487;&#20197;&#20256;&#36755;&#25968;&#25454;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220306191043955 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220306191043955.png"></FONT></P>
<H4 id=stdm><FONT style="BACKGROUND-COLOR: #7be1e1">STDM</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#23613;&#31649;&#22343;&#34913;&#12289;&#22266;&#23450;&#21010;&#20998;&#30475;&#36215;&#26469;&#24456;&#20844;&#24179;&#65292;&#20294;&#26159;&#23545;&#20110;&#19981;&#22343;&#21248;&#30340;&#12289;&#31361;&#21457;&#30340;&#25968;&#25454;&#20381;&#28982;&#20250;&#26377;&#24456;&#22810;&#36164;&#28304;&#34987;&#28010;&#36153;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220306191148379 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220306191148379.png"></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#22240;&#27492;&#65292;&#21518;&#26469;&#26377;&#20986;&#29616;&#19968;&#31181;&#22522;&#20110;&#21382;&#21490;&#32479;&#35745;&#25968;&#25454;&#23545;&#32593;&#32476;&#36164;&#28304;&#30340;&#21010;&#20998;&#26041;&#24335;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img alt=image-20220306191543991 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220306191543991.png"></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#35841;&#21457;&#30340;&#22810;&#65292;&#35841;&#23601;&#33021;&#25343;&#21040;&#26356;&#22810;&#30340;&#36164;&#28304;</FONT></P>
<H4 id=&#30005;&#36335;&#20132;&#25442;&#19982;&#20998;&#32452;&#20132;&#25442;><FONT style="BACKGROUND-COLOR: #7be1e1">&#30005;&#36335;&#20132;&#25442;&#19982;&#20998;&#32452;&#20132;&#25442;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#23454;&#36341;&#20013;&#65292;&#20855;&#20307;&#22312;&#36825;&#20004;&#31181;&#20132;&#25442;&#26041;&#24335;&#20013;&#36873;&#25321;&#21738;&#19968;&#31181;&#24456;&#22823;&#31243;&#24230;&#19978;&#21462;&#20915;&#20110;&#32593;&#32476;&#28304;&#20027;&#26426;&#20256;&#36755;&#25968;&#25454;&#30340;&#27169;&#24335;&#65292;&#22914;&#26524;&#28304;&#33410;&#28857;&#20250;&#20197;&#24658;&#23450;&#27604;&#29305;&#29575;&#65288;CBR&#65289;&#20256;&#36755;&#25968;&#25454;&#65292;&#36873;&#25321;&#30005;&#36335;&#20132;&#25442;&#21487;&#33021;&#26356;&#22909;&#65292;<U>&#36825;&#26159;&#22240;&#20026;&#22914;&#26524;&#28304;&#20027;&#26426;&#30340;&#27604;&#29305;&#29575;&#24658;&#23450;&#30340;&#35805;</U></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#27492;&#22806;&#65292;&#38754;&#21521;&#36830;&#25509;&#24335;&#20256;&#36755;&#23454;&#38469;&#19978;&#21644;&#30005;&#36335;&#20132;&#25442;&#19981;&#26159;&#30456;&#20114;&#32465;&#23450;&#30340;&#65292;&#20998;&#32452;&#20132;&#25442;&#20063;&#21487;&#20197;&#23454;&#29616;&#38754;&#21521;&#36830;&#25509;&#24335;&#20256;&#36755;&#12290;&#22240;&#27492;&#30005;&#36335;&#20132;&#25442;&#21644;&#20998;&#32452;&#20132;&#25442;&#20004;&#32773;<U>&#22312;&#24310;&#36831;&#19978;</U>&#26368;&#22823;&#30340;&#24046;&#21035;&#26159;&#20174;&#28304;&#20027;&#26426;&#21040;&#30446;&#26631;&#20027;&#26426;&#30340;&#36335;&#30001;&#19978;&#65292;&#25152;&#26377;&#38142;&#36335;&#23545;&#24212;&#30340;&#36335;&#30001;&#22120;&#26159;&#21542;&#20026;<U>&#23384;&#20648;&#36716;&#21457;&#24335;&#20256;&#36755;</U>&#12290;&#22914;&#26524;&#26159;&#20998;&#32452;&#20132;&#25442;&#65288;&#26080;&#35770;&#26159;&#25968;&#25454;&#25253;&#32593;&#32476;&#36824;&#26159;&#34394;&#25311;&#30005;&#36335;&#32593;&#32476;&#65289;&#65292;&#37027;&#20040;&#36335;&#30001;&#19978;&#27599;&#19968;&#20010;&#36335;&#30001;&#22120;&#30340;&#20256;&#36755;&#24310;&#36831;&#37117;&#35201;&#34987;&#35745;&#31639;&#22312;&#20854;&#20013;&#65292;&#30005;&#36335;&#20132;&#25442;&#21017;&#19981;&#29992;&#65292;&#21482;&#38656;&#35201;&#23558;&#38142;&#25509;&#24314;&#31435;&#30340;&#26102;&#38388;&#31639;&#22312;&#37324;&#36793;&#21363;&#21487;<BR><BR></FONT></P><FONT style="BACKGROUND-COLOR: #7be1e1">