In either case, you need to make sure not to &#8220;leak&#8221; resources. For example, suppose that your system call has acquired a lock or allocated memory with malloc(). If you encounter an invalid user pointer afterward, you must still be sure to release the lock or free the page of memory. If you choose to verify user pointers before dereferencing them, this should be straightforward. It&#8217;s more di&#64259;cult to handle if an invalid pointer causes a page fault, because there&#8217;s no way to return an error code from a memory access. Therefore, for those who want to try the latter technique, we&#8217;ll provide a little bit of helpful code: 
<P></P>
<P>&#21478;&#22806;&#36824;&#38656;&#35201;&#27880;&#24847;&#30830;&#20445;&#36164;&#28304;&#34987;&#23436;&#25972;&#37322;&#25918;&#65292;&#20855;&#20307;&#26469;&#35828;&#23601;&#26159;&#22914;&#26524;&#22320;&#22336;&#19981;&#21512;&#27861;&#65292;&#23545;&#20110;&#31532;&#19968;&#31181;&#24773;&#20917;&#26469;&#35828;&#65292;&#30001;&#20110;&#26159;&#22312;&#24341;&#21457; page_fault &#20043;&#21069;&#65292;&#38024;&#23545;&#22320;&#22336;&#30340;&#26657;&#39564;&#34892;&#20026;&#20013;&#21457;&#29616;&#22320;&#22336;&#19981;&#21512;&#27861;&#65292;&#37027;&#20040;&#20869;&#26680;&#23601;&#21487;&#20197;&#36820;&#22238;&#29992;&#25143;&#36827;&#31243;&#24182;&#37322;&#25918;&#36164;&#28304;&#12290;&#20294;&#26159;&#23545;&#20110;&#31532;&#20108;&#31181;&#24773;&#20917;&#26469;&#35828;&#65292;&#30001;&#20110;&#24050;&#32463;&#24341;&#21457;&#20102; page_fault &#22240;&#27492;&#27809;&#26377;&#21150;&#27861;&#20174;&#20869;&#23384;&#35775;&#38382;&#20013;&#36820;&#22238;&#38169;&#35823;&#30721;&#65292;&#20063;&#23601;&#27809;&#26377;&#21150;&#27861;&#37322;&#25918;&#37027;&#20123;&#36164;&#28304;&#12290;&#20026;&#27492;&#65292;&#25991;&#26723;&#20013;&#32473;&#20986;&#20102;&#19968;&#20123;&#24110;&#21161;&#20195;&#30721;&#65306;</P>
<P><SPAN class=extract>&#22312; Pintos &#20013;&#65292;&#22914;&#26524;&#25105;&#20204;&#24819;&#35201;&#32467;&#26463;&#26576;&#20010;&#29992;&#25143;&#32447;&#31243;&#65292;&#22312;&#27492;&#20043;&#21069;&#26368;&#37325;&#35201;&#30340;&#26159;&#65306;&#30830;&#20445;&#36827;&#31243;&#36164;&#28304;&#34987;&#23436;&#25972;&#37322;&#25918;</SPAN></P>
<P><SPAN class=extract>&#22914;&#26524;&#25105;&#20204;&#36873;&#25321;&#35753; page_fault &#22788;&#29702;&#31243;&#24207;&#26469;&#22788;&#29702;&#29992;&#25143;&#22320;&#22336;&#30340;&#19981;&#21512;&#27861;&#38382;&#39064;&#65292;&#37027;&#20040;&#25105;&#20204;&#21487;&#20197;&#36873;&#25321;&#20351;&#29992;&#25991;&#26723;&#20013;&#30340;&#24110;&#21161;&#20195;&#30721;</SPAN>