<STRONG><FONT style="BACKGROUND-COLOR: #7be1e1" color=blue>Introduction : &#32593;&#32476;&#26680;&#24515; : </FONT></STRONG>
<H3 id=&#32593;&#32476;&#30340;&#32593;&#32476;><FONT style="BACKGROUND-COLOR: #7be1e1"><SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> Introduction : &#32593;&#32476;&#26680;&#24515; : &#32593;&#32476;&#30340;&#32593;&#32476;</SPAN></FONT></FONT></H3>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#26082;&#28982; ISP &#33021;&#23558;&#19981;&#21516;&#30340;&#32456;&#31471;&#29992;&#25143;&#36830;&#25509;&#36215;&#26469;&#65292;&#37027;&#20040;&#36825;&#20123; ISP &#20043;&#38388;&#21448;&#26159;&#22914;&#20309;&#36830;&#25509;&#36215;&#26469;&#30340;&#21602;&#65311;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#31572;&#26696;&#26159;&#36890;&#36807;&#24314;&#31435;<STRONG>&#32593;&#32476;&#30340;&#32593;&#32476;</STRONG>&#65288;<EM>network of network</EM>&#65289;&#65292;&#20026;&#20102;&#26356;&#22909;&#35299;&#37322;&#20160;&#20040;&#26159;&#32593;&#32476;&#30340;&#32593;&#32476;&#65292;&#25105;&#20204;&#19981;&#22952;&#20197;&#36880;&#28176;&#22686;&#21152;&#22797;&#26434;&#24230;&#30340;&#24418;&#24335;&#65292;&#23637;&#29616;&#20170;&#22825;&#20114;&#32852;&#32593;&#30340;&#26679;&#23376;</FONT></P>
<H4 id=&#32593;&#32476;&#32467;&#26500;&#19968;><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#32467;&#26500;&#19968;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#26368;&#31616;&#21333;&#65292;&#30452;&#25509;&#30340;&#26041;&#27861;&#26159;&#23558;&#25152;&#26377;&#30452;&#25509;&#19982;&#32456;&#31471;&#29992;&#25143;&#30452;&#25509;&#23545;&#25509;&#30340; ISP &#29992;&#19968;&#20010;&#26356;&#22823;&#30340;&#12289;&#20840;&#29699;&#24615;&#30340; ISP &#36830;&#25509;&#36215;&#26469;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#30001;&#20110;&#24213;&#23618; ISP &#23454;&#38469;&#19978;&#38656;&#35201;&#21521;&#20840;&#29699; ISP &#25903;&#20184;&#21521;&#20854;&#23427;&#24213;&#23618; ISP &#36890;&#20449;&#26102;&#25152;&#20135;&#29983;&#30340;&#36153;&#29992;&#65288;&#27605;&#31455;&#26159;&#36825;&#20010;&#20840;&#29699;&#36816;&#33829;&#21830;&#23558;&#36825;&#20004;&#20010; ISP &#36830;&#25509;&#36215;&#26469;&#30340;&#65289;&#22240;&#27492;&#25105;&#20204;&#19981;&#22952;&#23558;&#36825;&#20010;<U>&#25317;&#26377;&#20132;&#25442;&#25968;&#25454;&#38656;&#27714;&#30340; ISP</U><SPAN>&nbsp;</SPAN>&#31216;&#20026;<STRONG>&#28040;&#36153;&#32773;</STRONG>&#65288;<EM>customer</EM>&#65289;&#65292;&#23558;<U>&#36830;&#25509;&#21508;&#24213;&#23618; ISP &#30340;&#20840;&#29699; ISP</U><SPAN>&nbsp;</SPAN>&#31216;&#20026;<STRONG>&#25552;&#20379;&#32773;</STRONG>&#65288;<EM>provider</EM>&#65289;</FONT></P>
<H4 id=&#32593;&#32476;&#32467;&#26500;&#20108;><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#32467;&#26500;&#20108;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#24456;&#26174;&#28982;&#65292;&#24403;&#32593;&#32476;&#30340;&#35268;&#27169;&#32487;&#32493;&#22686;&#22823;&#65292;&#21333;&#20010;&#30340;&#20840;&#29699; ISP &#24050;&#32463;&#19981;&#36275;&#20197;&#28385;&#36275;&#24066;&#22330;&#30340;&#38656;&#27714;&#20102;&#12290;&#20026;&#27492;&#33258;&#28982;&#20250;&#20986;&#29616;&#22810;&#23478;&#20840;&#29699;&#24615;&#30340; ISP&#65292;&#36825;&#20123; ISP &#24444;&#27492;&#30456;&#36830;&#65292;&#26500;&#25104;&#26356;&#21152;&#22797;&#26434;&#30340;&#32593;&#36335;</FONT></P>
<H4 id=&#32593;&#32476;&#32467;&#26500;&#19977;><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#32467;&#26500;&#19977;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#26377;&#26102;&#20505;&#65292;&#22312;&#19968;&#20123;&#32593;&#27665;&#25968;&#37327;&#24040;&#22823;&#30340;&#22320;&#21306;&#65292;&#20165;&#19968;&#20010;&#20840;&#29699; ISP &#20063;&#19981;&#36275;&#20197;&#28040;&#32791;&#25152;&#26377;&#30340;&#25509;&#20837;&#32593;&#32476;&#38656;&#27714;&#12290;&#22522;&#20110;&#27492;&#65292;&#20986;&#29616;&#20102;<STRONG>&#22320;&#21306;&#24615; ISP</STRONG>&#65288;<EM>regional ISP</EM>&#65289;&#29992;&#20197;&#23558;&#24213;&#23618; ISP &#36830;&#25509;&#36215;&#26469;&#65292;&#20877;&#23558;&#25968;&#25454;&#36716;&#21457;&#21040;<STRONG>&#31532;&#19968;&#23618;&#32593;&#32476;</STRONG>&#65288;<EM>tier-1 ISP</EM>&#65289;&#20013;<SUP class=md-footnote><A href="file:///C:/Users/qbacpey/Desktop/1.Introduction2.html#dfref-footnote-15" name=ref-footnote-15>15</A></SUP></FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#24635;&#30340;&#26469;&#35828;&#65292;&#32593;&#32476;&#32467;&#26500;&#19977;&#22823;&#33268;&#21576;&#65306;&#32456;&#31471;&#31995;&#32479; =&gt; &#24213;&#23618; ISP =&gt; &#22320;&#21306;&#24615; ISP =&gt; &#31532;&#19968;&#23618;&#32593;&#32476; ISP</FONT></P>
<H4 id=&#32593;&#32476;&#32467;&#26500;&#22235;><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#32467;&#26500;&#22235;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#24403;&#28982;&#65292;&#20170;&#22825;&#30340;&#32593;&#32476;&#24456;&#26174;&#28982;&#19981;&#20165;&#20165;&#26159;&#31616;&#21333;&#30340;&#12289;&#30001; ISP &#36816;&#34892;&#21830;&#24418;&#25104;&#30340;&#23618;&#32423;&#32467;&#26500;&#36825;&#20040;&#31616;&#21333;&#12290;&#38500;&#20102;&#23618;&#32423;&#32467;&#26500;&#26412;&#36523;&#65292;&#32593;&#32476;&#20013;&#36824;&#21253;&#25324;&#21508;&#31181;&#21508;&#26679;&#30340;&#29289;&#29702;&#22522;&#30784;&#35774;&#26045;&#65306;<U>&#20837;&#32593;&#28857;</U>&#65288;<EM>points of presence</EM>&#65289;&#12289;<U>&#22810;&#23487;&#20027;</U>&#65288;<EM>mult-homing</EM>&#65289;&#12289;<U>&#23545;&#31561;&#36830;&#25509;</U>&#65288;<EM>peering</EM>&#65289;&#20197;&#21450;<U>&#20114;&#32852;&#32593;&#20132;&#25442;&#20013;&#24515;</U>&#65288;<EM>internet exchange points</EM>&#65289;</FONT></P>
<P><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#20837;&#32593;&#28857;</FONT></STRONG></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">PoP &#23454;&#38469;&#19978;&#23601;&#26159;&#19968;&#20010;<U>&#25552;&#20379;&#32773;</U>&#65288;provider&#65289;&#25918;&#32622;&#36335;&#30001;&#22120;&#30340;&#22320;&#26041;&#65292;&#28040;&#36153;&#32773;&#33021;&#22312;&#36825;&#37324;&#25509;&#20837;&#25552;&#20379;&#32773;&#30340;&#32593;&#32476;</FONT></P>
<P><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#22810;&#23487;&#20027;</FONT></STRONG></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">Mult-home &#25351;&#30340;&#26159;&#19968;&#20010;&#32456;&#31471;&#31995;&#32479;&#25110;&#32773;&#28040;&#36153;&#32773;&#36873;&#25321;&#25509;&#20837;&#20102;&#22810;&#20010;&#25552;&#20379;&#32773;&#65292;&#20174;&#32780;&#30830;&#20445;&#20854;&#20013;&#19968;&#20010;&#25552;&#20379;&#32773;&#20986;&#29616;&#38382;&#39064;&#26102;&#19981;&#33267;&#20110;&#27809;&#26377;&#32593;&#32476;&#21487;&#29992;</FONT></P>
<P><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#23545;&#31561;&#36830;&#25509;</FONT></STRONG></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#23545;&#31561;&#36830;&#25509;&#26159;&#19968;&#31181;&#20026;&#20102;&#20943;&#23569;&#32593;&#32476;&#36890;&#20449;&#33457;&#36153;&#32780;&#20351;&#29992;&#30340;&#38142;&#25509;&#26041;&#24335;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#21407;&#26412;&#22914;&#26524;&#20004;&#20010;&#24213;&#23618; ISP &#24819;&#35201;&#30456;&#20114;&#36830;&#25509;&#30340;&#35805;&#24517;&#39035;&#20808;&#35201;&#23558;&#25968;&#25454;&#19978;&#20256;&#21040;&#22320;&#21306; ISP &#19978;&#65292;&#20877;&#30001;&#22320;&#21306; ISP &#23558;&#25968;&#25454;&#36716;&#21457;&#21040;&#21478;&#19968;&#20010;&#24213;&#23618; ISP &#19978;&#12290;&#20294;&#22914;&#26524;&#36825;&#20004;&#20010;&#24213;&#23618; ISP &#21457;&#29616;&#24444;&#27492;&#20043;&#38388;&#30452;&#25509;&#30456;&#36830;&#24182;&#36890;&#20449;&#30340;&#24320;&#38144;&#35201;&#36828;&#23567;&#20110;&#20043;&#21069;&#37319;&#29992;&#30340;&#26041;&#26696;&#65292;&#37027;&#20040;&#24456;&#33258;&#28982;&#30340;&#36825;&#20004;&#20010;&#22320;&#21306; ISP &#23601;&#33021;&#30452;&#25509;&#36890;&#20449;&#65292;&#36825;&#23601;&#26159;&#25152;&#35859;&#30340;<STRONG>&#23545;&#31561;&#36830;&#25509;</STRONG>&#65288;&#19968;&#33324;&#26469;&#35828;&#65292;&#23545;&#31561;&#36830;&#25509;&#24847;&#21619;&#30528;&#24182;&#19981;&#38656;&#35201;&#30456;&#20114;&#25903;&#20184;&#32593;&#32476;&#36830;&#25509;&#36153;&#29992;&#65289;</FONT></P>
<P><STRONG><FONT style="BACKGROUND-COLOR: #7be1e1">&#20114;&#32852;&#32593;&#20132;&#25442;&#20013;&#24515;</FONT></STRONG></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">IXP &#23454;&#38469;&#19978;&#23601;&#26159;&#19968;&#20010;&#30001;&#31532;&#19977;&#26041;&#25152;&#25552;&#20379;&#30340;&#24314;&#31569;&#29289;&#65292;&#22312;&#36825;&#20010;&#22320;&#26041;&#35768;&#22810; ISP &#21487;&#20197;&#23454;&#29616;&#30456;&#20114;&#20043;&#38388;&#30340;&#23545;&#31561;&#36830;&#25509;</FONT></P>
<H4 id=&#32593;&#32476;&#32467;&#26500;&#20116;><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#32467;&#26500;&#20116;</FONT></H4>
<P><FONT style="BACKGROUND-COLOR: #7be1e1">&#32593;&#32476;&#32467;&#26500;&#20116;&#22312;&#32593;&#32476;&#32467;&#26500;&#22235;&#30340;&#22522;&#30784;&#19978;&#28155;&#21152;&#20102;<STRONG>&#20869;&#23481;&#20998;&#21457;&#32593;&#32476;</STRONG>&#65288;<EM>content-provider network</EM>&#65289;&#65292;Google &#23601;&#26159;&#19968;&#20010;&#36825;&#26041;&#38754;&#30340;&#20363;&#23376;&#12290;Google &#30340;&#20869;&#23481;&#20998;&#21457;&#32593;&#32476;&#26159;&#19968;&#20010;&#29420;&#31435;&#30340;&#32593;&#32476;&#20307;&#31995;&#65292;&#23427;&#36890;&#36807;&#35753;&#20840;&#29699;&#21508;&#22320;&#30340; Google &#26381;&#21153;&#22120;&#65288;&#36825;&#20123;&#23567;&#22411;&#30340;&#25968;&#25454;&#20013;&#24515;&#36890;&#24120;&#20301;&#20110; IXP &#20013;&#65289;&#30452;&#25509;&#30456;&#36830;&#65292;&#32469;&#36807;<U>&#31532;&#19968;&#23618;&#32593;&#32476;</U>&#65292;&#35753;&#32456;&#31471;&#29992;&#25143;&#33021;&#26356;&#24555;&#30340;&#35775;&#38382;&#21040;&#20301;&#20110;&#20854;&#23427;&#22320;&#21306;&#30340; Google &#20869;&#23481;&#65306;</FONT></P>
<P><FONT style="BACKGROUND-COLOR: #7be1e1"><img style="HEIGHT: 297px; WIDTH: 527px" alt=image-20220306161628917 src="file:///D:/Computer%20Science/&#35745;&#31639;&#26426;&#32593;&#32476;/Note/1.Introduction.assets/image-20220306161628917.png" width=1000 height=515><BR><BR></FONT></P><FONT style="BACKGROUND-COLOR: #7be1e1">