<SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> G.7 General Tips</SPAN> 
<P></P>
<P><SPAN class=RefText></SPAN></FONT><SPAN class=extract></P>
<P>The page allocator in <STRONG>threads/palloc.c</STRONG> and the block allocator in <STRONG>threads/malloc.c</STRONG> clear all the bytes in memory to <STRONG>0xcc</STRONG> at time of free. </P>
<P>&#20869;&#23384;&#39029;&#20998;&#37197;&#22120;&#20301;&#20110;&#25991;&#20214; threads/palloc.c &#20013;</P>
<P>&#20869;&#23384;&#22359;&#20998;&#37197;&#22120;&#20301;&#20110;&#25991;&#20214; threads/malloc.c &#20013;</P>
<P>&#26080;&#35770;&#26159;&#20869;&#23384;&#39029;&#20998;&#37197;&#22120;&#36824;&#26159;&#20869;&#23384;&#22359;&#20998;&#37197;&#22120;&#22312;&#37322;&#25918;&#20869;&#23384;&#30340;&#26102;&#20505;&#65292;&#37117;&#20250;&#23558;&#20182;&#20204;&#25152;&#37322;&#25918;&#30340;&#20869;&#23384;&#20013;&#30340;&#20540;&#65292;&#35774;&#32622;&#20026; 0xcc</P></SPAN><SPAN class=extract>
<P>Thus, if you see an attempt to dereference a pointer like <STRONG>0xcccccccc</STRONG>, or some other reference to <STRONG>0xcc</STRONG>, there&#8217;s a good chance you&#8217;re trying to reuse a page that&#8217;s already been freed. </P>
<P>&#22914;&#26524;&#35265;&#21040;&#31243;&#24207;&#35797;&#22270;&#35299;&#24341;&#29992;&#19968;&#20010;&#20540;&#20026; <STRONG>0xcccccccc</STRONG>&nbsp;&#30340;&#25351;&#38024;&#65288;&#25110;&#32773;&#35828;&#35299;&#24341;&#29992;&#20043;&#21518;&#24471;&#21040;&#20102;&#36825;&#20010;&#20540;&#65289;&#37027;&#23601;&#20195;&#34920;&#31243;&#24207;&#27491;&#22312;&#35797;&#22270;&#36890;&#20449;&#20351;&#29992;&#19968;&#20010;&#24050;&#32463;&#34987;&#37322;&#25918;&#20102;&#30340;&#20869;&#23384;&#39029;</P></SPAN><SPAN class=extract>
<P>Also, byte <STRONG>0xcc</STRONG> is the cpu opcode for &#8220;invoke interrupt <STRONG>3</STRONG>,&#8221; so if you see an error like<STRONG> interrupt 0x03</STRONG> (#<STRONG>bp breakpoint exception</STRONG>), then Pintos tried to execute code in a freed page or block.</P>
<P>&#27492;&#22806;&#65292;0xcc &#20063;&#26159;&#25351;&#20196;&#8220;&#35843;&#29992;&#20013;&#26029; 3&#8221; &#30340; OPcode&#65292;&#22240;&#27492;&#22914;&#26524;&#35265;&#21040;&#20102;&#36825;&#26465;&#28040;&#24687;&#8220;<STRONG>interrupt 0x03</STRONG> (#<STRONG>bp breakpoint exception</STRONG>)&#8221; &#37027;&#23601;&#20195;&#34920; Pintos &#27491;&#22312;&#35797;&#22270;&#25191;&#34892;&#19968;&#20010;&#20301;&#20110;&#24050;&#32463;&#37322;&#25918;&#20102;&#30340;&#20869;&#23384;&#39029;&#65288;&#25110;&#20869;&#23384;&#22359;&#20013;&#30340;&#20195;&#30721;&#65289;</P></SPAN><SPAN class=extract>
<P>An assertion failure on the expression <STRONG>sec_no &lt; d-&gt;capacity</STRONG> indicates that Pintos tried to access a &#64257;le through an inode that has been closed and freed. Freeing an inode clears its starting sector number to <STRONG>0xcccccccc</STRONG>, which is not a valid sector number for disks smaller than about 1.6 TB.</P>
<P>&#20851;&#38381;&#24182;&#37322;&#25918;&#19968;&#20010;&#32034;&#24341;&#33410;&#28857;&#20250;&#23558;&#36825;&#20010;&#32034;&#24341;&#33410;&#28857;&#30340;&#20540;&#35774;&#32622;&#20026; 0xcccccccc&#65292;&#22240;&#27492;&#22914;&#26524;&#36825;&#20010;&#26029;&#35328;&#20986;&#29616;&#20102;&#38169;&#35823;&#65288;<STRONG>sec_no &lt; d-&gt;capacity</STRONG> &#65289;&#37027;&#23601;&#20195;&#34920;&#31243;&#24207;&#27491;&#22312;&#35797;&#22270;&#36890;&#36807;&#19968;&#20010;&#24050;&#32463;&#34987;&#37322;&#25918;&#20102;&#30340;&#32034;&#24341;&#33410;&#28857;&#35775;&#38382;&#26576;&#20010;&#25991;&#20214;&#65288;&#27605;&#31455;&#36825;&#20010;&#32034;&#24341;&#33410;&#28857;&#20540;&#23545;&#20110;&#20219;&#20309;&#23567;&#20110; 1.6 TB &#30340;&#30828;&#30424;&#26469;&#35828;&#37117;&#26159;&#19981;&#21512;&#27861;&#30340;&#65289;</P>
<P></SPAN>