<SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> B.8 Adding New Tests to Pintos</SPAN></FONT> 
<P></P><SPAN class=extract>
<P>Pintos also comes with its own testing framework that allows you to design and run your own tests. For this project, you will also be required to extend the current suite of tests with a few tests of your own. All of the &#64257;le system and userprog tests are &#8220;user program&#8221; tests, which means that they are only allowed to interact with the kernel via system calls.</P>
<P>&#25152;&#26377;&#25991;&#20214;&#31995;&#32479;&#27979;&#35797;&#21644;&#29992;&#25143;&#31243;&#24207;&#65288;userprog&#65289;&#27979;&#35797;&#26412;&#36136;&#37117;&#26159;&#29992;&#25143;&#31243;&#24207;&#65292;&#36825;&#20063;&#23601;&#24847;&#21619;&#30528;&#20182;&#20204;&#22914;&#26524;&#24819;&#35201;&#21644;&#20869;&#26680;&#20132;&#20114;&#30340;&#35805;&#65292;&#38656;&#35201;&#36890;&#36807;&#31995;&#32479;&#35843;&#29992;&#26469;&#23454;&#29616;</P></SPAN><SPAN class=extract>
<P>Some things to keep in mind while writing your test cases: </P>
<P>&#20889;&#27979;&#35797;&#29992;&#20363;&#26102;&#38656;&#35201;&#27880;&#24847;&#20197;&#19979;&#20960;&#28857;&#65306;</P>
<P>&#8226; User programs have access to a limited subset of the C standard library. You can &#64257;nd the user library in lib/.</P>
<P>&#29992;&#25143;&#31243;&#24207;&#21482;&#33021;&#35775;&#38382; C &#26631;&#20934;&#24211;&#30340;&#26576;&#20010;&#23376;&#38598;&#65292;&#20855;&#20307;&#26469;&#35828;&#23601;&#26159; lib/ &#19979;&#30340;&#21508;&#31181;&#24211;&#20989;&#25968;&#65288;&#37027;&#20123;&#20026; pintos &#19978;&#36816;&#34892;&#30340;&#29992;&#25143;&#31243;&#24207;&#23450;&#20041;&#30340;&#20989;&#25968;&#65289;</P>
<P>&#8226; User programs cannot directly access variables in the kernel. </P>
<P>&#29992;&#25143;&#31243;&#24207;&#65288;&#27979;&#35797;&#29992;&#20363;&#65289;&#19981;&#33021;&#30452;&#25509;&#35775;&#38382;&#20869;&#26680;&#20013;&#30340;&#21464;&#37327;</P>
<P>&#8226; User programs do not have access to malloc, since brk and sbrk are not implemented. User programs also have a limited stack size. If you need a large bu&#64256;er, make it a static global variable. </P>
<P>&#29992;&#25143;&#31243;&#24207;&#19981;&#33021;&#30452;&#25509;&#20351;&#29992; malloc&#65288;brk &#21644; sbrk &#26242;&#26102;&#27809;&#26377;&#23454;&#29616;&#65289;&#21516;&#26102;&#65292;&#27979;&#35797;&#29992;&#20363;&#31243;&#24207;&#20063;&#21482;&#33021;&#26377;&#19968;&#20010;&#21463;&#38480;&#30340;&#26632;&#31354;&#38388;&#65292;&#22914;&#26524;&#38656;&#35201;&#19968;&#20010;&#22823;&#32531;&#23384;&#65292;&#38656;&#35201;&#23558;&#20854;&#22768;&#26126;&#20026;&#38745;&#24577;&#20840;&#23616;&#21464;&#37327;</P>
<P>&#8226; Pintos starts with 4 MB of memory and the &#64257;le system block device is 2 MB by default. Don&#8217;t use data structures or &#64257;les that exceed these sizes. </P>
<P>&#19968;&#26041;&#38754;&#65292;&#31243;&#24207;&#25968;&#25454;&#32467;&#26500;&#30340;&#22823;&#23567;&#19981;&#33021;&#36229;&#36807; 4MB&#65292;&#25991;&#20214;&#31995;&#32479;&#22359;&#22823;&#23567;&#20063;&#19981;&#33021;&#36229;&#36807; 2 MB&#65292;&#22240;&#27492;&#19981;&#33021;&#36229;&#36807;&#23427;&#20204;&#30340;&#22823;&#23567;</P>
<P>&#8226; Your test should use msg() instead of printf() (they have the same function signature).</P>
<P>&#27979;&#35797;&#29992;&#20363;&#31243;&#24207;&#38656;&#35201;&#20351;&#29992; msg() &#32780;&#19981;&#26159; printf() &#31243;&#24207;</P>
<P></SPAN><SPAN class=extract>&nbsp;</P>
<P>You can add new test cases to the userprog suite by modifying these &#64257;les: </P>
<P>&#22914;&#26524;&#24819;&#35201;&#20026; userprog &#20013;&#28155;&#21152;&#26032;&#30340;&#27979;&#35797;&#29992;&#20363;&#65292;&#37027;&#20040;&#38656;&#35201;&#20462;&#25913;&#22914;&#19979;&#20989;&#25968;</P></SPAN><STRONG><SPAN class=extract>
<P><STRONG>tests/userprog/Make.tests</STRONG> Entry point for the userprog test suite. You need to add the name of your test to the <STRONG>tests/userprog_TESTS</STRONG> variable, in order for the test suite to &#64257;nd it. Additionally, you will need to de&#64257;ne a variable named <STRONG>tests/userprog/my-test-1_SRC</STRONG> which contains all the &#64257;les that need to be compiled into your test (see the other test de&#64257;nitions for examples). You can add other source &#64257;les and resources to your tests, if you wish. </P>
<P>&#39318;&#20808;&#65292;&#38656;&#35201;&#22312; Make.tests &#30340; tests/userprog_TESTS &#21464;&#37327;&#20013;&#28155;&#21152;&#27979;&#35797;&#30340;&#21517;&#23383;&#65292;&#27492;&#22806;&#65292;&#36824;&#38656;&#35201;&#22312;&#35813;&#25991;&#20214;&#20013;&#23450;&#20041;&#19968;&#20010;&#21517;&#20026; tests/userprog/my-test-1_SRC &#30340;&#21464;&#37327;&#65292;&#20854;&#20013;&#21547;&#26377;&#25152;&#26377;&#38656;&#35201;&#21644;&#27979;&#35797;&#29992;&#20363;&#25991;&#20214;&#32534;&#35793;&#22312;&#19968;&#36215;&#30340;&#25991;&#20214;&#65288;&#19978;&#36848; my-test-1 &#23601;&#26159;&#33258;&#23450;&#20041;&#27979;&#35797;&#29992;&#20363;&#30340;&#21517;&#23383;&#65289;</P></SPAN></STRONG><STRONG><SPAN class=extract>
<P><STRONG>tests/userprog/my-test-1.c</STRONG> This is the test code for your test. Your test should de&#64257;ne a function called test_main, which contains a user-level program. This is the main body of your test case, which should make syscalls and print output. Use the msg() function instead of printf. </P>
<P>my-test-1.c &#23601;&#26159;&#27979;&#35797;&#29992;&#20363;&#30340;&#23454;&#38469;&#20195;&#30721;&#65292;&#20195;&#30721;&#20013;&#38656;&#35201;&#23450;&#20041;&#19968;&#20010;&#21517;&#20026; test_main &#30340;&#20989;&#25968;&#65292;&#20854;&#20013;&#23454;&#38469;&#19978;&#23601;&#21547;&#26377;&#27979;&#35797;&#29992;&#20363;&#30340;&#23454;&#38469;&#20195;&#30721;&#65292;&#23427;&#30340;&#20316;&#29992;&#23601;&#26159;&#25191;&#34892;&#31995;&#32479;&#35843;&#29992;&#24182;&#36755;&#20986;&#65288;&#27880;&#24847;&#20351;&#29992; msg&#65289;</P></SPAN></STRONG><STRONG><SPAN class=extract>
<P><STRONG>tests/userprog/my-test-1.ck</STRONG> Every test needs a .ck &#64257;le, which is a Perl script that checks the output of the test program. If you are not familiar with Perl, don&#8217;t worry! You can probably get through this part with some educated guessing. Your check script should use the subroutines that are de&#64257;ned in tests/tests.pm. At the end, call <STRONG>pass</STRONG> to print out the &#8220;PASS&#8221; message, which tells Pintos test driver that your test passed.</P>
<P>&#27599;&#20010;&#27979;&#35797;&#37117;&#38656;&#35201;&#19968;&#20010; .ck &#25991;&#20214;&#65292;&#20284;&#20046;&#26159; Pintos &#27979;&#35797;&#39537;&#21160;&#29992;&#26469;&#30830;&#35748;&#27979;&#35797;&#26159;&#21542;&#36890;&#36807;&#30340;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#36825;&#20010;&#27979;&#35797;&#33050;&#26412;&#38656;&#35201;&#35843;&#29992;&#23450;&#20041;&#22312; tests/test.pm &#20013;&#30340;&#20989;&#25968;&#65288;&#35821;&#35328;&#26159; Perl&#65289;</P>
<P></SPAN></STRONG>