<SPAN class=extract>First, we provide some background on the x86 architecture. The x86 is segmented, so pointers come in two parts: (i) a segment, a region of memory such as code, data, or stack, and (ii) an offset within that segment. 
<P></P>
<P>&#30001;&#20110;x86&#30340;&#20869;&#23384;&#32467;&#26500;&#26159;&#20998;&#27573;&#21270;&#65288;segmented&#65289;&#30340;&#65292;&#22240;&#27492;&#20854;&#20869;&#23384;&#25351;&#38024;&#30001;&#20004;&#37096;&#20998;&#32452;&#25104;&#65306;&#27573;&#65288;segment&#65289;&#25152;&#22312;&#20301;&#32622;&#21644;&#20559;&#31227;&#37327;&#65288;offset&#65289;</P></SPAN><SPAN class=extract>
<P>The current user-level instruction is a combination of the code segment (cs register) plus the instruction pointer (eip register). </P>
<P>&#29992;&#25143;&#25351;&#20196;&#30340;&#24403;&#21069;&#20301;&#32622;&#30001; `CS` &#23492;&#23384;&#22120;&#21644; `EIP` &#23492;&#23384;&#22120;&#20849;&#21516;&#25351;&#23450;</P>
<P>`CS` &#23492;&#23384;&#22120;&#25152;&#25351;&#21521;&#30340;&#20869;&#23481;&#26159;&#20195;&#30721;&#27573;&#25152;&#22312;&#20301;&#32622;&#65288;Code Segment&#65289;</P>
<P>`EIP` &#23492;&#23384;&#22120;&#25152;&#25351;&#21521;&#30340;&#20869;&#23481;&#26159;&#25351;&#20196;&#25351;&#38024;&#30340;&#20559;&#31227;&#37327;</P></SPAN><SPAN class=extract>
<P>Likewise, the current stack position is the combination of the stack segment (ss) and the stack pointer within the stack segment (esp). </P>
<P>&#24403;&#21069;&#26632;&#30340;&#25152;&#22312;&#20301;&#32622;&#30001; `SS` &#23492;&#23384;&#22120;&#21644; `ESP` &#23492;&#23384;&#22120;&#20849;&#21516;&#25351;&#23450;</P>
<P>`SS` &#23492;&#23384;&#22120;&#25152;&#25351;&#21521;&#30340;&#20869;&#23481;&#26159;&#24403;&#21069;&#26632;&#30340;&#25152;&#22312;&#20301;&#32622;&#65288;&#21363;&#21487;&#33021;&#26159;&#29992;&#25143;&#26632;&#65292;&#20063;&#21487;&#33021;&#26159;&#20869;&#26680;&#26632;&#65289;</P>
<P>`ESP` &#23492;&#23384;&#22120;&#25152;&#25351;&#21521;&#30340;&#20869;&#23481;&#26159;&#26632;&#25351;&#38024;&#30340;&#20559;&#31227;&#37327;</P></SPAN><SPAN class=extract>
<P>The current privilege level is stored as the low-order bits of the cs register rather than in the processor status word (eflags register). </P>
<P>&#24403;&#21069;&#25152;&#22788;&#29305;&#26435;&#31561;&#32423;&#20250;&#34987;&#20445;&#23384;&#21040; `CS` &#23492;&#23384;&#22120;&#30340;&#20302;&#27604;&#29305;&#20301;&#19978;</P>
<P>&#22788;&#29702;&#22120;&#29366;&#24577;&#23383;&#65288;Processor Status Word&#65289;&#20250;&#34987;&#20445;&#23384;&#21040; `EFLAG` &#23492;&#23384;&#22120;&#20013;</P></SPAN><SPAN class=extract>
<P>The eflags register has condition codes that are modified as a by-product of executing instructions; the eflags register also has other flags that control the processor&#8217;s behavior, such as whether interrupts are masked or not.</P>
<P>`EFLAG` &#23492;&#23384;&#22120;&#20013;&#20027;&#35201;&#20445;&#23384;&#30340;&#26159;&#19968;&#20123;&#25511;&#21046;&#27604;&#29305;&#20301;&#65292;&#27604;&#22914;&#35828;&#24403;&#21069;&#20013;&#26029;&#26159;&#21542;&#34987;&#31105;&#29992;</P>
<P></SPAN>