<STRONG><FONT color=blue>Implementing threads : User-level thread scheduling : </FONT></STRONG>
<H3 id=cooperative-scheduling-of-user-level-threads><SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> Implementing threads : User-level thread scheduling : Cooperative scheduling of user-level threads</SPAN></FONT></H3><SPAN class=extract>
<P>The cooperative model is similar to multiprogramming where a process executes on the CPU until making a I/O request.</P>
<P>&#22810;&#36947;&#31243;&#24207;&#31995;&#32479;&#19978;&#30340;&#36827;&#31243;&#20250;&#19968;&#30452;&#25191;&#34892;&#30452;&#21040;&#21457;&#20986; IO &#35831;&#27714;&#35753;&#20986; CPU &#26102;&#38388;</P></SPAN><SPAN class=extract>
<P>Cooperative user-level threads execute on the assigned kernel-level thread until they voluntarily give back the kernel thread to the thread manager.</P>
<P>&#21327;&#20316;&#24335;&#35843;&#24230;&#20013;&#30340;&#29992;&#25143;&#32423;&#32447;&#31243;&#20250;&#19968;&#30452;&#22312;&#20869;&#26680;&#32447;&#31243;&#19978;&#25191;&#34892;&#65292;&#30452;&#21040;&#23427;&#33258;&#24895;&#35753;&#20986;&#20869;&#26680;&#32447;&#31243;</P></SPAN><SPAN class=extract>
<P>In the cooperative model, threads<SPAN>&nbsp;</SPAN><STRONG>yield</STRONG><SPAN>&nbsp;</SPAN>to each other, either explicitly (e.g., by calling a<SPAN>&nbsp;</SPAN><CODE><FONT face="Courier New">yield()</FONT></CODE><SPAN>&nbsp;</SPAN>provided by the user-level thread library) or implicitly (e.g., requesting a lock held by another thread). </P>
<P>&#21327;&#20316;&#24335;&#35843;&#24230;&#20013;&#32447;&#31243;&#26082;&#21487;&#20197;&#36890;&#36807;&#26174;&#24335;&#30340;&#26041;&#24335;&#35753;&#20986; CPU&#65288;yield&#65289;&#20063;&#21487;&#20197;&#38544;&#24335;&#30340;&#35753;&#20986; CPU&#65288;&#35831;&#27714;&#19968;&#20010;&#20026;&#20854;&#20182;&#32447;&#31243;&#25345;&#26377;&#30340;&#38145;&#65289;</P></SPAN>
<P><SPAN class=extract>&#35843;&#24230;&#27169;&#24335;&#25351;&#30340;&#26159;&#25250;&#20808;&#35843;&#24230;&#12289;&#21327;&#20316;&#35843;&#24230;&#12289;&#28151;&#21512;&#35843;&#24230;&#36825;&#19977;&#31181;&#65307;&#32447;&#31243;&#31995;&#32479;&#27169;&#24335;&#25351;&#30340;&#26159;&#19968;&#23545;&#19968;&#12289;&#22810;&#23545;&#19968;&#12289;&#22810;&#23545;&#22810;&#12289;&#20004;&#23618;&#36825;&#22235;&#31181;</SPAN></P>
<P><SPAN class=extract>In the below figure a many-to-one system with cooperative user-level threads is shown.</SPAN></P>
<P><A href="http://www.it.uu.se/education/course/homepage/os/vt18/images/module-4/cooperative.png?height=333px" data-featherlight="image"><img style="HEIGHT: 207px; WIDTH: 314px" alt="" src="http://www.it.uu.se/education/course/homepage/os/vt18/images/module-4/cooperative.png?height=333px" width=631 height=441></A>