<strong><font color="blue"> : </font></strong>regard</P>
<P>ADMIRATION/RESPECT &#25964;&#20329;/&#23562;&#25964; [uncountable] respect and admiration for someone or something &#23562;&#25964;&#65307;&#25964;&#20329;
<P>regard for
<P>&nbsp;Jan&#8217;s regard for his great talent
<P>&#31616;&#23545;&#20182;&#21331;&#36234;&#25165;&#33021;&#30340;&#25964;&#20329;
<P>&nbsp;Burt had high regard for his old law professor, Dr. Finch (=he respected him a lot).
<P>&#20271;&#29305;&#23545;&#20182;&#20197;&#21069;&#30340;&#27861;&#24459;&#25945;&#25480;&#33452;&#22855;&#21338;&#22763;&#38750;&#24120;&#25964;&#37325;&#12290;
<P>&nbsp;The voters hold her in high regard (=respect or admire her).
<P>&#36873;&#27665;&#37117;&#24456;&#23562;&#25964;&#22905;&#12290;
<P>&nbsp;Teachers are held in low regard in this society (=are not respected or admired).
<P>&#25945;&#24072;&#22312;&#36825;&#20010;&#31038;&#20250;&#37324;&#19981;&#21463;&#23562;&#37325;&#12290;
<P>2&#8195; ATTENTION/CONSIDERATION &#20851;&#27880;/&#32771;&#34385; [uncountable] formal attention or consideration that is shown towards someone or something &#20851;&#27880;&#65292;&#20851;&#24515;
<P>regard for
<P>&nbsp;She has no regard for other people&#8217;s feelings.
<P>&#22905;&#26080;&#35270;&#21035;&#20154;&#30340;&#24863;&#21463;&#12290;
<P>pay/show regard
<P>&nbsp;One must show proper regard for the law.
<P>&#27599;&#20010;&#20154;&#37117;&#24517;&#39035;&#23545;&#27861;&#24459;&#34920;&#31034;&#24212;&#26377;&#30340;&#23562;&#37325;&#12290;
<P>little/no/scant regard (for somebody/something)
<P>&nbsp;The present administration has demonstrated little regard for environmental issues.
<P>&#29616;&#20219;&#25919;&#24220;&#23545;&#29615;&#22659;&#38382;&#39064;&#20851;&#27880;&#29978;&#23569;&#12290;
<P>&nbsp;All students must have access to quality education without regard to wealth or class.
<P>&#25152;&#26377;&#30340;&#23398;&#29983;&#65292;&#19981;&#35770;&#36139;&#23500;&#21644;&#38454;&#32423;&#65292;&#37117;&#24517;&#39035;&#20139;&#26377;&#25509;&#21463;&#39640;&#36136;&#37327;&#25945;&#32946;&#30340;&#26435;&#21033;&#12290;
<P>3&#8195; with/in regard to something&nbsp;formal relating to a particular subject &#20851;&#20110;&#26576;&#20107;&#65307;&#23545;&#20110;&#26576;&#20107;
<P>&nbsp;US foreign policy with regard to Cuba
<P>&#32654;&#22269;&#23545;&#21476;&#24052;&#30340;&#22806;&#20132;&#25919;&#31574;
<P>4&#8195; in this/that regard&nbsp;formal relating to something you have just mentioned &#22312;&#36825;&#26041;&#38754;&#65292;&#20851;&#20110;&#27492;&#20107;&#12308;&#25351;&#19982;&#21069;&#25991;&#25552;&#21040;&#30340;&#20869;&#23481;&#26377;&#20851;&#12309;
<P>&nbsp;The company&#8217;s problems, in this regard, are certainly not unique.
<P>&#20174;&#36825;&#26041;&#38754;&#26469;&#35762;&#65292;&#36825;&#20123;&#38382;&#39064;&#26080;&#30097;&#24182;&#38750;&#35813;&#20844;&#21496;&#25152;&#29420;&#26377;&#12290;
<P>5&#8195; regards&nbsp;[plural] good wishes &#8211; used when sending your good wishes to someone or when ending a short letter or message &#33268;&#24847;&#65292;&#38382;&#20505;&#12308;&#29992;&#20110;&#34920;&#36798;&#38382;&#20505;&#25110;&#32467;&#26463;&#31616;&#30701;&#30340;&#20449;&#20989;&#12309;
<P>&nbsp;My husband sends his regards.
<P>&#25105;&#19976;&#22827;&#21521;&#20320;&#38382;&#22909;&#12290;
<P>&nbsp;Hope to see you soon. Regards, Chris
<P>&#24076;&#26395;&#24456;&#24555;&#35265;&#21040;&#20320;&#12290; &#31069;&#23433;&#65292;&#20811;&#37324;&#26031;
<P>(with) kind/best regards (=used to end a letter in a friendly but rather formal way) &#35880;&#33268;&#38382;&#20505;&#12308;&#21451;&#22909;&#20294;&#27604;&#36739;&#27491;&#24335;&#30340;&#38382;&#20505;&#65292;&#29992;&#20110;&#20449;&#30340;&#26411;&#23614;&#12309;
<P>6. [singular] literary a long look without moving your eyes &#27880;&#35270;&#65292;&#20957;&#35270;