Figure&nbsp;<A data-ixbpernmnjoud4qz9ktzkg='{"name": "OEBPS/Text/part0000.xhtml", "frag": "x1-430019"}'>2.9</A> summarizes the various states of a process&#8217;s user and kernel stacks: 
<P></P>
<UL class=itemize1>
<LI class=itemize>
<P>If the process is running on the processor in user mode, its kernel stack is empty, ready to be used for an interrupt, processor exception, or system call. <BR><SPAN class=extract>&#24403;&#36827;&#31243;&#27491;&#22312;&#29992;&#25143;&#24577;&#25191;&#34892;&#26102;&#65292;&#20869;&#26680;&#26632;&#20026;&#31354;</SPAN>If the process is running on the processor in kernel mode &#8212; due to an interrupt, processor exception or system call &#8212; its kernel stack is in use, containing the saved registers from the suspended user-level computation as well as the current state of the kernel handler.<BR><SPAN class=extract>&#24403;&#36827;&#31243;&#22788;&#20110;&#20869;&#26680;&#24577;&#26102;&#65292;&#20869;&#26680;&#26632;&#20013;&#20250;&#21253;&#21547;&#36827;&#31243;&#34987;&#26242;&#20572;&#26102;&#30340;&#25152;&#26377;&#29366;&#24577;&#65292;&#21516;&#26102;&#20063;&#21253;&#21547;&#20869;&#26680;&#22788;&#29702;&#22120;&#30340;&#24403;&#21069;&#29366;&#24577; </SPAN>If the process is available to run but is waiting for its turn on the processor, its kernel stack contains the registers and state to be restored when the process is resumed. <BR><SPAN class=extract>&#24403;&#36827;&#31243;&#31561;&#24453;CPU&#31354;&#38386;&#26102;&#65292;&#20869;&#26680;&#26632;&#20013;&#20250;&#21253;&#21547;&#29992;&#25143;&#36827;&#31243;&#30340;&#29366;&#24577;</SPAN></P>
<LI class=itemize>
<P>If the process is waiting for an I/O event to complete, its kernel stack contains the suspended computation to be resumed when the I/O finishes.<BR><SPAN class=extract>&#24403;&#36827;&#31243;&#31561;&#24453;I/O&#23436;&#25104;&#30340;&#36807;&#31243;&#20013;&#65292;&#20869;&#26680;&#26632;&#20013;&#20250;&#21253;&#21547;&#24403;I/O&#23436;&#25104;&#26102;&#38656;&#35201;&#25509;&#32493;&#30340;&#35745;&#31639;&#36807;&#31243;&#65288;&#36825;&#24212;&#35813;&#23601;&#26159;&#20043;&#21069;&#25552;&#21040;&#30340;&#8220;&#19978;&#19979;&#25991;&#8221;&#65289;</SPAN></P></LI></UL>