<strong><font color="blue">coordinate : </font></strong>coordinate
<P>1&#8195; [transitive] to organize an activity so that the people involved in it work well together and achieve a good result &#21327;&#35843;&#12308;&#22810;&#20154;&#21442;&#21152;&#30340;&#27963;&#21160;&#12309;
<P>&nbsp;The agencies are working together to co-ordinate policy on food safety.
<P>&#36825;&#20123;&#26426;&#26500;&#22312;&#20849;&#21516;&#21512;&#20316;&#20026;&#39135;&#21697;&#23433;&#20840;&#25919;&#31574;&#20570;&#21327;&#35843;&#24037;&#20316;&#12290;
<P>2&#8195; [transitive] to make the parts of your body move and work together well &#21327;&#35843;&#65292;&#21327;&#21516;&#12308;&#36523;&#20307;&#21160;&#20316;&#12309;
<P>&nbsp;Her movements were beautifully co-ordinated.
<P>&#22905;&#21160;&#20316;&#21327;&#35843;&#65292;&#26174;&#24471;&#24456;&#20248;&#32654;&#12290;
<P>&nbsp;I couldn&#8217;t get my brain to function or coordinate my muscles.
<P>&#25105;&#26080;&#27861;&#35753;&#22823;&#33041;&#36816;&#20316;&#36215;&#26469;&#21327;&#35843;&#32908;&#32905;&#30340;&#36816;&#21160;&#12290;
<P>3&#8195; [intransitive, transitive] if clothes, decorations etc coordinate, or if you coordinate them, they look good together because they have similar colours and styles &#65288;&#20351;&#65289;&#12308;&#34915;&#26381;&#12289;&#35013;&#39280;&#31561;&#12309;&#25645;&#37197;&#65292;&#21327;&#35843;
<P>&nbsp;Don&#8217;t be afraid to mix colours, as long as they co-ordinate.
<P>&#19981;&#35201;&#23475;&#24597;&#28151;&#25645;&#39068;&#33394;&#65292;&#21327;&#35843;&#23601;&#34892;&#12290;
<P>&nbsp;You might coordinate your curtains and cushions.
<P>&#20320;&#24212;&#35813;&#25226;&#31383;&#24088;&#21644;&#38752;&#22443;&#30340;&#39068;&#33394;&#25645;&#37197;&#22909;&#12290;
<P>coordinate with
<P>&nbsp;The cooker is green, to co-ordinate with the kitchen.
<P>&#21416;&#28790;&#26159;&#32511;&#33394;&#30340;&#65292;&#26159;&#20026;&#20102;&#21644;&#21416;&#25151;&#30340;&#39068;&#33394;&#21327;&#35843;&#12290;