<SPAN class=extract>To carry out an input, output or memory-to-memory operation, the host processor initializes the DMA controller with a count of the number of<SPAN>&nbsp;</SPAN><A title="Word (computer architecture)" href="https://en.wikipedia.org/wiki/Word_(computer_architecture)">words</A><SPAN>&nbsp;</SPAN>to transfer, and the memory address to use. 
<P></P>
<P>CPU &#20250;&#20351;&#29992;&#23558;&#35201;&#20256;&#36755;&#30340;&#25968;&#25454;&#30340;&#25968;&#30446;&#65292;&#20197;&#21450;&#30456;&#20851;&#30340;&#20869;&#23384;&#22320;&#22336;&#26469;&#21021;&#22987;&#21270; DMA &#25511;&#21046;&#22120;</P></SPAN><SPAN class=extract>
<P>The CPU then commands the peripheral device to initiate a data transfer. The DMA controller then provides addresses and read/write control lines to the system memory. </P>
<P>CPU &#38543;&#21518;&#20250;&#21629;&#20196;&#21608;&#36793;&#35774;&#22791;&#21021;&#22987;&#21270;&#25968;&#25454;&#20256;&#36755;&#65292;DMA &#25511;&#21046;&#22120;&#21017;&#20250;&#25226;&#22320;&#22336;&#21644;&#35835;&#20889;&#25511;&#21046;&#32447;&#25552;&#20379;&#32473;&#31995;&#32479;&#20869;&#23384;</P>
<P></SPAN><SPAN class=extract>Each time a byte of data is ready to be transferred between the peripheral device and memory, the DMA controller increments its internal address register until the full block</P>
<P>&#27599;&#24403;&#19968;&#20010; byte &#30340;&#25968;&#25454;&#20934;&#22791;&#22909;&#22312;&#21608;&#36793;&#35774;&#22791;&#21644;&#20869;&#23384;&#20043;&#38388;&#36827;&#34892;&#20256;&#36755;&#20102;&#65292;&#37027;&#20040; DMA &#25511;&#21046;&#22120;&#23601;&#20250;&#36882;&#22686;&#20869;&#37096;&#30340;&#22320;&#22336;&#23492;&#23384;&#22120;&#65292;&#30452;&#21040;&#25968;&#25454;&#22359;&#28385;&#20026;&#27490;&#65288;&#36825;&#37324;&#30340;&#25968;&#25454;&#22359;&#26159;&#20869;&#23384;&#25968;&#25454;&#22359;&#21527;&#65289;</P></SPAN>
<P>&#35828;&#21040;&#24213;&#65292;<SPAN class=extract>&#22914;&#26524;&#25968;&#25454;&#22359;&#28385;&#20102; DMA &#20250;&#20570;&#20160;&#20040;&#65311;&#37325;&#26032;&#21521; CPU &#30003;&#35831;&#20869;&#23384;&#21527;</SPAN>&#20063;&#23601;&#26159; <SPAN class=extract>DMA &#20351;&#24471; CPU &#20256;&#36755;&#25968;&#25454;&#30340;&#21333;&#20803;&#20174;&#23383;&#33410;&#21464;&#25104;&#20102; block<BR></SPAN>