<SPAN class=extract>
<P><STRONG>Errno. </STRONG>In UNIX, the return value of system calls is intentionally kept simple. For example, the UNIX read system call returns either the number of bytes read (if successful) or -1 (if there was a problem). Often, an application needs additional information about the cause of the error (e.g., permission error, disk offline, etc.). To provide this, the kernel sets a variable in the application memory, the errno, with a diagnostic code for the most recent system call. As UNIX originally had only one thread per process, there was no confusion: the errno referred to the most recent system call of that process.</P>
<P>&#22914;&#26524; UNIX &#20013;&#31995;&#32479;&#35843;&#29992;&#21457;&#29983;&#20102;&#38169;&#35823;&#65292;&#37027;&#20040;&#20869;&#26680;&#20250;&#22312;&#29992;&#25143;&#20869;&#23384;&#31354;&#38388;&#20013;&#35774;&#32622;&#26576;&#20010;&#21464;&#37327;&#30340;&#20540;&#65292;&#36825;&#20010;&#21464;&#37327;&#21483;&#20570; erron&#65292;&#20854;&#20869;&#23481;&#23601;&#26159;&#26368;&#36817;&#19968;&#27425;&#25191;&#34892;&#30340;&#31995;&#32479;&#35843;&#29992;&#30340;&#35786;&#26029;&#30721;&#65288;diagnostic code&#65289;&nbsp;</P></SPAN>
<P></P><SPAN class=extract>
<P>In a multi-threaded program, however, multiple threads can perform system calls concurrently. Rather than redefine the entire UNIX system call interface for a multi-threaded environment, errno is now a macro that maps to a thread-local variable containing the error code for that thread&#8217;s most recent system call</P>
<P>&#23545;&#20110;&#22810;&#32447;&#31243;&#31995;&#32479;&#65292;&#30001;&#20110;&#21487;&#33021;&#23384;&#22312;&#22810;&#20010;&#32447;&#31243;&#21516;&#26102;&#25191;&#34892;&#31995;&#32479;&#35843;&#29992;&#65292;&#31616;&#21333;&#22320;&#22312;&#29992;&#25143;&#20869;&#23384;&#31354;&#38388;&#20013;&#35774;&#32622; erron &#21487;&#33021;&#23601;&#34892;&#19981;&#36890;&#20102;&#12290;&#22240;&#27492;&#29616;&#22312;&#30340;&#23454;&#29616;&#26159;&#23558; erron &#20316;&#20026;&#19968;&#20010;&#33021;&#21644;&#32447;&#31243;&#26412;&#22320;&#21464;&#37327;&#26144;&#23556;&#30340;&#23439;&#65292;&#35813;&#32447;&#31243;&#26412;&#22320;&#21464;&#37327;&#20013;&#20445;&#23384;&#30340;&#23601;&#26159;&#35813;&#32447;&#31243;&#26368;&#36817;&#25191;&#34892;&#30340;&#31995;&#32479;&#35843;&#29992;<BR></P>
<P></SPAN>