While a thread waits for an event, it cannot make progress; therefore, it is not useful to run it. Rather than continuing to run the thread or storing the TCB on the scheduler&#8217;s ready list, the TCB is stored on the <EM><A data-9uzdtcnnj6xqoalwmdp3qa='{"name": "OEBPS/Text/part0000.xhtml", "frag": "glo:waiting list"}'>waiting list</A></EM> of some <EM>synchronization variable</EM> associated with the event. When the required event occurs, the operating system moves the TCB from the synchronization variable&#8217;s waiting list to the scheduler&#8217;s ready list, transitioning the thread from WAITING&nbsp;to READY 
<P></P>
<P><SPAN class=extract>&#24403;&#32447;&#31243;&#27491;&#22312;&#31561;&#24453;&#26576;&#20123;&#20107;&#20214;&#21457;&#29983;&#26102;&#65292;&#23427;&#30340; TLB&#20301;&#20110;&#31561;&#24453;&#38431;&#21015;&#65288;wait list&#65289;&#20013;</SPAN></P>
<P><SPAN class=extract>&#20934;&#22791;&#38431;&#21015;&#23646;&#20110;&#35843;&#24230;&#22120;</SPAN></P>
<P><SPAN class=extract>&#31561;&#24453;&#38431;&#21015;&#23646;&#20110;&#21516;&#27493;&#21464;&#37327;</SPAN></P>
<P><SPAN class=extract>&#35841;&#36127;&#36131;&#23558; TCB &#31227;&#20986;&#31561;&#24453;&#38431;&#21015;&#65311;OS</SPAN></P>
<P>&#36825;&#20010;&#25152;&#35859;&#30340;&#31561;&#24453;&#38431;&#21015;&#22909;&#20687;&#19981;&#26159;&#23646;&#20110;&#35843;&#24230;&#22120;&#30340;&#65288;scheduler's ready list&#65289;&#32780;&#26159;&#26576;&#20010;&#21516;&#27493;&#21464;&#37327;&#30340;&#31561;&#24453;&#38431;&#21015;&#65288;synchronization variable&#8217;s waiting list&#65289;<SPAN class=extract>&#19968;&#26086;&#30456;&#20851;&#20107;&#20214;&#21457;&#29983;&#20102;&#65292;TCB &#23601;&#20250;&#34987;&#31227;&#21160;&#21040;&#35843;&#24230;&#22120;&#30340;&#31561;&#24453;&#38431;&#21015;&#20013;&#21435;</SPAN></P>
<P>&#35843;&#24230;&#22120;&#30340;&#31561;&#24453;&#38431;&#21015;</P>
<P>&#36824;&#26377;&#36825;&#37324;&#30340;&#31561;&#24453;&#65292;&#20063;&#30830;&#23454;&#21360;&#35777;&#20102;&#20043;&#21069;&#25552;&#21040;&#30340;&#65292;<SPAN class=extract>&#32447;&#31243;&#20013;&#30340;&#31561;&#24453;&#26159;&#31561;&#24453;&#26576;&#20010;&#21464;&#37327;&#26465;&#20214;&#65288;variable condition&#65289;</SPAN>