<P class="md-end-block md-p" cid="n138" mdtype="paragraph"><SPAN class=md-plain md-inline="plain"><SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> &#31532;&#20108;&#31456;&#21069;&#19977;&#33410;&#31508;&#35760; : &#27169;&#24335;&#36716;&#25442; : &#22788;&#29702;&#22120;&#24322;&#24120;</SPAN></FONT></SPAN></P>
<P class="md-end-block md-p" cid="n174" mdtype="paragraph"><SPAN class=md-pair-s md-inline="underline"><U><SPAN class=md-plain md-inline="plain"><SPAN class=extract><SPAN class=md-pair-s md-inline="underline"><U><SPAN class=md-plain md-inline="plain">&#22788;&#29702;&#22120;&#24322;&#24120;</SPAN></U></SPAN><SPAN class=md-plain md-inline="plain">&#65288;</SPAN><SPAN class="md-pair-s " md-inline="em"><EM><SPAN class=md-plain md-inline="plain">Processor exception</SPAN></EM></SPAN><SPAN class=md-plain md-inline="plain">&#65289;&#26159;&#19968;&#31181;&#20351;&#22788;&#29702;&#22120;&#20174;&#29992;&#25143;&#27169;&#24335;&#36716;&#21464;&#20026;&#20869;&#26680;&#27169;&#24335;&#12289;&#30001;&#29992;&#25143;&#31243;&#24207;&#25152;&#24341;&#21457;&#30340;&#30828;&#20214;&#20107;&#20214;</SPAN></SPAN></SPAN></U></SPAN><SPAN class=md-plain md-inline="plain">&#65306;</SPAN></P>
<UL class=ul-list cid="n175" mdtype="list" data-mark="-">
<LI class=md-list-item cid="n176" mdtype="list_item">
<P class="md-end-block md-p" cid="n177" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#29992;&#25143;&#34892;&#20026;&#19981;&#24403;&#65306;<SPAN class=extract><SPAN class=md-plain md-inline="plain">&#22810;&#25968;&#24773;&#20917;&#19979;&#22788;&#29702;&#22120;&#24322;&#24120;&#37117;&#26159;&#30001;&#20110;</SPAN><SPAN class=md-pair-s md-inline="underline"><U><SPAN class=md-plain md-inline="plain">&#29992;&#25143;&#34892;&#20026;&#19981;&#24403;</SPAN></U></SPAN><SPAN class=md-plain md-inline="plain">&#32780;&#24341;&#36215;&#30340;&#65292;&#22914;&#20869;&#23384;&#36234;&#30028;&#12289;&#38500; 0&#12289;&#29992;&#19981;&#23545;&#40784;&#30340;&#22320;&#22336;&#35775;&#38382;&#20869;&#23384;&#65292;&#27492;&#26102;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#24448;&#24448;&#20250;&#36873;&#25321;&#30452;&#25509;&#32456;&#27490;&#36827;&#31243;</SPAN></SPAN></SPAN><SPAN class=md-plain md-inline="plain">&#65307;</SPAN></P>
<LI class=md-list-item cid="n178" mdtype="list_item">
<P class="md-end-block md-p" cid="n179" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#35843;&#35797;&#31243;&#24207;&#65306;&#20294;<SPAN class=extract><SPAN class=md-plain md-inline="plain">&#22788;&#29702;&#22120;&#24322;&#24120;&#20063;&#33021;&#34987;&#29992;&#26469;&#25191;&#34892;&#31243;&#24207;&#35843;&#35797;&#65292;&#27604;&#22914;&#35828;&#30001;&#26029;&#28857;&#25110;&#32773;&#35828;&#31243;&#24207;&#20013;&#26576;&#26465;&#20440;&#33719;&#25351;&#20196;&#23548;&#33268;&#30340;&#22788;&#29702;&#22120;&#24322;&#24120;&#65292;&#27492;&#26102;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#20250;&#23558;&#25511;&#21046;&#26435;&#36716;&#20132;&#32473;&#35843;&#35797;&#22120;&#65307;</SPAN></SPAN></SPAN></P></LI></UL>
<P class="md-end-block md-p" cid="n179" mdtype="paragraph"><SPAN class=md-plain md-inline="plain"><SPAN class=extract><SPAN class=md-plain md-inline="plain"></SPAN></SPAN></SPAN><SPAN class=md-plain md-inline="plain"><SPAN class=extract><SPAN class=md-plain md-inline="plain">&#22788;&#29702;&#22120;&#24322;&#24120;&#30340;&#20316;&#29992;&#36828;&#19981;&#27490;&#20445;&#25252;&#21644;&#35843;&#35797;&#65292;&#23427;&#36824;&#26159;</SPAN><SPAN class="md-pair-s " md-inline="strong"><STRONG><SPAN class=md-plain md-inline="plain">&#34394;&#25311;&#21270;</SPAN></STRONG></SPAN><SPAN class=md-plain md-inline="plain">&#24471;&#20197;&#23454;&#29616;&#30340;&#22522;&#30784;</SPAN></SPAN></SPAN><SPAN class=md-plain md-inline="plain">&#65292;&#21253;&#25324;&#65306;&#34394;&#25311;&#21270;&#22788;&#29702;&#22120;&#26550;&#26500;&#12289;&#34394;&#25311;&#21270;&#25972;&#20010;&#24213;&#23618;&#30828;&#20214;&#12289;&#36824;&#26377;&#34394;&#25311;&#21270;&#20869;&#23384;&#65306;</SPAN></P>
<UL class=ul-list cid="n181" mdtype="list" data-mark="+">
<LI class=md-list-item cid="n182" mdtype="list_item">
<P class="md-end-block md-p" cid="n183" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#34394;&#25311;&#21270;&#22788;&#29702;&#22120;&#26550;&#26500;&#65306;&#26089;&#26399;&#30340;&#22788;&#29702;&#22120;&#38480;&#20110;&#24615;&#33021;&#65288;&#21644;&#25351;&#20196;&#38598;&#65289;&#65292;&#19981;&#33021;&#25191;&#34892;&#28014;&#28857;&#25968;&#36816;&#31639;&#12290;&#22788;&#29702;&#22120;&#24322;&#24120;&#21487;&#20197;&#23558;&#24615;&#33021;&#20026;&#20195;&#20215;&#65292;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#24403;&#22788;&#29702;&#22120;&#25191;&#34892;&#21040;&#28014;&#28857;&#36816;&#31639;&#35821;&#21477;&#30340;&#26102;&#20505;&#65292;&#23427;&#20250;&#21457;&#20986;&#22788;&#29702;&#22120;&#24322;&#24120;&#65292;&#27492;&#26102;&#30340;&#20869;&#26680;&#19981;&#20250;&#20687;&#24448;&#24120;&#19968;&#26679;&#30452;&#25509;&#20013;&#26029;&#36827;&#31243;&#30340;&#25191;&#34892;&#65292;&#32780;&#26159;&#36873;&#25321;&#21435;&#25191;&#34892;&#19968;&#27573;&#28014;&#28857;&#25968;&#36816;&#31639;&#31243;&#24207;&#65292;&#25191;&#34892;&#23436;&#27605;&#31435;&#21363;&#24674;&#22797;&#21407;&#31243;&#24207;&#30340;&#25191;&#34892;&#65307;</SPAN></P>
<LI class=md-list-item cid="n184" mdtype="list_item">
<P class="md-end-block md-p" cid="n185" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#34394;&#25311;&#21270;&#24213;&#23618;&#30828;&#20214;&#65306;&#21363;&#34394;&#25311;&#26426;&#30340;&#19968;&#37096;&#20998;&#36816;&#34892;&#36923;&#36753;&#65292;&#24403;&#23458;&#25143;&#25805;&#20316;&#31995;&#32479;&#24819;&#35201;&#25191;&#34892;&#29305;&#26435;&#25351;&#20196;&#30340;&#26102;&#20505;&#65288;&#24448;&#24120;&#20869;&#26680;&#20250;&#30452;&#25509;&#20013;&#26029;&#36827;&#31243;&#30340;&#25191;&#34892;&#65289;&#65292;&#25509;&#21463;&#21040;&#22788;&#29702;&#22120;&#24322;&#24120;&#30340;&#23487;&#20027;&#20869;&#26680;&#20250;&#20195;&#20854;&#25191;&#34892;&#30456;&#24212;&#30340;&#29305;&#26435;&#25351;&#20196;&#24182;&#32487;&#32493;&#23458;&#25143;&#25805;&#20316;&#31995;&#32479;&#30340;&#25191;&#34892;&#65307;</SPAN></P>
<LI class=md-list-item cid="n186" mdtype="list_item">
<P class="md-end-block md-p" cid="n187" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#34394;&#25311;&#21270;&#20869;&#23384;&#65306;&#20174;&#23454;&#29616;&#19978;&#35762;&#65292;&#36825;&#23454;&#38469;&#19978;&#26159;&#23558;&#22788;&#29702;&#22120;&#35774;&#32622;&#25104;&#8220;&#19968;&#26086;&#35835;&#20889;&#21040;&#25351;&#23450;&#20869;&#23384;&#23601;&#24341;&#21457;&#22788;&#29702;&#22120;&#24322;&#24120;&#8221;&#12290;&#22914;&#26159;&#24403;&#31243;&#24207;&#20351;&#29992;&#32463;&#34394;&#25311;&#21270;&#25299;&#23637;&#20986;&#30340;&#20869;&#23384;&#26102;&#65292;&#20869;&#26680;&#23601;&#20250;&#31435;&#21363;&#20174;&#30828;&#30424;&#20013;&#21462;&#20986;&#25968;&#25454;&#25918;&#21040;&#30456;&#24212;&#30340;&#20301;&#32622;&#65292;&#38543;&#21518;&#24674;&#22797;&#31243;&#24207;&#30340;&#25191;&#34892;&#65307;</SPAN></P></LI></UL>