<H5 class="md-end-block md-heading" cid="n79" mdtype="heading"><SPAN class=md-plain md-inline="plain"><SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> &#31532;&#20108;&#31456;&#21069;&#19977;&#33410;&#31508;&#35760; : Base &amp; Bound</SPAN></FONT>&#65306;&#23454;&#29616;</SPAN></H5>
<P class="md-end-block md-p" cid="n80" mdtype="paragraph"><SPAN class="md-image md-img-loaded" md-inline="imgtag" data-src="D:\Computer Science\&#32654;&#26412;CS&#35838;\CS162\Note\2.&#20869;&#26680;&#25277;&#35937;.assets\image-20220319182437025.png"><img onerror=onImageErrorFunc(event) onload=onLoadedFuncForQuickAction(event) alt=image-20220319182437025 referrerpolicy="no-referrer" data-local-refresh="true"></SPAN></P>
<P class="md-end-block md-p" cid="n81" mdtype="paragraph"><SPAN class=md-plain md-inline="plain"><SPAN class=extract><SPAN class=md-plain md-inline="plain">Base &amp; bound &#20869;&#23384;&#20445;&#25252;&#25351;&#30340;&#26159;&#27599;&#24403;&#22788;&#29702;&#22120;&#22788;&#29702;&#19968;&#26465;&#25351;&#20196;&#30340;&#26102;&#20505;&#65292;&#37117;&#20250;&#26816;&#26597;&#36825;&#26465;&#25351;&#20196;&#26412;&#36523;&#21450;&#20854;&#23558;&#35201;&#25805;&#20316;&#30340;&#25968;&#25454;&#22312;&#20869;&#23384;&#20013;&#30340;&#22320;&#22336;&#26159;&#21542;&#22312; base &#23492;&#23384;&#22120;&#21644; bound &#23492;&#23384;&#25152;&#21010;&#23450;&#30340;&#33539;&#22260;&#20869;&#12290;&#19968;&#26086;&#36229;&#36807;&#36825;&#20010;&#33539;&#22260;&#65292;&#22788;&#29702;&#22120;&#20250;&#31435;&#21363;&#21457;&#20986;&#24322;&#24120;&#12289;&#26242;&#20572;&#31243;&#24207;&#12289;&#23558;&#25511;&#21046;&#26435;&#36716;&#20132;&#25805;&#20316;&#31995;&#32479;&#20869;&#26680;</SPAN></SPAN>&#12290;&#30456;&#20851;&#30340;&#25216;&#26415;&#32454;&#33410;&#22914;&#19979;&#65306;</SPAN></P>
<UL class=ul-list cid="n82" mdtype="list" data-mark="-">
<LI class=md-list-item cid="n83" mdtype="list_item">
<P class="md-end-block md-p" cid="n84" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">Base &amp; bound &#20381;&#25176;&#20110;&#20004;&#20010;&#20301;&#20110;&#22788;&#29702;&#22120;&#20869;&#37096;&#30340;&#23492;&#23384;&#22120;&#36827;&#34892;&#23454;&#29616;&#65292;&#25805;&#20316;&#31995;&#32479;&#20445;&#23384;&#36827;&#31243;&#26102;&#20063;&#20250;&#23558;&#36825;&#20004;&#20010;&#23492;&#23384;&#22120;&#19968;&#24182;&#20445;&#23384;&#12290;<SPAN class=extract>&#31616;&#21333;&#26469;&#35828;&#65292;&#23427;&#20204;&#20063;&#23646;&#20110;&#29366;&#24577;&#23492;&#23384;&#22120;&#30340;&#19968;&#31181;</SPAN>&#65307;</SPAN></P>
<LI class=md-list-item cid="n85" mdtype="list_item">
<P class="md-end-block md-p" cid="n86" mdtype="paragraph"><SPAN class=md-plain md-inline="plain"><SPAN class=extract><SPAN class=md-plain md-inline="plain">Base &amp; bound &#25152;&#21010;&#23450;&#30340;&#33539;&#22260;&#26159;&#29289;&#29702;&#22320;&#22336;&#31354;&#38388;&#20013;&#30340;&#19968;&#29255;&#21306;&#22495;&#65292;&#24182;&#19981;&#26159;&#34394;&#25311;&#20869;&#23384;&#31354;&#38388;&#20013;&#30340;&#19968;&#29255;&#21306;&#22495;</SPAN></SPAN>&#65307;</SPAN></P></LI></UL>
<P class="md-end-block md-p" cid="n87" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;<SPAN class=extract><SPAN class=md-plain md-inline="plain">&#23545;&#20110;&#20869;&#26680;&#36827;&#31243;&#26469;&#35828;&#65292;&#19981;&#23384;&#22312; Base &amp; Bound &#36825;&#20004;&#20010;&#27010;&#24565;&#65288;&#20869;&#26680;&#33021;&#35775;&#38382;&#31995;&#32479;&#20013;&#30340;&#25152;&#26377;&#20869;&#23384;&#65289;</SPAN></SPAN></SPAN></P>
<P class="md-end-block md-p" cid="n87" mdtype="paragraph"><SPAN class=md-plain md-inline="plain"><SPAN class=extract><SPAN class=md-plain md-inline="plain"></SPAN></SPAN></SPAN><SPAN class=md-plain md-inline="plain">Base &amp; Bound&#65306;&#24330;&#31471;</SPAN></P>
<P class="md-end-block md-p" cid="n89" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#30452;&#25509;&#20351;&#29992;&#29289;&#29702;&#22320;&#22336;&#23454;&#34892;&#20869;&#23384;&#20445;&#25252;&#30340; Base &amp; Bound &#23384;&#22312;&#38750;&#24120;&#22810;&#30340;&#38382;&#39064;&#65288;&#25193;&#24352;&#12289;&#36716;&#25442;&#12289;&#20849;&#20139;&#12289;&#20998;&#29255;&#65289;&#65306;</SPAN></P>
<UL class=ul-list cid="n90" mdtype="list" data-mark="-">
<LI class=md-list-item cid="n91" mdtype="list_item">
<P class="md-end-block md-p" cid="n92" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#22534;&#21644;&#26632;&#30340;&#22823;&#23567;&#21464;&#21160;&#65306;&#30001;&#20110; <SPAN class=extract>Base &amp; Bound &#20026;&#31243;&#24207;&#25152;&#20998;&#37197;&#20869;&#23384;&#30340;&#22823;&#23567;&#22312;&#31243;&#24207;&#34987;&#21152;&#36733;&#21040;&#20869;&#23384;&#30340;&#26102;&#20505;&#24050;&#32463;&#22266;&#23450;&#20102;</SPAN>&#65292;&#32771;&#34385;&#21040;&#22823;&#23567;&#21487;&#33021;&#21457;&#29983;&#21464;&#21160;&#30340;&#22534;&#21644;&#26632;&#65292;&#31350;&#31455;&#35201;&#20351;&#29992; Base &amp; Bound &#20026;&#20854;&#21010;&#23450;&#22810;&#22823;&#30340;&#20869;&#23384;&#26159;&#19968;&#20010;&#24456;&#38590;&#30830;&#23450;&#30340;&#38382;&#39064;&#65307;</SPAN></P>
<LI class=md-list-item cid="n93" mdtype="list_item">
<P class="md-end-block md-p" cid="n94" mdtype="paragraph"><SPAN class=md-plain md-inline="plain">&#20869;&#23384;&#20849;&#20139;&#65306;&#30001;&#20110; <SPAN class=extract>Base &amp; Bound &#31105;&#27490;&#19981;&#21516;&#36827;&#31243;&#35775;&#38382;&#23545;&#26041;&#30340;&#20869;&#23384;&#21306;&#22495;</SPAN>&#65292;&#35832;&#22914;&#20849;&#20139;&#20195;&#30721;&#20043;&#31867;&#30340;&#20107;&#20214;&#21487;&#33021;&#24456;&#38590;&#23454;&#29616;&#65307;</SPAN></P>
<LI class=md-list-item cid="n95" mdtype="list_item">
<P class="md-end-block md-p" cid="n96" mdtype="paragraph"><SPAN class=md-plain md-inline="plain"><SPAN class=extract><SPAN class=md-plain md-inline="plain">&#29289;&#29702;&#20869;&#23384;&#22320;&#22336;&#65306;&#24403;&#31243;&#24207;&#34987;&#32534;&#35793;&#21644;&#38142;&#25509;&#26102;&#65292;&#20854;&#20840;&#23616;&#21464;&#37327;&#21644;&#20989;&#25968;&#30340;&#22320;&#22336;&#37117;&#26159;&#30456;&#23545;&#20110;&#38236;&#20687;&#25991;&#20214;&#65288;ELF&#65289;&#30340;&#24320;&#22987;&#37096;&#20998;&#30456;&#23545;&#20915;&#23450;&#30340;&#65292;&#22240;&#27492;&#24403;&#31243;&#24207;&#34987;&#21152;&#36733;&#21040;&#20869;&#23384;&#26102;&#65292;&#20869;&#26680;&#24517;&#39035;&#20462;&#25913;&#36825;&#20123;&#22320;&#22336;&#20197;&#30830;&#20445;&#31243;&#24207;&#30340;&#27491;&#24120;&#36816;&#34892;</SPAN></SPAN>&#65307;</SPAN></P>
<LI class=md-list-item cid="n97" mdtype="list_item">
<P class="md-end-block md-p" cid="n98" mdtype="paragraph"><SPAN class=md-plain md-inline="plain"><SPAN class=extract><SPAN class=md-plain md-inline="plain">&#20869;&#23384;&#20998;&#29255;&#65306;&#30001;&#20110;&#31243;&#24207;&#20351;&#29992;&#30340;&#26159;&#29289;&#29702;&#22320;&#22336;&#65292;&#22240;&#27492;&#27599;&#20010;&#31243;&#24207;&#22312;&#20869;&#23384;&#20013;&#25152;&#21344;&#25454;&#30340;&#21306;&#22495;&#24517;&#28982;&#26159;&#19968;&#22359;&#36830;&#32493;&#30340;&#21306;&#22495;&#12290;&#26681;&#25454;&#31243;&#24207;&#35268;&#27169;&#30340;&#22823;&#23567;&#19981;&#21516;&#65292;&#36827;&#31243;&#25152;&#21344;&#25454;&#30340;&#31354;&#38388;&#22823;&#23567;&#33258;&#28982;&#20063;&#19981;&#31561;&#12290;&#22240;&#27492;&#24403;&#35745;&#31639;&#26426;&#36816;&#34892;&#19968;&#27573;&#26102;&#38388;&#20043;&#21518;&#65292;&#21487;&#33021;&#20250;&#20986;&#29616;&#27809;&#26377;&#36275;&#22815;&#30340;</SPAN><SPAN class=md-pair-s md-inline="underline"><U><SPAN class=md-plain md-inline="plain">&#36830;&#32493;</SPAN></U></SPAN><SPAN class=md-plain md-inline="plain">&#20869;&#23384;&#20379;&#26032;&#36827;&#31243;&#34987;&#21152;&#36733;&#21040;&#20869;&#23384;&#20013;</SPAN></SPAN></SPAN><SPAN class=md-plain md-inline="plain">&#65307;</SPAN></P></LI></UL>
<P class="md-end-block md-p" cid="n99" mdtype="paragraph"><SPAN class=md-plain md-inline="plain"><SPAN class=extract><SPAN class=md-plain md-inline="plain">&#20026;&#20102;&#35299;&#20915;&#19978;&#36848;&#38382;&#39064;&#65292;&#20986;&#29616;&#20102;&#34394;&#25311;&#22320;&#22336;&#36825;&#19968;&#32467;&#26500;</SPAN><BR></SPAN></SPAN>