&#9632;debate 
<P></P>
<P><SPAN class=extract>&#36825;&#20010;&#21450;&#29289;&#21160;&#35789;&#65288;&#24310;&#32493;&#24615;&#30340;&#21160;&#20316;&#65292;&#23646;&#31532;&#20108;&#31867;&#65289;&#65292;&#21407;&#24847;&#26159;&#8220;&#36777;&#35770;&#8221;&#65292;&#20294;&#26159;&#22914;&#26524;&#20027;&#35821;&#21482;&#26159;&#21333;&#29420;&#19968;&#20010;&#20154;&#65292;&#23601;&#19981;&#26159;&#8220;&#36777;&#35770;&#8221;&#65292;&#32780;&#26159;&#8220;&#24515;&#20013;&#29730;&#30952;&#26435;&#34913;&#8221;&#65292;&#21518;&#38754;&#36890;&#24120;&#25509;&#19978;&#19968;&#20010;&#38388;&#25509;&#30097;&#38382;&#21477;&#12290;&#12304;&#20363;&#22914;&#12305;Jack debated what to do. &#26480;&#20811;&#32771;&#34385;&#20102;&#19968;&#19979;&#24590;&#20040;&#21150;&#12290;/ I'm just debating whether to go or stay. &#25105;&#27491;&#22312;&#29730;&#30952;&#31350;&#31455;&#26159;&#21435;&#36824;&#26159;&#30041;&#12290;</SPAN></P>
<P><SPAN class=extract>&#20063;&#21487;&#20197;&#19981;&#25509;&#38388;&#25509;&#30097;&#38382;&#21477;&#65292;&#29992;debate with oneself&#34920;&#31034;&#8220;&#29369;&#35947;&#26435;&#34913;&#8221;&#12290;&#12304;&#20363;&#22914;&#12305;She debated with herself for a while, and then picked up the phone. &#22905;&#29369;&#35947;&#20102;&#19968;&#19979;&#65292;&#20110;&#26159;&#25343;&#36215;&#20102;&#30005;&#35805;&#26426;&#12290;</SPAN></P>
<P><SPAN class=extract>&#22914;&#26524;&#20027;&#35821;&#26159;&#22810;&#20010;&#20154;&#65292;debate&#21487;&#20197;&#25351;&#20182;&#20204;&#24444;&#27492;&#36827;&#34892;&#36777;&#35770;&#65292;&#20294;&#20063;&#21487;&#20197;&#25226;&#36825;&#20123;&#20154;&#30475;&#20316;&#19968;&#20010;&#25972;&#20307;&#65292;&#25351;&#20182;&#20204;&#20849;&#21516;&#19968;&#36215;&#8220;&#29730;&#30952;&#32771;&#34385;&#8221;&#12290;&#12304;&#20363;&#22914;&#12305;We're debating whether or not to go skiing this winter. &#25105;&#20204;&#27491;&#22312;&#29730;&#30952;&#20170;&#24180;&#20908;&#22825;&#21435;&#19981;&#21435;&#28369;&#38634;&#12290;</SPAN></P><SPAN class=extract>
<P>debate&#21518;&#38754;&#20063;&#21487;&#20197;&#19981;&#25509;&#38388;&#25509;&#30097;&#38382;&#21477;&#65292;&#32780;&#25509;&#19978;-ing&#21160;&#21517;&#35789; &#65292;&#24448;&#24448;&#34920;&#31034;&#26377;&#36807;&#36825;&#20010;&#25171;&#31639;&#20294;&#26159;&#32463;&#36807;&#32771;&#34385;&#21518;&#25171;&#28040;&#12290;&#12304;&#20363;&#22914;&#12305;I debated going back inside, but decided against it. &#25105;&#32771;&#34385;&#36807;&#35201;&#19981;&#35201;&#20877;&#22238;&#37324;&#38754;&#21435;&#65292;&#20294;&#26159;&#20915;&#23450;&#19981;&#22238;&#21435;&#12290;/ On several occasions he debated ignoring the light when there wasn't any cross-traffic, but he never did. &#26377;&#22909;&#20960;&#27425;&#65292;&#27809;&#26377;&#27178;&#30528;&#20132;&#21449;&#24320;&#26469;&#30340;&#36710;&#23376;&#65292;&#20182;&#30495;&#24819;&#38383;&#38383;&#32418;&#28783;&#65292;&#20294;&#26159;&#27809;&#26377;&#36825;&#26679;&#20570;&#12290;</P></SPAN>