<SPAN class=extract>Allocating a kernel stack per process makes it easier to switch to a new process inside an interrupt or system call handler. 
<P></P>
<P>For example, a timer interrupt handler might decide to give the processor to a different process. Likewise, a system call might need to wait for an I/O operation to complete; in the meantime, some other process should run.&nbsp;&nbsp;</P>
<P></P>
<P>&#20026;&#27599;&#19968;&#20010;&#36827;&#31243;&#37117;&#20998;&#37197;&#19968;&#20010;&#20013;&#26029;&#26632;&#26377;&#20160;&#20040;&#20248;&#28857;&#65311;</P>
<P>&#33021;&#35753;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#65288;&#20197;&#21450;&#31995;&#32479;&#35843;&#29992;&#65289;&#22312;&#20854;&#25191;&#34892;&#36807;&#31243;&#20013;&#26356;&#23481;&#26131;&#20999;&#25442;&#25191;&#34892;&#20854;&#20182;&#36827;&#31243;</P>
<P>&#20030;&#20010;&#20363;&#23376;&#65311;</P>
<P>&#35745;&#26102;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#21487;&#33021;&#22312;&#20854;&#25191;&#34892;&#36807;&#31243;&#20013;&#20915;&#23450;&#20999;&#25442;&#21040;&#20854;&#20182;&#36827;&#31243;&#30340;&#25191;&#34892;&#65307;&#31995;&#32479;&#35843;&#29992;&#31561;&#24453;I/O&#21709;&#24212;&#26102;&#65292;&#21487;&#20197;&#35753;&#22788;&#29702;&#22120;&#20999;&#25442;&#25191;&#34892;&#20854;&#20182;&#36827;&#31243;</P></SPAN><SPAN class=extract>
<P>With per-process stacks, to suspend a process, we store a pointer to its kernel stack in the process control block, and switch to the stack of the new process. We describe this mechanism in more detail in Chapter&nbsp;4. 
<P>&#24403;&#25105;&#20204;&#26242;&#20572;&#26576;&#20010;&#36827;&#31243;&#30340;&#25191;&#34892;&#26102;&#65292;&#25105;&#20204;&#20250;&#23558;&#25351;&#21521;&#20854;&#20869;&#26680;&#26632;&#30340;&#25351;&#38024;&#20445;&#23384;&#21040; PCB&#65288;Process Control Block&#65289;&#65292;&#38543;&#21518;&#33021;&#30452;&#25509;&#20462;&#25913;&#26632;&#25351;&#38024;&#23492;&#23384;&#22120;&#20102;</P></SPAN>