<SPAN class=RefText><SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> <SPAN class=RefText>object files</SPAN></FONT></SPAN></FONT></SPAN></FONT> 
<P></P><SPAN class=extract>
<P>There are three main types of object files. </P>
<P>&#23545;&#35937;&#25991;&#20214;&#21253;&#25324;&#65306;&#21487;&#25191;&#34892;&#25991;&#20214;&#12289;&#21487;&#37325;&#23450;&#20301;&#25991;&#20214;&#12289;&#20849;&#20139;&#23545;&#35937;&#25991;&#20214;</P></SPAN><SPAN class=extract>
<P>&#8226; A relocatable file holds code and data suitable for linking with other object files to create an executable or a shared object file. </P>
<P>&#21487;&#37325;&#23450;&#20301;&#25991;&#20214;&#65288;relocatable file&#65289;&#20013;&#21253;&#21547;&#30528;&#29992;&#20110;&#21644;&#20854;&#20182;&#23545;&#35937;&#25991;&#20214;&#38142;&#25509;&#30340;&#20195;&#30721;&#21644;&#25968;&#25454;&#65292;&#38142;&#25509;&#21518;&#23601;&#20250;&#29983;&#25104;&#21487;&#25191;&#34892;&#25991;&#20214;&#25110;&#20849;&#20139;&#23545;&#35937;&#25991;&#20214;</P></SPAN>
<P><SPAN class=extract></SPAN><SPAN class=extract>&nbsp; 
<P>&#8226; An executable file holds a program suitable for execution. 
<P>&#21487;&#25191;&#34892;&#25991;&#20214;&#20013;&#21253;&#21547;&#30528;&#21487;&#29992;&#20110;&#30452;&#25509;&#25191;&#34892;&#30340;&#31243;&#24207; </P></SPAN><SPAN class=extract>
<P>&#8226; A shared object file holds code and data suitable for linking in two contexts. First, the link editor may process it with other relocatable and shared object files to create another object file. Second, the dynamic linker combines it with an executable file and other shared objects to create a process image</P>
<P>&#20849;&#20139;&#23545;&#35937;&#25991;&#20214;&#26377;&#20004;&#20010;&#29992;&#36884;&#65306;</P>
<P>1. &#38142;&#25509;&#32534;&#36753;&#22120;&#21487;&#33021;&#20250;&#23558;&#20849;&#20139;&#23545;&#35937;&#25991;&#20214;&#21644;&#20854;&#20182;&#21487;&#37325;&#23450;&#21521;&#25991;&#20214;&#20197;&#21450;&#20849;&#20139;&#23545;&#35937;&#25991;&#20214;&#24182;&#22312;&#19968;&#36215;&#22788;&#29702;&#65292;&#20197;&#29983;&#25104;&#26032;&#30340;&#23545;&#35937;&#25991;&#20214;&#65307;</P>
<P>2. &#21160;&#24577;&#38142;&#25509;&#22120;&#21487;&#33021;&#20250;&#23558;&#20854;&#20313;&#21487;&#25191;&#34892;&#25991;&#20214;&#21487;&#20854;&#20182;&#20849;&#20139;&#23545;&#35937;&#29233;&#20320;&#25913;&#25991;&#20214;&#32452;&#21512;&#22312;&#19968;&#36215;&#65292;&#29983;&#25104;&#36827;&#31243;&#26144;&#20687;&#65307;</P>
<P></SPAN>