<SPAN>Figure 5.2-1&nbsp; illustrates the setting for our study. At the sending node, data,<SPAN>&nbsp;</SPAN></SPAN><I>D</I><SPAN>, to be "protected" against bit errors&nbsp; is augmented with error detection and correction bits,<SPAN>&nbsp;</SPAN></SPAN><I>EDC</I><SPAN>. Typically, the data to be protected includes not only the datagram passed down from the network layer for transmission across the link, but also link-level addressing information, sequence numbers, and other fields in the data link frame&nbsp; header. Both<SPAN>&nbsp;</SPAN></SPAN><I>D</I><SPAN><SPAN>&nbsp;</SPAN>and<SPAN>&nbsp;</SPAN></SPAN><I>EDC</I><SPAN><SPAN>&nbsp;</SPAN>are sent to the receiving node in a link-level frame. At the receiving node, a sequence of bits,<SPAN>&nbsp;</SPAN></SPAN><I>D</I><SPAN>' and<SPAN>&nbsp;</SPAN></SPAN><I>EDC</I><SPAN>' are received. Note that<SPAN>&nbsp;</SPAN></SPAN><I>D</I><SPAN>' and<SPAN>&nbsp;</SPAN></SPAN><I>EDC</I><SPAN>'&nbsp; may differ from the original<SPAN>&nbsp;</SPAN></SPAN><I>D</I><SPAN><SPAN>&nbsp;</SPAN>and<SPAN>&nbsp;</SPAN></SPAN><I>EDC</I><SPAN><SPAN>&nbsp;</SPAN>as a result of in-transit bit flips.</SPAN> 
<P></P>
<P>&#36890;&#36807;&#26576;&#31181;&#22522;&#20110;&#21407;&#25968;&#25454;&#25253;&#21644;&#38142;&#36335;&#23618;&#22836;&#37096;&#30340;&#31639;&#27861;&#65288;&#38024;&#23545;&#25968;&#25454;&#25253;&#21644;&#38142;&#36335;&#23618;&#22836;&#37096;&#30340;&#25340;&#25509;&#25968;&#25454;&#21253;&#35745;&#31639;&#65289;&#65292;&#35745;&#31639;&#20986;&#38024;&#23545;&#27492;&#25968;&#25454;&#25253;&#30340;<U><STRONG>&#38169;&#35823;&#26816;&#27979;&#19982;&#20462;&#27491;&#23383;&#27573;</STRONG></U>&#65288;<EM>error-detection and -correction bits</EM>&#65292;EDC&#65289;</P>
<P><SPAN class=extract>EDC &#25351;&#30340;&#26159;&#20160;&#20040;&#65311;<STRONG><U>&#38169;&#35823;&#26816;&#27979;&#19982;&#20462;&#27491;&#23383;&#27573;</U></STRONG>&#65288;<EM>error-detection and -correction bits</EM>&#65292;EDC&#65289;</SPAN></P>
<P><SPAN class=extract>EDC &#19968;&#33324;&#32780;&#35328;&#26159;&#22522;&#20110;&#20160;&#20040;&#35745;&#31639;&#24471;&#20986;&#30340;&#65311;&#38142;&#36335;&#23618;&#22836;&#37096;&#21644;&#25968;&#25454;&#25253;</SPAN>