<P class="q-text qu-display--block qu-wordBreak--break-word qu-textAlign--start"><SPAN>The timer interrupt handler invokes the process scheduler as any code in a monolithic kernel invokes any other code: By direct function invocation. The timer interrupt handler and the process scheduler's main entry point are both in the kernel's address space and in the same object file. Kernel code can thus call or jump from the timer interrupt handler to the process scheduler just as function<SPAN>&nbsp;</SPAN></SPAN><CODE class="q-inline qu-bg--gray_ultralight qu-color--gray qu-overflowX--auto qu-textAlign--left qu-borderRadius--small qu-whiteSpace--pre-wrap"><FONT face="Courier New">foo()</FONT></CODE><SPAN><SPAN>&nbsp;</SPAN>may call function<SPAN>&nbsp;</SPAN></SPAN><CODE class="q-inline qu-bg--gray_ultralight qu-color--gray qu-overflowX--auto qu-textAlign--left qu-borderRadius--small qu-whiteSpace--pre-wrap"><FONT face="Courier New">bar()</FONT></CODE><SPAN>.</SPAN></P>
<P class="q-text qu-display--block qu-wordBreak--break-word qu-textAlign--start"><SPAN>(That's the generic answer. Specific operating systems differ, of course. On Linux, the timer interrupt sets a flag, and the kernel then invokes the scheduler later, when about to return to process context. But the point remains: There's nothing magical about how this works.)</SPAN></P>
<P class="q-text qu-display--block qu-wordBreak--break-word qu-textAlign--start"><SPAN><SPAN>&#35745;&#26102;&#22120;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#21487;&#20197;&#30452;&#25509;&#20687;&#35843;&#29992;&#20989;&#25968;&#19968;&#26679;&#35843;&#29992;&#20869;&#26680;&#32447;&#31243;&#35843;&#24230;&#22120;&#65292;&#20294;&#26159;&#26681;&#25454; OS &#30340;&#19981;&#21516;&#65292;&#20855;&#20307;&#23454;&#29616;&#26041;&#24335;&#21487;&#33021;&#26377;&#24046;&#24322;&#12290;&#27604;&#22914;&#22312; Linux &#20013;&#65292;&#35745;&#26102;&#22120;&#20013;&#26029;&#20250;&#35774;&#32622;&#19968;&#20010;&#26071;&#26631;&#65292;&#38543;&#21518;&#20869;&#26680;&#20250;&#22312;&#23558;&#35201;&#36820;&#22238;&#36827;&#31243;&#19978;&#19979;&#25991;&#30340;&#26102;&#20505;&#35843;&#29992;&#35843;&#24230;&#22120;</SPAN></SPAN>