<H3 id=example><SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> Implementing threads : Scheduler activations : Example</SPAN></FONT></H3><SPAN class=extract>
<P>Let&#8217;s study an example of how scheduler activations can be used. The kernel has allocated<SPAN>&nbsp;</SPAN><STRONG>one kernel thread</STRONG><SPAN>&nbsp;</SPAN>(1) to a process with<SPAN>&nbsp;</SPAN><STRONG>three user-level threads</STRONG><SPAN>&nbsp;</SPAN>(2). The three user level threads take turn executing on the single kernel-level thread.</P>
<P><A href="http://www.it.uu.se/education/course/homepage/os/vt18/images/module-4/scheduler-activations-1-2.png?height=444px" data-featherlight="image"><img style="HEIGHT: 412px; WIDTH: 268px" alt="" src="http://www.it.uu.se/education/course/homepage/os/vt18/images/module-4/scheduler-activations-1-2.png?height=444px" width=521 height=812></A></P>
<P></SPAN><SPAN class=extract>&nbsp;</P>
<P>The executing thread makes a<SPAN>&nbsp;</SPAN><STRONG>blocking system call</STRONG><SPAN>&nbsp;</SPAN>(3) and the the kernel blocks the calling user-level thread and the kernel-level thread used to execute the user-level thread (4).</P>
<P>&#36825;&#37324;&#24212;&#35813;&#26159;&#23558;&#25191;&#34892;&#31995;&#32479;&#35843;&#29992;&#30340;&#29992;&#25143;&#32423;&#32447;&#31243;&#21644;&#20869;&#26680;&#32447;&#31243;&#37117;&#32473;&#38459;&#22622;&#20102;</P>
<P><STRONG>Scheduler activation:</STRONG><SPAN>&nbsp;</SPAN>the kernel decides to allocate a<SPAN>&nbsp;</SPAN><STRONG>new kernel-level thread</STRONG><SPAN>&nbsp;</SPAN>to the process (5).<SPAN>&nbsp;</SPAN><STRONG>Upcall:</STRONG><SPAN>&nbsp;</SPAN>the kernel<SPAN>&nbsp;</SPAN><STRONG>notifies</STRONG><SPAN>&nbsp;</SPAN>the user-level<SPAN>&nbsp;</SPAN><STRONG>thread manager</STRONG><SPAN>&nbsp;</SPAN>which user-level thread that is now blocked and that a new kernel-level thread is available (6).</P>
<P>&#20869;&#26680;&#20915;&#23450;&#20026;&#24212;&#29992;&#31243;&#24207;&#20998;&#37197;&#19968;&#20010;&#26032;&#30340;&#20869;&#26680;&#32423;&#32447;&#31243;&#65288;&#34394;&#25311;&#22788;&#29702;&#22120;&#65289;&#22240;&#27492;&#20351;&#29992;&#19978;&#34892;&#35843;&#29992;&#36890;&#30693;&#29992;&#25143;&#32423;&#32447;&#31243;&#31649;&#29702;&#22120;&#65306;&#21738;&#19968;&#20010;&#29992;&#25143;&#32423;&#32447;&#31243;&#34987;&#38459;&#22622;&#20102;&#20197;&#21450;&#29616;&#22312;&#26377;&#19968;&#20010;&#26032;&#30340;&#20869;&#26680;&#32423;&#32447;&#31243;&#21487;&#29992;</P>
<P>&nbsp;The user-level thread manager move the other threads to the new kernel thread and resumes one of the ready threads (7).</P>
<P>&#29992;&#25143;&#32423;&#32447;&#31243;&#31649;&#29702;&#22120;&#23558;&#19968;&#20010;&#26032;&#30340;&#29992;&#25143;&#32423;&#32447;&#31243;&#31227;&#21160;&#21040;&#36825;&#20010;&#26032;&#20998;&#37197;&#30340;&#20869;&#26680;&#32423;&#32447;&#31243;&#20013;&#65292;&#24182;&#20196;&#20854;&#24320;&#22987;&#25191;&#34892;</P>
<P><A href="http://www.it.uu.se/education/course/homepage/os/vt18/images/module-4/scheduler-activations-3-7.png?height=444px" data-featherlight="image"><img style="HEIGHT: 343px; WIDTH: 309px" alt="" src="http://www.it.uu.se/education/course/homepage/os/vt18/images/module-4/scheduler-activations-3-7.png?height=444px" width=737 height=812></A></P></SPAN><SPAN class=extract>
<P>While one user-level thread is blocked (8) the other threads can take turn executing on the new kernel thread (9).</P>
<P>&#29616;&#22312;&#65292;&#23613;&#31649;&#19968;&#20010;&#29992;&#25143;&#32423;&#32447;&#31243;&#22240;&#20026;&#25191;&#34892;&#31995;&#32479;&#35843;&#29992;&#65288;&#19988;&#31995;&#32479;&#35843;&#29992;&#22240;&#20026;&#27491;&#22312;&#25191;&#34892;&#65292;&#23578;&#26410;&#36820;&#22238;&#65292;&#21487;&#33021;&#26159; IO &#25805;&#20316;&#65289;&#32780;&#38459;&#22622;&#20102;&#26576;&#20010;&#20869;&#26680;&#32447;&#31243;&#65292;&#20294;&#26159;&#20854;&#20182;&#29992;&#25143;&#32447;&#31243;&#20381;&#28982;&#33021;&#24471;&#20197;&#36816;&#34892;</P>
<P><A href="http://www.it.uu.se/education/course/homepage/os/vt18/images/module-4/scheduler-activations-8-9.png?height=444px" data-featherlight="image"><img style="HEIGHT: 234px; WIDTH: 216px" alt="" src="http://www.it.uu.se/education/course/homepage/os/vt18/images/module-4/scheduler-activations-8-9.png?height=444px" width=739 height=807></A><BR></P>
<P></SPAN>