As with fork, the word wait is now a bit ambiguous. It is used for pausing the current UNIX process to wait for another process to complete; it is also used in thread synchronization, for waiting on a condition variable. To disambiguate, we will always use the term &#8220;UNIX wait&#8221; to refer to UNIX&#8217;s wait system call. 
<P></P>
<P>UNIX &#20013;&#30340; wait &#20855;&#26377;&#20004;&#31181;&#19981;&#21516;&#30340;&#21547;&#20041;&#65306;</P>
<P>1. <SPAN class=extract>&#22914;&#26524;&#22312;&#36827;&#31243;&#30456;&#20851;&#30340;&#19978;&#19979;&#25991;&#20013;&#35848;&#21040; wait&#65288;&#20197;&#21450; fork&#65289;&#65292;&#37027;&#20040; wait &#25152;&#25351;&#20195;&#30340;&#23601;&#26159;&#26242;&#20572;&#24403;&#21069;&#36827;&#31243;&#20197;&#31561;&#24453;&#21478;&#19968;&#20010;&#36827;&#31243;&#23436;&#25104;&#65288;wait for another process to complete&#65289;</SPAN>&#65307;</P>
<P>2. <SPAN class=extract>&#22914;&#26524;&#26159;&#22312;&#32447;&#31243;&#30456;&#20851;&#30340;&#19978;&#19979;&#25991;&#20013;&#35848;&#21040; wait&#65288;&#20855;&#20307;&#26469;&#35828;&#26159;&#32447;&#31243;&#21516;&#27493;&#30456;&#20851;&#20107;&#23452;&#65289;&#37027;&#20040;&#23601;&#19981;&#26159;&#31561;&#24453;&#26576;&#20010;&#32447;&#31243;&#23436;&#25104;&#65288;wait for another thread to complete&#65289;&#32780;&#26159;&#31561;&#24453;&#26576;&#20010;&#26465;&#20214;&#21464;&#37327;&#65288;waiting on a condition variable&#65289;</SPAN>&#65307;</P>
<P>&#30524;&#19979;&#65292;&#23545;&#20110;&#36827;&#31243;&#30456;&#20851;&#30340; wait&#65288;&#21363;&#25152;&#35859;&#30340; wait &#31995;&#32479;&#35843;&#29992;&#65289;&#65292;&#20070;&#20013;&#20250;&#23558;&#20854;&#31216;&#20026; UNIX wait</P>
<P>Oddly, waiting for a thread to complete is called &#8220;thread join&#8221;, even though it is most analogous to UNIX wait. </P>
<P><SPAN class=extract>&#29305;&#21035;&#30340;&#65292;&#35848;&#21450;&#31561;&#24453;&#26576;&#20010;&#32447;&#31243;&#23436;&#25104;&#65288;waiting for a thread to complete&#65289;&#30340;&#34892;&#20026;&#26102;&#65292;&#25105;&#20204;&#20250;&#20351;&#29992;&#8220;thread join&#8221;&#36825;&#20010;&#35789;</SPAN></P>
<P>Windows is simpler, with a single function called &#8220;WaitForSingleObject&#8221; that can wait for process completion, thread completion, or on a condition variable</P>
<P><SPAN class=extract>&#33267;&#20110;&#22312; Windows &#20013;&#65292;WaitForSingleObject &#33021;&#21516;&#26102;&#29992;&#20110;&#31561;&#24453;&#36827;&#31243;&#23436;&#25104;&#12289;&#31561;&#24453;&#32447;&#31243;&#23436;&#25104;&#20197;&#21450;&#31561;&#24453;&#26465;&#20214;&#21464;&#37327;</SPAN>