When a processor exception or system call trap occurs, the hardware carefully saves a small amount of the interrupted thread state, leaving the system as shown in Figure&nbsp;<A data-ixbpernmnjoud4qz9ktzkg='{"name": "OEBPS/Text/part0000.xhtml", "frag": "x1-4600211"}'>2.11</A>: 
<P></P><FONT style="BACKGROUND-COLOR: #f9f5e9"><SPAN class=extract>
<P><FONT style="BACKGROUND-COLOR: #f9f5e9">&#24403;&#22788;&#29702;&#22120;&#24322;&#24120;&#25110;&#32773;&#31995;&#32479;&#35843;&#29992;&#21457;&#29983;&#26102;&#65292;&#30828;&#20214;&#20250;&#20381;&#27425;&#25191;&#34892;&#22914;&#19979;&#20845;&#27493;&#65306;</FONT></P>
<OL>
<LI><FONT style="BACKGROUND-COLOR: #f9f5e9">&#31105;&#29992;&#20013;&#26029;&#65307;</FONT> 
<LI><FONT style="BACKGROUND-COLOR: #f9f5e9">&#20445;&#23384;&#19977;&#20010;&#20851;&#38190;&#20540;&#65307;</FONT> 
<LI><FONT style="BACKGROUND-COLOR: #f9f5e9">&#20999;&#25442;&#21040;&#20869;&#26680;&#20013;&#26029;&#26632;&#65307;</FONT> 
<LI><FONT style="BACKGROUND-COLOR: #f9f5e9">&#23558;&#19977;&#20010;&#20851;&#38190;&#20540;&#20445;&#23384;&#21040;&#20013;&#26029;&#26632;&#20013;&#65307;</FONT> 
<LI><FONT style="BACKGROUND-COLOR: #f9f5e9">&#65288;&#21487;&#36873;&#65289;&#20445;&#23384;&#38169;&#35823;&#20195;&#30721;&#65307;</FONT> 
<LI><FONT style="BACKGROUND-COLOR: #f9f5e9">&#35843;&#29992;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#65307;</FONT></LI></OL></SPAN></FONT>
<P></P>
<HR>

<TABLE cellPadding=10>
<TBODY>
<TR>
<TD align=left>
<P class=caption width=0><B>Figure&nbsp;2.11: </B>State of the system after the x86 hardware has jumped to the interrupt handler. The hardware saves the user context on the kernel interrupt stack and changes the program counter/stack to locations in kernel memory.</P></TD></TR></TBODY></TABLE>
<HR>

<OL class=enumerate1>
<LI class=enumerate><A id=x1-46004x1 name=x1-46004x1></A><B><SPAN class=extract>
<P><B>Mask interrupts.</B> The hardware starts by preventing any interrupts from occurring while the processor is in the middle of switching from user mode to kernel mode. <BR>&#30828;&#20214;&#20174;&#29992;&#25143;&#27169;&#24335;&#20999;&#25442;&#20026;&#20869;&#26680;&#27169;&#24335;&#25152;&#20570;&#30340;&#31532;&#19968;&#20214;&#20107;&#26159;&#31105;&#29992;&#20013;&#26029;</P></SPAN></B>
<LI class=enumerate><A id=x1-46006x2 name=x1-46006x2></A><B><SPAN class=extract>
<P><B>Save three key values.</B> The hardware saves the values of the stack pointer (the x86 esp and ss registers), the execution flags (the x86 eflags register), and the instruction pointer (the x86 eip and cs registers) to internal, temporary hardware registers. <BR>&#30828;&#20214;&#39318;&#20808;&#20250;&#23558;&#19977;&#20010;&#20851;&#38190;&#20540;&#20445;&#23384;&#21040;&#26576;&#20123;&#20020;&#26102;&#30828;&#20214;&#23492;&#23384;&#22120;&#20013;<BR>&#36825;&#19977;&#20010;&#20851;&#38190;&#20540;&#65288;&#25353;&#29031;&#35838;&#26412;&#20013;&#22270;&#33258;&#19978;&#32780;&#19979;&#65289;&#20998;&#21035;&#20026;&#65306;&#29992;&#25143;&#26632;&#23492;&#23384;&#22120;&#65288;SS:ESP&#65289;&#12289;&#29992;&#25143;&#20195;&#30721;&#23492;&#23384;&#22120;&#65288;CS:EIP&#65289;&#21644;&#36827;&#31243;&#29366;&#24577;&#23383;&#23492;&#23384;&#22120;&#65288;EFLAGS&#65289;</P></SPAN></B>
<LI class=enumerate><A id=x1-46008x3 name=x1-46008x3></A><B><SPAN class=extract>
<P><B>Switch onto the kernel interrupt stack.</B> The hardware then switches the stack segment/stack pointer to the base of the kernel interrupt stack, as specified in a special hardware register. <BR>&#24403;&#30828;&#20214;&#23558;&#19977;&#20010;&#20851;&#38190;&#25968;&#25454;&#20445;&#23384;&#21040;&#20020;&#26102;&#23492;&#23384;&#22120;&#20013;&#20043;&#21518;&#65292;&#23601;&#20250;&#20196;&#26632;&#25351;&#38024;&#25351;&#21521;&#20013;&#26029;&#26632;<BR>&#20013;&#26029;&#26632;&#30340;&#25152;&#22312;&#20301;&#32622;&#22768;&#26126;&#22312;&#26576;&#20010;&#29305;&#21035;&#30340;&#30828;&#20214;&#23492;&#23384;&#22120;&#20013;</P></SPAN></B>
<LI class=enumerate><A id=x1-46010x4 name=x1-46010x4></A><B><SPAN class=extract>
<P><B>Push the three key values onto the new stack.</B> Next, the hardware stores the internally saved values onto the stack. <BR>&#30828;&#20214;&#23436;&#25104;&#25351;&#38024;&#20999;&#25442;&#20043;&#21518;&#65292;&#23601;&#20250;&#23558;&#20648;&#23384;&#22312;&#20020;&#26102;&#23492;&#23384;&#22120;&#20013;&#30340;&#20540;&#20445;&#23384;&#21040;&#20013;&#26029;&#26632;</P></SPAN></B>
<LI class=enumerate><A id=x1-46012x5 name=x1-46012x5></A><B><SPAN class=extract>
<P><B>Optionally save an error code.</B> Certain types of exceptions, such as page faults, generate an error code to provide more information about the event; for these exceptions, the hardware pushes this code, making it the top item on the stack. For other types of events, the software interrupt handler pushes a dummy value onto the stack so that the stack format is identical in both cases. <BR>&#30828;&#20214;&#23558;&#29366;&#24577;&#20445;&#23384;&#21040;&#20013;&#26029;&#26632;&#20043;&#21518;&#65292;&#30828;&#20214;&#20250;&#23558;&#38169;&#35823;&#20195;&#30721;&#20445;&#23384;&#21040;&#20013;&#26029;&#26632;&#20013;&#12290;<BR>&#20013;&#26029;&#30340;&#31867;&#22411;&#19981;&#21516;&#65292;&#25152;&#20445;&#23384;&#30340;&#38169;&#35823;&#20449;&#24687;&#20250;&#26377;&#25152;&#24046;&#24322;&#12290;<BR>&#23545;&#20110;&#33021;&#22815;&#29983;&#25104;&#38169;&#35823;&#20195;&#30721;&#65288;error code&#65289;&#30340;&#20013;&#26029;&#26469;&#35828;&#65288;&#22914;page fault&#65289;&#65292;&#30828;&#20214;&#20250;&#23558;&#36825;&#20123;&#38169;&#35823;&#20195;&#30721;&#20445;&#23384;&#21040;&#26632;&#20013;&#12290;<BR>&#23545;&#20110;&#37027;&#20123;&#19981;&#20250;&#29983;&#25104;&#38169;&#35823;&#20195;&#30721;&#30340;&#20013;&#26029;&#65292;&#36719;&#20214;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#20250;&#23558;&#19968;&#20123;&#20887;&#20313;&#25968;&#25454;&#20445;&#23384;&#21040;&#26632;&#20013;&#65292;&#20197;&#30830;&#20445;&#26684;&#24335;&#19968;&#33268;&#12290;</P></SPAN></B>
<LI class=enumerate><A id=x1-46014x6 name=x1-46014x6></A><B><SPAN class=extract>
<P><B>Invoke the interrupt handler.</B> Finally, the hardware changes the code segment/program counter to the address of the interrupt handler procedure. A special register in the processor contains the location of the interrupt vector table in kernel memory. This register can only be modified by the kernel. The type of interrupt is mapped to an index in this array, and the code segment/program counter is set to the value at this index. <BR>&#30828;&#20214;&#23558;&#38169;&#35823;&#20195;&#30721;&#20445;&#23384;&#21040;&#20013;&#26029;&#26632;&#20043;&#21518;&#65292;&#23601;&#20250;&#20462;&#25913;&#20195;&#30721;&#25351;&#38024;&#65288;&#25110;&#32773;&#35828; PC&#65289;&#20026;&#24403;&#21069;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#30340;&#25351;&#20196;&#36215;&#22987;&#20301;&#32622;&#12290;<BR>&#22788;&#29702;&#22120;&#20013;&#19968;&#20010;&#29305;&#21035;&#30340;&#23492;&#23384;&#22120;&#20250;&#20648;&#23384;&#20013;&#26029;&#21521;&#37327;&#34920;&#30340;&#25152;&#22312;&#20301;&#32622;&#65292;&#36825;&#20010;&#23492;&#23384;&#22120;&#21482;&#33021;&#34987;&#20869;&#26680;&#25152;&#20462;&#25913;&#12290;<BR>&#27880;&#24847;&#65292;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#25351;&#20196;&#30340;&#36215;&#22987;&#20301;&#32622;&#20855;&#20307;&#20250;&#34987;&#20462;&#25913;&#25104;&#21738;&#19968;&#20010;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#30340;&#36215;&#22987;&#20301;&#32622;&#65292;&#30001;&#20013;&#26029;&#30340;&#31867;&#22411;&#36827;&#34892;&#20915;&#23450;&#12290;</P></SPAN></B></LI></OL>