<P class=caption width=0><B>Figure&nbsp;4.14: </B>Pseudo-code for thread_switch&nbsp;and thread_yield&nbsp;on the Intel x86 architecture. Note that thread_yield&nbsp;is a no-op if there are no other threads to run. Otherwise, it saves the old thread state and restores the new thread state. When the old thread is re-scheduled, it returns from thread_switch&nbsp;as the running thread.</P><SPAN class=extract>
<P class=caption width=0>thread_yield &#30340;&#23454;&#29616;&#20998;&#20026;&#20197;&#19979;&#20960;&#20010;&#37096;&#20998;&#65306;</P>
<P class=caption width=0>1. &#31105;&#29992;&#20013;&#26029;&#65307;</P>
<P class=caption width=0>2. &#25361;&#36873;&#19979;&#19968;&#32447;&#31243;&#65307;</P>
<P class=caption width=0>3. &#25191;&#34892; thread_switch&#65307;</P>
<P class=caption width=0>4. &#28165;&#31354; finish_list&#65307;</P>
<P class=caption width=0>5. &#21551;&#29992;&#20013;&#26029;&#65307;</P></SPAN>
<P class=caption width=0>&#31105;&#29992;&#20013;&#26029;&#30340;&#21407;&#22240;&#22312;&#20854;&#20182;&#22320;&#26041;&#65292;&#36825;&#37324;&#20808;&#25353;&#19979;&#19981;&#34920;</P>
<P class=caption width=0><SPAN class=extract>&#25361;&#36873;&#19979;&#19968;&#32447;&#31243;&#25351;&#30340;&#26159;&#20174; ready_list &#20013;&#25361;&#36873;&#24403;&#21069;&#35753;&#20986; CPU &#20043;&#21518;&#65292;&#19979;&#19968;&#20010;&#38656;&#35201;&#25191;&#34892;&#30340;&#32447;&#31243;&#12290;&#22914;&#26524;&#27809;&#26377;&#38656;&#35201;&#25191;&#34892;&#30340;&#32447;&#31243;&#65288;ready_list&#65289;&#20026;&#31354;&#65292;&#37027;&#20040;&#23601;&#27809;&#26377;&#20999;&#25442;&#36827;&#31243;&#24182;&#25191;&#34892;&#30340;&#36807;&#31243;</SPAN></P><SPAN class=extract>
<P class=caption width=0>&#22871;&#29992;&#21407;&#25991;&#65292;&#22522;&#20110; yield &#30340;&#32447;&#31243;&#20999;&#25442;&#20854;&#23454;&#25402; tricky &#30340;&#12290;&#39318;&#20808;&#38656;&#35201;&#35748;&#35782;&#21040;&#65292;&#19982;&#20854;&#35828;&#20869;&#26680;&#20351;&#29992; TCB &#26469;&#25511;&#21046;&#24403;&#21069;&#22788;&#29702;&#22120;&#19978;&#27491;&#22312;&#25191;&#34892;&#20160;&#20040;&#32447;&#31243;&#65292;&#20498;&#19981;&#22914;&#35828; TCB &#20165;&#20165;&#26159;&#20869;&#26680;&#29992;&#26469;&#36319;&#36394;&#32447;&#31243;&#29366;&#24577;&#30340;&#19968;&#20010;&#25968;&#25454;&#32467;&#26500;&#32780;&#24050;&#12290;&#22914;&#26524;&#20869;&#26680;&#24819;&#35201;&#25511;&#21046;&#25110;&#32773;&#35828;&#20999;&#25442;&#24403;&#21069;&#22788;&#29702;&#22120;&#19978;&#27491;&#22312;&#25191;&#34892;&#30340;&#32447;&#31243;&#65292;&#38656;&#35201;&#21435;&#20462;&#25913;&#22788;&#29702;&#22120;&#20013;&#30340;&#23492;&#23384;&#22120;&#32780;&#19981;&#26159; TCB&#12290;TCB &#20165;&#20165;&#26159;&#19968;&#20010;&#29992;&#26469;&#20445;&#23384;&#32447;&#31243;&#29366;&#24577;&#30340;&#25968;&#25454;&#32467;&#26500;&#32780;&#24050;&#65292;&#24182;&#19981;&#26159;&#30495;&#27491;&#20915;&#23450;&#24403;&#21069;&#32447;&#31243;&#29366;&#24577;&#30340;&#25968;&#25454;&#32467;&#26500;&#65292;&#30495;&#27491;&#20915;&#23450;&#36827;&#31243;&#29366;&#24577;&#30340;&#26159;&#23492;&#23384;&#22120;&#12290;&#20026;&#27492;&#65292;&#20462;&#25913;&#24403;&#21069;&#32447;&#31243;&#29366;&#24577;&#20026; READY&#65288;&nbsp;runningThread-&gt;state&nbsp;=&nbsp;ready;&#65289;&#26412;&#36136;&#19978;&#21482;&#26159;&#25552;&#21069;&#26356;&#26032;&#19968;&#19979; TCB &#32780;&#24050;&#65292;&#22788;&#29702;&#22120;&#19978;&#21040;&#24213;&#36816;&#34892;&#30340;&#36824;&#26159;&#24403;&#21069;&#32447;&#31243;&#30340;&#20195;&#30721;&#65292;&#19981;&#26159;&#30446;&#26631;&#32447;&#31243;&#30340;&#20195;&#30721;&#12290;</P>
<P class=caption width=0></SPAN><SPAN class=extract>&nbsp;</P>
<P class=caption width=0>&#38543;&#21518;&#23558;&#24403;&#21069;&#36827;&#31243;&#21152;&#21040;&#20934;&#22791;&#38431;&#21015;&#20013;&#65292;&#31561;&#24453;&#26410;&#26469;&#35843;&#24230;&#22120;&#35843;&#24230;&#65288;&#29616;&#22312;&#20381;&#28982;&#22312;&#25191;&#34892;&#26087;&#32447;&#31243;&#30340;&#20195;&#30721;&#65289;</P>
<P class=caption width=0></SPAN>&#65288;&#27880;&#24847;&#65292;&#19979;&#38754;&#30340;&#20869;&#23481;&#24182;&#38750;&#38024;&#23545;&#20266;&#20195;&#30721;&#30340;&#20840;&#28982;&#21453;&#26144;&#65292;&#32780;&#26159;&#38024;&#23545;&#8220;Implementation&nbsp;Details&#8221;&#20013;&#20869;&#23481;&#30340;&#21453;&#26144;&#65292;&#20063;&#23601;&#26159;&#30495;&#23454;&#30340;&#25805;&#20316;&#31995;&#32479;&#20250;&#20197;&#19968;&#31181;&#20160;&#20040;&#26679;&#30340;&#26041;&#24335;&#23454;&#29616; thread_switch &#20989;&#25968;&#65289;</P>
<P class=caption width=0><BR>void thread_switch (oldThreadTCB, newThreadTCB){<BR>&nbsp;&nbsp;&nbsp; push SS, ESP, CS, EIP, EFLAG;<BR>&nbsp;&nbsp;&nbsp; push dummy_error;<BR>&nbsp;&nbsp;&nbsp; pushad;<BR>&nbsp;&nbsp;&nbsp; oldThreadTCB-&gt;ESP =&nbsp;%ESP;<BR>&nbsp;&nbsp;&nbsp; %ESP = newThreadTCB-&gt;sp;<BR>&nbsp;&nbsp;&nbsp; popad;<BR>&nbsp;&nbsp;&nbsp; iret;<BR>}</P>
<P class=caption width=0><SPAN class=extract>&#25509;&#19979;&#26469;&#23601;&#26159;&#23558;&#26032;&#26087;&#32447;&#31243;&#30340; TCB &#37117;&#20256;&#36882;&#32473; thread_switch &#20989;&#25968;&#12290;&#36825;&#20010;&#20989;&#25968;&#30340;&#20316;&#29992;&#22522;&#26412;&#19978;&#21487;&#20197;&#24402;&#32467;&#20026;&#20004;&#20010;&#37096;&#20998;&#65306;&#65288;1&#65289;&#23558;&#26087;&#32447;&#31243;&#30340;&#29366;&#24577;&#20445;&#23384;&#21040;&#26087;&#32447;&#31243;&#30340; TCB &#20013;&#65292;&#65288;2&#65289;&#23558;&#26032;&#32447;&#31243;&#30340;&#29366;&#24577;&#21152;&#36733;&#21040;&#22788;&#29702;&#22120;&#20013;</SPAN></P>
<P class=caption width=0>&#32771;&#34385;&#21040;&#65292;&#23454;&#38469;&#24674;&#22797;&#32447;&#31243;&#30340;&#26102;&#20505;&#65292;&#32447;&#31243;&#19981;&#19968;&#23450;&#20174; thread_switch &#25191;&#34892;&#36807;&#31243;&#20013;&#24674;&#22797;&#65292;&#20063;&#26377;&#21487;&#33021;&#20174;&#34987;&#20013;&#26029;&#20043;&#21518;&#30340;&#29366;&#24577;&#20013;&#24674;&#22797;&#65292;&#22240;&#27492; thread_switch &#38656;&#35201;&#32508;&#21512;&#32771;&#34385;&#36825;&#20004;&#31181;&#24773;&#20917;&#12290;</P><SPAN class=extract>
<P class=caption width=0>&#22914;&#26524;&#26159;&#20174; thread_switch &#25191;&#34892;&#36807;&#31243;&#20013;&#24674;&#22797;&#65288;&#20063;&#23601;&#26159;&#26087;&#36827;&#31243;&#20027;&#21160;&#20999;&#25442;&#21040;&#26032;&#36827;&#31243;&#65292;&#36807;&#20102;&#19968;&#27573;&#26102;&#38388;&#20043;&#21518;&#20877;&#34987;&#35843;&#24230;&#22120;&#32473;&#20104;&#22788;&#29702;&#22120;&#26102;&#38388;&#65289;&#37027;&#20040;&#27492;&#26102;&#32447;&#31243;&#30340;&#29366;&#24577;&#24212;&#24403;&#26159;&#21018;&#25191;&#34892;&#23436; iret&#65292;&#36820;&#22238; thread_yield&#65288;&#34429;&#28982;&#36825;&#37324;&#36793;&#30830;&#23454;&#20063;&#26377;&#19968;&#20123;&#24456; trivial &#30340;&#38382;&#39064;&#65292;&#27604;&#22914;&#35828;&#22914;&#26524;&#30452;&#25509;&#36820;&#22238;&#26087;&#32447;&#31243;&#28304;&#22320;&#22336;&#30340;&#35805;&#20250;&#35302;&#21457;&#27515;&#24490;&#29615;&#65292;&#19981;&#36807;&#36825;&#32943;&#23450;&#26377;&#30456;&#24212;&#30340;&#35299;&#20915;&#21150;&#27861;&#65292;&#27604;&#22914;&#35828;&#26631;&#35760;&#19968;&#19979;&#21407;&#32447;&#31243;&#26159;&#22240;&#20026;&#20160;&#20040;&#32780;&#35302;&#21457;&#20102;&#19978;&#19979;&#25991;&#20999;&#25442;&#65289;&#65307;&#32780;&#22914;&#26524;&#26159;&#20174;&#20013;&#26029;&#36807;&#31243;&#20013;&#36820;&#22238;&#65292;&#37027;&#20040;&#23601;&#20687;&#20013;&#26029;&#22788;&#29702;&#22120;&#19968;&#26679;&#24674;&#22797;&#19978;&#19979;&#25991;&#21363;&#21487;</P>
<P class=caption width=0>&#65288;1&#65289;&#23558;&#19977;&#20010;&#20851;&#38190;&#23492;&#23384;&#22120;&#12289;&#38169;&#35823;&#30721;&#12289;&#36890;&#29992;&#23492;&#23384;&#22120;&#21387;&#20837;&#26087;&#32447;&#31243;&#26632;&#20013;&#65288;&#30001;&#20110;&#26159;&#20869;&#26680;&#32447;&#31243;&#30340;&#32536;&#25925;&#65292;&#30452;&#25509;&#21387;&#20837;&#26632;&#20013;&#65289;&#65292;&#65288;2&#65289;&#23558;&#26087;&#36827;&#31243;&#30340;&#26632;&#25351;&#38024;&#65288;%ESP&#65289;&#20445;&#23384;&#21040; TCB &#20013;&#65288;&#35828;&#19981;&#23450;&#36824;&#26377;&#21035;&#30340;&#19996;&#35199;&#65289;</P>
<P class=caption width=0>&#31532;&#20108;&#37096;&#20998;&#23454;&#38469;&#19978;&#23601;&#26159;&#20351;&#29992; popad &#21644; iret &#24674;&#22797;&#26087;&#32447;&#31243;&#29366;&#24577;&#20102;</P></SPAN>
<P class=caption width=0><SPAN class=extract>&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#23545;&#20110;&#32447;&#31243; A &#25191;&#34892; thread_switch &#20999;&#25442;&#21040;&#21478;&#19968;&#20010;&#22240;&#25191;&#34892; thread_switch &#32780;&#23548;&#33268;&#19978;&#19979;&#25991;&#20999;&#25442;&#30340;&#30340;&#32447;&#31243; B&#65292;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#23613;&#31649;&#22312;&#22788;&#29702;&#22120;&#30475;&#26469;&#25509;&#19979;&#26469;&#25191;&#34892;&#30340;&#20195;&#30721;&#21644;&#27809;&#26377;&#21457;&#29983;&#19978;&#19979;&#25991;&#20999;&#25442;&#26102;&#25191;&#34892;&#30340;&#20195;&#30721;&#19968;&#26679;&#65292;&#20294;&#26159;&#23454;&#38469;&#19978;&#65292;&#20174; thread_switch &#20013;&#36820;&#22238;&#30340;&#32447;&#31243;&#19981;&#26159;&#32447;&#31243; A&#65292;&#32780;&#26159;&#32447;&#31243; B&#12290;&#31350;&#20854;&#21407;&#22240;&#26159;&#22240;&#20026;&#25511;&#21046;&#22788;&#29702;&#22120;&#24403;&#21069;&#27491;&#22312;&#25191;&#34892;&#21738;&#19968;&#32447;&#31243;&#20195;&#30721;&#30340;&#65292;&#24182;&#19981;&#26159;&#25152;&#25191;&#34892;&#30340;&#20195;&#30721;&#26412;&#36523;&#65288;&#32780;&#19988;&#32447;&#31243;&#19981;&#20687;&#36827;&#31243;&#65292;&#23427;&#20204;&#25191;&#34892;&#30340;&#20195;&#30721;&#22823;&#22810;&#19968;&#26679;&#65289;&#32780;&#26159;&#21462;&#20915;&#20110;&#23427;&#20204;&#30340;&#29366;&#24577;&#12290;</SPAN></P>
<P class=caption width=0>&#38543;&#21518;&#65292;&#23601;&#26159;&#26356;&#26032;&#24403;&#21069;&#32447;&#31243; TCB&#65288;runningThread-&gt;state&nbsp;=&nbsp;running;&#65289;&#24182;&#21024;&#38500;&#23436;&#25104;&#38431;&#21015;&#20013;&#30340;&#20869;&#23481;&#21861;&#30340;</P>
<P class=caption width=0><SPAN class=extract>&#24635;&#30340;&#26469;&#35828;&#65292;&#36825;&#37324;&#26368;&#20540;&#24471;&#25226;&#25569;&#30340;&#26159;&#32447;&#31243;&#20999;&#25442;&#30340;&#23454;&#29616;&#65292;&#24456;&#26377;&#24847;&#24605;&#30340;&#26159;&#65292;&#32447;&#31243;&#20999;&#25442;&#20165;&#20165;&#26159;&#25913;&#20102;&#19979;&#23492;&#23384;&#22120;&#23601;&#20174; A &#21464;&#21040; B &#20102;&#65292;&#27809;&#26377;&#20160;&#20040;&#29305;&#21035;&#22823;&#30340;&#21160;&#20316;</SPAN>