It is essential that any routine that causes the thread to yield or block call thread_switch&nbsp;in the same way. Equally, to create a new thread, thread_create&nbsp;must set up the stack of the new thread to be as if it had suspended execution just before performing its first instruction. Then, if the newly created thread is the next thread to run, a thread can call thread_yield, switch to the newly created thread, switch to its stack pointer, pop the register values off the stack, and &#8220;return&#8221; to the new thread, even though it had never called switch in the first place. 
<P></P>
<P>&#26032;&#21019;&#24314;&#30340;&#32447;&#31243;&#20043;&#25152;&#20197;&#35201;&#22312;&#26632;&#20013;&#21387;&#20837;&#26729;&#31243;&#24207;&#39318;&#26465;&#25351;&#20196;&#30340;&#22320;&#22336;&#21644;&#21508;&#31181;&#26679;&#20363;&#23492;&#23384;&#22120;&#25968;&#25454;&#65292;&#26159;&#22240;&#20026;&#26377;&#21487;&#33021;&#26576;&#20010;&#32447;&#31243;&#25191;&#34892; thread_yield &#20043;&#21518;&#65292;&#26377;&#21487;&#33021;&#23601;&#20999;&#25442;&#21040;&#36825;&#20010;&#26032;&#21019;&#24314;&#30340;&#32447;&#31243;&#65288;&#24212;&#24403;&#27880;&#24847;&#21040;&#65292;&#36825;&#20040;&#20570;&#30340;&#26412;&#36136;&#21407;&#22240;&#26159;&#20026;&#20102;&#33021;&#22312;&#26032;&#32447;&#31243;&#21551;&#21160;&#21644;&#32447;&#31243;&#20999;&#25442;&#36825;&#20004;&#31867;&#20284;&#30340;&#34892;&#20026;&#20013;&#20351;&#29992;&#21516;&#19968;&#22871;&#20195;&#30721;&#65292;&#26377;&#28857;&#31867;&#20284;&#20110;&#35753;&#31995;&#32479;&#35843;&#29992;&#12289;&#20013;&#26029;&#36820;&#22238;&#12289;&#21551;&#21160;&#26032;&#36827;&#31243;&#20351;&#29992;&#21516;&#19968;&#22871;&#20195;&#30721;&#65289;</P>
<P>&#22914;&#26159;&#65292;&#35843;&#24230;&#22120;&#20999;&#25442;&#21040;&#35813;&#26032;&#32447;&#31243;&#30340;&#26102;&#20505;&#65292;&#23601;&#33021;&#20351;&#29992;&#21516;&#19968;&#22871;&#21644;&#32447;&#31243;&#20999;&#25442;&#19968;&#26679;&#30340;&#25351;&#20196;&#35753;&#26032;&#32447;&#31243;&#24320;&#22987;&#25191;&#34892;&#20102;</P>
<P><SPAN class=extract>&#21019;&#24314;&#26032;&#32447;&#31243;&#26102;&#65292;&#38500;&#20102;&#35201;&#22312;&#26632;&#20013;&#21387;&#20837;&#26729;&#31243;&#24207;&#30340;&#21442;&#25968;&#65292;&#36824;&#38656;&#35201;&#21387;&#20837;&#20160;&#20040;&#19996;&#35199;&#65311;&#26679;&#20363;&#29366;&#24577;</SPAN></P>
<P><SPAN class=extract>&#26032;&#32447;&#31243;&#30340;&#26679;&#20363;&#29366;&#24577;&#20013;&#21253;&#21547;&#20160;&#20040;&#65311;&#26729;&#31243;&#24207;&#39318;&#26465;&#25351;&#20196;&#30340;&#22320;&#22336;&#12289;&#19968;&#20123;&#26080;&#24847;&#20041;&#30340;&#23492;&#23384;&#22120;&#20540;</SPAN></P>
<P><SPAN class=extract>&#20026;&#20160;&#20040;&#35201;&#22312;&#26032;&#32447;&#31243;&#30340;&#26632;&#20013;&#21387;&#20837;&#26679;&#20363;&#29366;&#24577;&#65311;&#20026;&#20102;&#33021;&#20351;&#29992;&#21516;&#19968;&#22871;&#20195;&#30721;&#21551;&#21160;&#26032;&#32447;&#31243;&#21644;&#26087;&#32447;&#31243;</SPAN></P>
<P><SPAN class=extract>&#22312;&#26032;&#32447;&#31243;&#30340;&#26632;&#20013;&#21387;&#20837;&#26679;&#20363;&#29366;&#24577;&#20027;&#35201;&#26159;&#20026;&#20102;&#38450;&#33539;&#20160;&#20040;&#22330;&#26223;&#65311;&#32447;&#31243;&#20999;&#25442;&#26102;&#20999;&#25442;&#21040;&#26032;&#32447;&#31243;</SPAN>