<B><SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> 4.4.2 Shared State : Heap internals</SPAN></FONT>.</B> 
<P></P><SPAN class=extract>
<P>Although a program&#8217;s heap is logically shared &#8212; it is acceptable for one thread to allocate an object on the heap and then pass a pointer to that object to another thread &#8212; for performance reasons heaps may internally subdivide their space into per-thread regions. </P>
<P>&#23613;&#31649;&#22312;&#23450;&#20041;&#19978;&#65292;&#21516;&#19968;&#36827;&#31243;&#20013;&#30340;&#25152;&#26377;&#32447;&#31243;&#20849;&#20139;&#22534;&#65292;&#20294;&#26159;&#20063;&#33021;&#23545;&#22534;&#21152;&#20197;&#21010;&#20998;&#65292;&#35753;&#19981;&#21516;&#32447;&#31243;&#25317;&#26377;&#33258;&#24049;&#30340;&#19968;&#29255;&#22534;</P></SPAN><SPAN class=extract>
<P>The advantage of subdividing the heap is that multiple threads can each allocate objects at the same time without interfering with one another. </P>
<P>&#35753;&#27599;&#20010;&#32447;&#31243;&#25317;&#26377;&#33258;&#24049;&#30340;&#19968;&#29255;&#22534;&#33021;&#35753;&#21508;&#32447;&#31243;&#22312;&#19981;&#30456;&#20114;&#24178;&#39044;&#30340;&#24773;&#20917;&#19979;&#20351;&#29992;&#22534;&#31354;&#38388;&#65292;&#36825;&#26679;&#23601;&#20813;&#38500;&#20102;&#21516;&#27493;&#30340;&#38656;&#35201;&#65292;&#33021;&#25552;&#21319;&#24615;&#33021;</P></SPAN><SPAN class=extract>
<P>Further, by allocating objects used by the same thread from the same memory region, cache hit rates may improve.</P>
<P>&#27492;&#22806;&#65292;&#35753;&#32447;&#31243;&#25317;&#26377;&#33258;&#24049;&#30340;&#22534;&#33021;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#25552;&#21319;&#32531;&#23384;&#21629;&#20013;&#29575;&nbsp;</P></SPAN><SPAN class=extract>
<P>To implement these optimizations, each subdivision of the heap has thread-local variables that track what parts of the thread-local heap are in use, what parts are free, and so on. Then, the code that allocates new memory (e.g., malloc and new) is written to use these thread-local data structures and only take memory from the shared heap if the local heap is empty</P>
<P>&#20026;&#20102;&#23454;&#29616;&#32447;&#31243;&#26412;&#22320;&#22534;&#65292;&#38656;&#35201;&#26377;&#32447;&#31243;&#26412;&#22320;&#21464;&#37327;&#36861;&#36394;&#32447;&#31243;&#26412;&#22320;&#22534;&#30340;&#20351;&#29992;&#24773;&#20917;&#65288;&#21738;&#22359;&#27491;&#22312;&#20351;&#29992;&#65292;&#21738;&#22359;&#31354;&#38386;&#31561;&#31561;&#65289;</P>
<P>&#20998;&#37197;&#26032;&#22534;&#31354;&#38388;&#30340;&#20195;&#30721;&#23601;&#33021;&#20351;&#29992;&#36825;&#20123;&#26412;&#22320;&#21464;&#37327;&#65292;&#20915;&#23450;&#23558;&#35201;&#20998;&#37197;&#30340;&#25968;&#25454;&#26159;&#21344;&#25454;&#32447;&#31243;&#24050;&#26377;&#65288;&#20294;&#31354;&#38386;&#65289;&#30340;&#22534;&#31354;&#38388;&#65292;&#36824;&#26159;&#20174;&#20849;&#20139;&#22534;&#31354;&#38388;&#20013;&#33719;&#21462;&#26032;&#30340;&#20869;&#23384;&#65311;</P>
<P></SPAN>