<strong><font color="blue">extent : </font></strong><SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> extent</SPAN> 
<P>&nbsp;1&#8195; to ... extent&nbsp;used to say how true something is or how great an effect or change is &#21040;&#8230;&#31243;&#24230;&#65307;&#22312;&#8230;&#31243;&#24230;&#19978;
<P>to a certain extent/to some extent/to an extent (=partly) &#22312;&#26576;&#31181;&#31243;&#24230;&#19978;
<P>&nbsp;We all to some extent remember the good times and forget the bad.
<P>&#25105;&#20204;&#22312;&#26576;&#31181;&#31243;&#24230;&#19978;&#37117;&#20250;&#35760;&#20303;&#32654;&#22909;&#26102;&#20809;&#32780;&#24536;&#25481;&#19981;&#24841;&#24555;&#30340;&#20107;&#24773;&#12290;
<P>&nbsp;I do agree with him to an extent.
<P>&#25105;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#30830;&#23454;&#21516;&#24847;&#20182;&#30340;&#24847;&#35265;&#12290;
<P>to a great/large extent
<P>&nbsp;Its success will depend to a large extent on local attitudes.
<P>&#27492;&#20107;&#30340;&#25104;&#21151;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#23558;&#21462;&#20915;&#20110;&#24403;&#22320;&#20154;&#30340;&#24577;&#24230;&#12290;
<P>to a lesser/greater extent (=less or more) &#22312;&#36739;&#36731;/&#26356;&#22823;&#31243;&#24230;&#19978;
<P>&nbsp;It will affect farmers in Spain and to a lesser extent in France.
<P>&#36825;&#23558;&#24433;&#21709;&#21040;&#35199;&#29677;&#29273;&#30340;&#20892;&#27665;&#65292;&#20854;&#27425;&#26159;&#27861;&#22269;&#20892;&#27665;&#12290;
<P>&nbsp;They examined the extent to which (=how much) age affected language-learning ability.
<P>&#20182;&#20204;&#35843;&#26597;&#20102;&#24180;&#40836;&#20250;&#22312;&#22810;&#22823;&#31243;&#24230;&#19978;&#24433;&#21709;&#35821;&#35328;&#23398;&#20064;&#33021;&#21147;&#12290;
<P>&nbsp;To what extent (=how much) did she influence his decision?
<P>&#22905;&#22312;&#22810;&#22823;&#31243;&#24230;&#19978;&#24433;&#21709;&#20102;&#20182;&#30340;&#20915;&#23450;&#65311;
<P>to such an extent that/to the extent that (=so much that) &#36798;&#21040;&#22914;&#27492;&#31243;&#24230;/&#36798;&#21040;&#8230;&#30340;&#31243;&#24230;
<P>&nbsp;Violence increased to the extent that residents were afraid to leave their homes.
<P>&#26292;&#21147;&#20107;&#20214;&#29467;&#22686;&#65292;&#23621;&#27665;&#20204;&#37117;&#19981;&#25954;&#20986;&#38376;&#20102;&#12290;