<DIV class=header>
<DIV class=header><SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> 16 Examining the Symbol Table</SPAN></FONT></DIV>
<P>The commands described in this chapter allow you to inquire about the symbols (names of variables, functions and types) defined in your program. This information is inherent in the text of your program and does not change as your program executes.<SPAN>&nbsp;</SPAN><SMALL><FONT size=2>GDB</FONT></SMALL><SPAN>&nbsp;</SPAN>finds it in your program&#8217;s symbol table, in the file indicated when you started<SPAN>&nbsp;</SPAN><SMALL><FONT size=2>GDB</FONT></SMALL><SPAN>&nbsp;</SPAN>(see<SPAN>&nbsp;</SPAN><A href="https://sourceware.org/gdb/current/onlinedocs/gdb/File-Options.html#File-Options">Choosing Files</A>), or by one of the file-management commands (see<SPAN>&nbsp;</SPAN><A href="https://sourceware.org/gdb/current/onlinedocs/gdb/Files.html#Files">Commands to Specify Files</A>).</P><A name=index-symbol-names></A><SPAN></SPAN><A name=index-names-of-symbols></A><SPAN></SPAN><A name=index-quoting-names></A><SPAN></SPAN><A name=quoting-names></A>

<P>For C code, the type names may also have the form &#8216;<SAMP>class<SPAN>&nbsp;</SPAN><VAR>class-name</VAR></SAMP>&#8217;, &#8216;<SAMP>struct<SPAN>&nbsp;</SPAN><VAR>struct-tag</VAR></SAMP>&#8217;, &#8216;<SAMP>union<SPAN>&nbsp;</SPAN><VAR>union-tag</VAR></SAMP>&#8217; or &#8216;<SAMP>enum<SPAN>&nbsp;</SPAN><VAR>enum-tag</VAR></SAMP>&#8217;.</P>
<P><VAR>flags</VAR><SPAN>&nbsp;</SPAN>can be used to modify how the type is displayed. Available flags are:</P>
<DL compact>
<DT><CODE><FONT face="Courier New">r</FONT></CODE> 
<DD>
<P>Display in &#8220;raw&#8221; form. Normally,<SPAN>&nbsp;</SPAN><SMALL><FONT size=2>GDB</FONT></SMALL><SPAN>&nbsp;</SPAN>substitutes template parameters and typedefs defined in a class when printing the class&#8217; members. The<SPAN>&nbsp;</SPAN><CODE><FONT face="Courier New">/r</FONT></CODE><SPAN>&nbsp;</SPAN>flag disables this.</P>
<DT><CODE><FONT face="Courier New">m</FONT></CODE> 
<DD>
<P>Do not print methods defined in the class.</P>
<DT><CODE><FONT face="Courier New">M</FONT></CODE> 
<DD>
<P>Print methods defined in the class. This is the default, but the flag exists in case you change the default with<SPAN>&nbsp;</SPAN><CODE><FONT face="Courier New">set print type methods</FONT></CODE>.</P>
<DT><CODE><FONT face="Courier New">t</FONT></CODE> 
<DD>
<P>Do not print typedefs defined in the class. Note that this controls whether the typedef definition itself is printed, not whether typedef names are substituted when printing other types.</P>
<DT><CODE><FONT face="Courier New">T</FONT></CODE> 
<DD>
<P>Print typedefs defined in the class. This is the default, but the flag exists in case you change the default with<SPAN>&nbsp;</SPAN><CODE><FONT face="Courier New">set print type typedefs</FONT></CODE>.</P>
<DT><CODE><FONT face="Courier New">o</FONT></CODE> 
<DD>
<P>Print the offsets and sizes of fields in a struct, similar to what the<SPAN>&nbsp;</SPAN><CODE><FONT face="Courier New">pahole</FONT></CODE><SPAN>&nbsp;</SPAN>tool does. This option implies the<SPAN>&nbsp;</SPAN><CODE><FONT face="Courier New">/tm</FONT></CODE><SPAN>&nbsp;</SPAN>flags.</P>
<DT><CODE><FONT face="Courier New">x</FONT></CODE> 
<DD>
<P>Use hexadecimal notation when printing offsets and sizes of fields in a struct.</P>
<DT><CODE><FONT face="Courier New">d</FONT></CODE> 
<DD>
<P>Use decimal notation when printing offsets and sizes of fields in a struct.</P>
<P>For example, given the following declarations:</P>
<DIV class=smallexample><PRE class=smallexample>struct tuv
{
  int a1;
  char *a2;
  int a3;
};

struct xyz
{
  int f1;
  char f2;
  void *f3;
  struct tuv f4;
};

union qwe
{
  struct tuv fff1;
  struct xyz fff2;
};

struct tyu
{
  int a1 : 1;
  int a2 : 3;
  int a3 : 23;
  char a4 : 2;
  int64_t a5;
  int a6 : 5;
  int64_t a7 : 3;
};
</PRE></DIV>
<P>Issuing a<SPAN>&nbsp;</SPAN><KBD>ptype /o struct tuv</KBD><SPAN>&nbsp;</SPAN>command would print:</P>
<DIV class=smallexample><PRE class=smallexample>(gdb) ptype /o struct tuv
/* offset      |    size */  type = struct tuv {
/*      0      |       4 */    int a1;
/* XXX  4-byte hole      */
/*      8      |       8 */    char *a2;
/*     16      |       4 */    int a3;

                               /* total size (bytes):   24 */
                             }
</PRE></DIV>
<P>Notice the format of the first column of comments. There, you can find two parts separated by the &#8216;<SAMP>|</SAMP>&#8217; character: the<SPAN>&nbsp;</SPAN><EM>offset</EM>, which indicates where the field is located inside the struct, in bytes, and the<SPAN>&nbsp;</SPAN><EM>size</EM><SPAN>&nbsp;</SPAN>of the field. Another interesting line is the marker of a<SPAN>&nbsp;</SPAN><EM>hole</EM><SPAN>&nbsp;</SPAN>in the struct, indicating that it may be possible to pack the struct and make it use less space by reorganizing its fields.</P>
<P>It is also possible to print offsets inside an union:</P>
<DIV class=smallexample><PRE class=smallexample>(gdb) ptype /o union qwe
/* offset      |    size */  type = union qwe {
/*                    24 */    struct tuv {
/*      0      |       4 */        int a1;
/* XXX  4-byte hole      */
/*      8      |       8 */        char *a2;
/*     16      |       4 */        int a3;

                                   /* total size (bytes):   24 */
                               } fff1;
/*                    40 */    struct xyz {
/*      0      |       4 */        int f1;
/*      4      |       1 */        char f2;
/* XXX  3-byte hole      */
/*      8      |       8 */        void *f3;
/*     16      |      24 */        struct tuv {
/*     16      |       4 */            int a1;
/* XXX  4-byte hole      */
/*     24      |       8 */            char *a2;
/*     32      |       4 */            int a3;

                                       /* total size (bytes):   24 */
                                   } f4;

                                   /* total size (bytes):   40 */
                               } fff2;

                               /* total size (bytes):   40 */
                             }
</PRE></DIV>
<P>In this case, since<SPAN>&nbsp;</SPAN><CODE><FONT face="Courier New">struct tuv</FONT></CODE><SPAN>&nbsp;</SPAN>and<SPAN>&nbsp;</SPAN><CODE><FONT face="Courier New">struct xyz</FONT></CODE><SPAN>&nbsp;</SPAN>occupy the same space (because we are dealing with an union), the offset is not printed for them. However, you can still examine the offset of each of these structures&#8217; fields.</P>
<P>Another useful scenario is printing the offsets of a struct containing bitfields:</P>
<DIV class=smallexample><PRE class=smallexample>(gdb) ptype /o struct tyu
/* offset      |    size */  type = struct tyu {
/*      0:31   |       4 */    int a1 : 1;
/*      0:28   |       4 */    int a2 : 3;
/*      0: 5   |       4 */    int a3 : 23;
/*      3: 3   |       1 */    signed char a4 : 2;
/* XXX  3-bit hole       */
/* XXX  4-byte hole      */
/*      8      |       8 */    int64_t a5;
/*     16: 0   |       4 */    int a6 : 5;
/*     16: 5   |       8 */    int64_t a7 : 3;
/* XXX  7-byte padding   */

                               /* total size (bytes):   24 */
                             }
</PRE></DIV>
<P>Note how the offset information is now extended to also include the first bit of the bitfield.</P></DD></DL><A name=index-ptype></A>
<DT><CODE><FONT face="Courier New">ptype[/<VAR>flags</VAR>] [<VAR>arg</VAR>]</FONT></CODE> 
<DD>
<P><CODE><FONT face="Courier New">ptype</FONT></CODE><SPAN>&nbsp;</SPAN>accepts the same arguments as<SPAN>&nbsp;</SPAN><CODE><FONT face="Courier New">whatis</FONT></CODE>, but prints a detailed description of the type, instead of just the name of the type. See<SPAN>&nbsp;</SPAN><A href="https://sourceware.org/gdb/current/onlinedocs/gdb/Expressions.html#Expressions">Expressions</A>.</P>
