<STRONG><FONT color=blue>&#38142;&#36335;&#23618; : &#20132;&#25442;&#26426;&#32593;&#32476; : </FONT></STRONG>
<H3 id=&#23567;&#32467;><SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> &#38142;&#36335;&#23618; : &#20132;&#25442;&#26426;&#32593;&#32476; : &#23567;&#32467;</SPAN></FONT></H3><SPAN class=extract>
<P>&#38142;&#36335;&#23618;&#20013;&#21547;&#26377;&#20004;&#31181;&#20027;&#27969;&#30340;&#32593;&#32476;&#65306;</P>
<OL>
<LI>&#24191;&#25773;&#32593;&#32476;&#65307; 
<LI>&#20132;&#25442;&#26426;&#32593;&#32476;&#65307;</LI></OL></SPAN>
<P>&#19968;&#20123;&#32972;&#21518;&#30340;&#19996;&#35199;&#65306;</P>
<OL>
<LI>
<P><SPAN class=extract>&#38598;&#32447;&#22120;&#25152;&#20998;&#21106;&#30340;&#26159;&#19981;&#21516;&#30340;<U>&#32593;&#27573;</U>&#65288;<EM>network segment</EM>&#65289;</SPAN>&#65292;<SPAN class=extract>&#20132;&#25442;&#26426;&#25152;&#20998;&#21106;&#30340;&#23545;&#35937;&#26159;&#19981;&#21516;&#30340;<U>&#20914;&#31361;&#22495;</U>&#65288;<EM>collision domain</EM>&#65289;</SPAN>&#65292;<SPAN class=extract>&#36335;&#30001;&#22120;&#20998;&#21106;&#30340;&#26159;&#19981;&#21516;&#30340; LAN</SPAN>&#12290;&#24456;&#26174;&#28982;&#65292;<SPAN class=extract>&#19968;&#20010; LAN &#20013;&#21487;&#20197;&#25317;&#26377;&#22810;&#20010;&#20132;&#25442;&#26426;&#12289;&#22810;&#20010;&#20914;&#31361;&#22495;</SPAN>&#65307;</P>
<LI>
<P><SPAN class=extract>&#20197;&#22826;&#32593; LAN &#20869;&#35774;&#22791;&#20256;&#36755;&#25968;&#25454;&#65292;&#38656;&#35201;&#20511;&#21161; MAC &#22320;&#22336;&#30830;&#23450;&#25237;&#36882;&#25968;&#25454;&#24103;&#30340;&#26041;&#21521;</SPAN>&#12290;<SPAN class=extract>&#30456;&#27604;&#20110; LAN &#26356;&#22823;&#21306;&#22495;&#30340;&#36890;&#20449;&#21017;&#38656;&#35201;&#36890;&#36807; IP &#22320;&#22336;&#23454;&#29616;</SPAN>&#12290;&#28041;&#21450;&#21040;&#36825;&#26041;&#38754;&#30340;&#34892;&#20026;&#21487;&#24402;&#32435;&#22914;&#19979;&#65306;</P>
<OL>
<LI><SPAN class=extract>NIC &#24819;&#35201;&#23558;&#25968;&#25454;&#21457;&#36865;&#21040; LAN &#20013;&#30340;&#20854;&#20182; NIC &#65306;&#22914;&#26524;&#23427;&#30340;ARP &#34920;&#20013;&#24182;&#27809;&#26377;&#30446;&#30340;&#22320;&#30456;&#20851;&#26465;&#30446;&#65292;&#21017;&#20250;&#21457;&#36865;&#19968;&#20010;&#24191;&#25773; ARP &#21253;&#35810;&#38382;&#32593;&#32476;&#19978;&#30340; NIC &#65292;&#33719;&#24471;&#30446;&#30340; MAC &#22320;&#22336;&#20043;&#21518;&#20877;&#21457;&#36865;&#22320;&#22336;&#23450;&#21521;&#30340;&#25968;&#25454;&#24103;</SPAN>&#65307;</LI></OL>
<LI><SPAN class=extract>
<P>&#20132;&#25442;&#26426;&#30456;&#20851;&#34892;&#20026;&#65306;</P>
<OL>
<LI>&#23545;&#20110;&#20219;&#20309;&#25509;&#25910;&#21040;&#30340;&#25968;&#25454;&#24103;&#65292;&#20132;&#25442;&#26426;&#37117;&#20250;&#35835;&#21462;&#25968;&#25454;&#24103;&#26469;&#28304; MAC &#22320;&#22336;&#21644;&#23545;&#24212;&#30340;<U>&#20132;&#25442;&#26426;&#25509;&#21475;</U>&#24182;&#23558;&#36825;&#20010;&#26465;&#30446;&#20445;&#23384;&#21040;&#20132;&#25442;&#34920;&#20013;&#65307; 
<LI>&#20132;&#25442;&#34920;&#20013;&#27809;&#26377;&#19982;&#30446;&#26631; MAC &#22320;&#22336;&#23545;&#24212;&#30340;&#20132;&#25442;&#26426;&#25509;&#21475;&#65306;&#23558;&#35813;&#25968;&#25454;&#24103;&#24191;&#25773;&#21040;&#25152;&#26377;&#25509;&#21475;&#20013;&#65288;&#19981;&#21253;&#25324;&#26469;&#28304;&#65289;&#65307; 
<LI>&#23545;&#20110;&#30693;&#36947;&#30446;&#26631; MAC &#22320;&#22336;&#23545;&#24212;&#30340;&#20132;&#25442;&#26426;&#25509;&#21475;&#30340;&#25968;&#25454;&#24103;&#65306;&#20132;&#25442;&#26426;&#20250;&#30452;&#25509;&#23558;&#25968;&#25454;&#25512;&#36865;&#21040;&#23545;&#24212;&#25509;&#21475;&#20013;&#65307; 
<LI>&#23613;&#31649;&#20132;&#25442;&#26426;&#34920;&#20013;&#30830;&#23454;&#26377;&#30456;&#20851;&#26465;&#30446;&#65292;&#20294;&#26159;&#26465;&#30446;&#20013;&#25351;&#31034;&#30340;&#25509;&#21475;&#23601;&#26159;&#25968;&#25454;&#24103;&#30340;&#26469;&#28304;&#25509;&#21475;&#65306;&#30452;&#25509;&#20002;&#24323;&#65288;&#20195;&#34920;&#25509;&#21475;&#32593;&#27573;&#26159;&#24191;&#25773;&#39057;&#36947;&#65289;&#65307;</LI></OL></SPAN></LI></OL>
<P>&#25972;&#20307;&#36923;&#36753;&#65306;</P>
<OL>
<LI>
<P><SPAN class=extract>LAN &#30340;&#21010;&#20998;&#24182;&#19981;&#26159;&#36890;&#36807;&#20132;&#25442;&#26426;&#25110;&#32773;&#38598;&#32447;&#22120;&#36827;&#34892;&#21010;&#20998;&#30340;&#65292;&#32780;&#26159;&#36890;&#36807;&#36335;&#30001;&#22120;&#36827;&#34892;&#21010;&#20998;&#30340;</SPAN>&#12290;<SPAN class=extract></P>
<P>&#36825;&#19968;&#28857;&#21487;&#20197;&#20174;&#20004;&#20010;&#26041;&#38754;&#30475;&#20986;&#26469;&#65306;</P>
<OL>
<LI>&#36335;&#30001;&#22120;&#20250;&#23558;&#20256;&#36882;&#32473;&#33258;&#24049;&#30340;&#25968;&#25454;&#24103;&#35299;&#21253;&#65292;&#26681;&#25454;&#20854;&#20013;&#21253;&#21547;&#30340; IP &#22320;&#22336;&#65292;&#32467;&#21512;&#33258;&#24049;&#30340;&#36335;&#30001;&#34920;&#65292;&#25512;&#26029;&#20986;&#25509;&#19979;&#26469;&#35201;&#23558;&#27492;&#25968;&#25454;&#25253;&#21457;&#36865;&#21040;&#21738;&#20010;&#25509;&#21475;&#20013;&#12290;&#21516;&#26102;&#65292;&#22914;&#26524;&#36335;&#30001;&#22120;&#21457;&#29616;&#25509;&#19979;&#26469;&#36716;&#21457;&#30340;&#20301;&#32622;&#24182;&#19981;&#26159;&#20013;&#20171;&#36335;&#30001;&#22120;&#65292;&#32780;&#26159; LAN &#20013;&#30340;&#26576;&#20010;&#32456;&#31471;&#35774;&#22791;&#65292;&#19988;&#36825;&#20010;&#35774;&#22791;&#23601;&#20301;&#20110; LAN &#20013;&#65292;&#37027;&#20040;&#23601;&#20250;&#26681;&#25454;&#30446;&#26631; IP &#22320;&#22336;&#65292;&#26597;&#35810; ARP &#34920;&#65292;&#30830;&#23450;&#30446;&#26631;&#20027;&#26426;&#30340; MAC &#22320;&#22336;&#65307; 
<LI>&#22312; VLAN &#30340;&#23398;&#20064;&#36807;&#31243;&#20013;&#65292;&#19968;&#31181;&#22312;&#19981;&#21516; VLAN &#20043;&#38388;&#36827;&#34892;&#36890;&#20449;&#30340;&#26041;&#24335;&#26159;&#22806;&#25509;&#36335;&#30001;&#22120;&#65292;&#35753;&#19968;&#20010;&#31471;&#21475;&#21516;&#26102;&#23646;&#20110;&#20004;&#20010; VLAN&#12290;&#36825;&#26679;&#22914;&#26524;&#36825;&#20004;&#20010; VLAN &#20043;&#38388;&#24819;&#35201;&#36827;&#34892;&#36890;&#20449;&#30340;&#35805;&#65292;&#23601;&#24517;&#39035;&#32463;&#30001;&#36825;&#20010;&#31471;&#21475;&#23558;&#25968;&#25454;&#21457;&#36865;&#21040;&#36335;&#30001;&#22120;&#20013;&#20877;&#32463;&#30001;&#36335;&#30001;&#22120;&#23558;&#25968;&#25454;&#36716;&#21457;&#22238;&#26469;&#65307;</LI></OL></SPAN><SPAN class=extract>
<LI>
<P>&#36335;&#30001;&#22120;&#25509;&#21475;&#25110;&#32773;&#32456;&#31471;&#35774;&#22791;&#20351;&#29992; ARP &#34920;&#32500;&#25252;&#30446;&#30340;&#22320;&#22336;&#65292;&#20132;&#25442;&#26426;&#20351;&#29992;&#20132;&#25442;&#34920;&#32500;&#25252;&#30446;&#30340;&#22320;&#22336;&#65306;</P>
<OL>
<LI>ARP &#34920;&#20013;&#20165;&#20250;&#20445;&#23384;&#20854;&#25152;&#23646; LAN &#20013;&#20854;&#20182; NIC &#30340; MAC &#22320;&#22336;&#65292;&#22914;&#26524;&#24819;&#35201;&#23558;&#25968;&#25454;&#36716;&#21457;&#21040;&#22806;&#30028; LAN &#65292;&#38656;&#35201;&#23558;&#30446;&#26631; MAC &#22320;&#22336;&#35774;&#32622;&#20026;&#36335;&#30001;&#22120;&#25509;&#21475;&#30340; MAC &#22320;&#22336;&#65292;&#35753;&#36335;&#30001;&#22120;&#21033;&#29992;&#30446;&#26631; IP &#22320;&#22336;&#23558;&#25968;&#25454;&#36716;&#21457;&#21040;&#20854;&#20182; LAN &#20013;&#65307; 
<LI>&#20132;&#25442;&#26426;&#34920;&#20013;&#20250;&#20445;&#23384;&#25152;&#23646; LAN &#20013;&#20854;&#20182; NIC &#30340; MAC &#22320;&#22336;&#21644;&#20132;&#25442;&#26426;&#25509;&#21475;&#30340;&#23545;&#24212;&#20851;&#31995;&#65292;&#20294;&#24182;&#19981;&#20250;&#20445;&#23384; IP &#22320;&#22336;&#65292;&#20165;&#29992;&#20110;&#22312; LAN &#20869;&#37096;&#36716;&#21457;&#25968;&#25454;&#24103;&#65307;</LI></OL></SPAN>
<LI>
<P><SPAN class=extract>&#21482;&#26377; NIC &#25317;&#26377; MAC &#22320;&#22336;&#65292;&#20132;&#25442;&#26426;&#27809;&#26377; MAC &#22320;&#22336;&#12290;&#26412;&#36136;&#19978;&#26159;&#22240;&#20026;&#27809;&#26377;&#20219;&#20309;&#21521;&#20132;&#25442;&#26426;&#21457;&#36865;&#25968;&#25454;&#24103;&#30340;&#38656;&#27714;&#65292;&#22312;&#32456;&#31471;&#35774;&#22791;&#30340;&#30524;&#20013;&#65292;&#33258;&#24049;&#25152;&#22788;&#30340; LAN &#20013;&#23454;&#38469;&#19978;&#24182;&#19981;&#23384;&#22312;&#20132;&#25442;&#26426;&#36825;&#20010;&#19996;&#35199;</SPAN>&#65307;</P></LI></OL>