<SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> G.3 Function and Parameter Attributes</SPAN> 
<P></P>
<P><SPAN class=RefText></SPAN></FONT><SPAN class=extract></P>
<P>These macros de&#64257;ned in &lt;debug.h&gt; tell the compiler special attributes of a function or function parameter. Their expansions are GCC-speci&#64257;c.</P>
<P>&#21152;&#22312;&#20989;&#25968;&#21407;&#22411;&#25110;&#32773;&#20989;&#25968;&#21442;&#25968;&#20043;&#21518;&#30340;&#23439;&#23450;&#20041;&#22312; debug.h &#25991;&#20214;&#20013;</P></SPAN><SPAN class=extract>
<P>UNUSED Appended to a function parameter to tell the compiler that the parameter might not be used within the function. It suppresses the warning that would otherwise appear.</P>
<P>&#22914;&#26524;&#22312;&#20989;&#25968;&#24418;&#24335;&#21442;&#25968;&#21518;&#38754;&#21152;&#19978;&#19968;&#20010; UNUSED &#23439;&#65292;&#37027;&#20040;&#23601;&#20250;&#21578;&#35785;&#32534;&#35793;&#22120;&#36825;&#20010;&#24418;&#24335;&#21442;&#25968;&#21487;&#33021;&#19981;&#20250;&#22312;&#20989;&#25968;&#20013;&#34987;&#20351;&#29992;&#65292;&#23427;&#30340;&#20316;&#29992;&#26159;&#21387;&#21046;&#32534;&#35793;&#22120;&#30340;&#35686;&#21578;</P></SPAN><SPAN class=extract>
<P>NO_RETURN Appended to a function prototype to tell the compiler that the function never returns. </P>
<P>It allows the compiler to &#64257;ne-tune its warnings and its code generation.</P>
<P>&#22914;&#26524;&#22312;&#20989;&#25968;&#21407;&#22411;&#21518;&#38754;&#21152;&#19978;&#19968;&#20010; NO RETURN &#23601;&#30456;&#24403;&#20110;&#21578;&#35785;&#32534;&#35793;&#22120;&#36825;&#20010;&#20989;&#25968;&#27704;&#19981;&#36820;&#22238;&#12290;&#23427;&#30340;&#20316;&#29992;&#26159;&#20801;&#35768;&#32534;&#35793;&#22120;&#33021;&#26356;&#32454;&#31890;&#24230;&#22320;&#21576;&#29616;&#20854;&#35686;&#21578;&#20197;&#21450;&#25191;&#34892;&#20195;&#30721;&#29983;&#25104;</P></SPAN><SPAN class=extract>
<P>NO_INLINE Appended to a function prototype to tell the compiler to never emit the function in-line.</P>
<P>Occasionally useful to improve the quality of backtraces (see below).</P>
<P>&#22914;&#26524;&#22312;&#20989;&#25968;&#21407;&#22411;&#21518;&#38754;&#21152;&#19978;&#19968;&#20010; NO INLINE&#65292;&#23601;&#30456;&#24403;&#20110;&#21578;&#35785;&#32534;&#35793;&#22120;&#19981;&#35201;&#20869;&#32852;&#27492;&#20989;&#25968;&#12290;&#36825;&#20010;&#23439;&#26377;&#26102;&#20505;&#20250;&#34987;&#29992;&#20316;&#25552;&#21319; backtraces &#30340;&#36136;&#37327;</P></SPAN><STRONG><SPAN class=extract>
<P><STRONG>PRINTF FORMAT (format, &#64257;rst)</STRONG> Appended to a function prototype to tell the compiler that the function takes a printf-like format string as the argument numbered format (starting from 1) and that the corresponding value arguments start at the argument numbered first. This lets the compiler tell you if you pass the wrong argument types.</P>
<P>&#21578;&#35785;&#32534;&#35793;&#22120;&#36825;&#20010;&#20989;&#25968;&#20250;&#25509;&#25910;&#19968;&#20010;&#31867;&#20284;&#20110; printf &#30340;&#21442;&#25968;&#20316;&#20026;&#20854;&#21442;&#25968;<BR></P>
<P></SPAN></STRONG>