<OL class=q-box><SPAN><SPAN class=extract>
<LI class=q-relative><SPAN>A task is an executing piece of code. When it terminates, it disappears from the Task List.</SPAN> <BR>&#20219;&#21153;&#26159;&#19968;&#22359;&#21487;&#20379;&#25191;&#34892;&#30340;&#20195;&#30721;&#65292;&#32467;&#26463;&#20043;&#21518;&#23601;&#20250;&#20174;&#20219;&#21153;&#21015;&#34920;&#20013;&#28040;&#22833; 
<LI class=q-relative></SPAN></SPAN><SPAN><SPAN class=extract>
<LI class=q-relative><SPAN>An interrupt is a hardware-provided feature which causes the currently running task to be suspended and program control is handed to a predefined interrupt handling routine.</SPAN> <BR>&#20013;&#26029;&#30001;&#30828;&#20214;&#23450;&#20041;&#65292;&#23427;&#20250;&#20351;&#24471;&#24403;&#21069;&#20219;&#21153;&#34987;&#26242;&#20572;&#24182;&#23558;&#22788;&#29702;&#22120;&#25511;&#21046;&#26435;&#20132;&#32473;&#39044;&#20808;&#23450;&#22909;&#30340;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207; 
<LI class=q-relative></SPAN></SPAN><SPAN><SPAN class=extract>
<LI class=q-relative><SPAN>The interrupt handler determines what action is required following an interrupt. Hardware will generally provide an indication as to the cause of the interrupt so that the Interrupt Handler can launch the appropriate Interrupt Service Routine to service the interrupt.</SPAN> <BR>&#30828;&#20214;&#36890;&#24120;&#20250;&#25552;&#20379;&#20013;&#26029;&#30340;&#21407;&#22240;&#65292;&#22240;&#27492;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#23601;&#33021;&#35843;&#29992;&#21512;&#36866;&#30340;&#20013;&#26029;&#26381;&#21153;&#31243;&#24207;&#65288;Interrupt Service Routine&#65289;&#26469;&#20026;&#20013;&#26029;&#26381;&#21153;&#65288;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#30340;&#19978;&#21322;&#37096;&#20998;&#65311;&#65289; 
<LI class=q-relative></SPAN></SPAN><SPAN><SPAN class=extract>
<LI class=q-relative><SPAN>On return from the Interrupt Service Routine, the Scheduler determines which is the highest priority task waiting to execute, and launches it.</SPAN> <BR>&#24403;&#20174;&#20013;&#26029;&#26381;&#21153;&#31243;&#24207;&#20013;&#36820;&#22238;&#26102;&#65292;&#35843;&#24230;&#22120;&#20250;&#30830;&#23450;&#24403;&#21069;&#31561;&#24453;&#25191;&#34892;&#30340;&#26368;&#39640;&#20248;&#20808;&#32423;&#30340;&#20219;&#21153;&#26159;&#20160;&#20040;&#65292;&#24182;&#25191;&#34892;&#36825;&#20010;&#20219;&#21153;<SPAN><SPAN class=extract> </SPAN></SPAN>
<LI class=q-relative></SPAN></SPAN><SPAN><SPAN class=extract>
<LI class=q-relative><SPAN>In all of this, hardware assistance may exist to save registers and other machine state flags so that on return from interrupt, the machine is in stable state.<BR>&#30828;&#20214;&#21487;&#33021;&#20250;&#24110;&#21161;&#22788;&#29702;&#22120;&#20570;&#20445;&#23384;&#29366;&#24577;&#20043;&#31867;&#26381;&#21153;</SPAN></SPAN></SPAN></LI></OL>