&#9632;into 
<P></P>
<P>
<P>1. <SPAN class=extract>&#36825;&#20010;&#20171;&#35789;&#21518;&#38754;&#21152;&#19978;&#19968;&#20010;&#21517;&#35789;&#25110;&#26159;-ing&#21160;&#21517;&#35789;&#30701;&#35821;&#65288;&#30636;&#26102;&#21160;&#20316;&#25110;&#24310;&#32493;&#29366;&#24577;&#22343;&#21487;&#65289;&#65292;&#21069;&#38754;&#26377;&#19968;&#20010;&#34920;&#31034;&#23545;&#26576;&#20154;&#26045;&#21152;&#24433;&#21709;&#30340;&#21160;&#35789;&#65288;&#36890;&#24120;&#20063;&#26159;&#30636;&#26102;&#21160;&#20316;&#30340;&#31532;&#22235;&#31867;&#21160;&#35789;&#65289;&#65292;&#21152;&#22312;&#19968;&#36215;&#23601;&#34920;&#31034;&#24433;&#21709;&#26576;&#20154;&#20351;&#20043;&#20316;&#26576;&#20107;&#12290;&#21069;&#38754;&#30340;&#21160;&#35789;&#21482;&#35201;&#26159;&#34920;&#31034;&#26045;&#21152;&#24433;&#21709;&#30340;&#23601;&#21487;&#20197;&#65292;&#22240;&#27492;&#20960;&#20046;&#21487;&#20197;&#33258;&#30001;&#25645;&#37197;&#12290;&#22914;&#26524;&#21069;&#38754;&#30340;&#21160;&#20316;&#26159;&#23436;&#25104;&#20102;&#30340;&#65292;&#21518;&#38754;&#30340;&#21160;&#20316;&#36890;&#24120;&#20063;&#23601;&#26159;&#23436;&#25104;&#20102;&#30340;&#12290;&#12304;&#20363;&#22914;&#12305;They deceived you into signing these documents. &#20182;&#20204;&#39575;&#20102;&#20320;&#31614;&#32626;&#36825;&#20123;&#25991;&#20214;&#12290;/ He tried to intimidate them into cooperating with him. &#20182;&#35797;&#22270;&#24683;&#21523;&#20182;&#20204;&#21435;&#21516;&#20182;&#21512;&#20316;</SPAN>&#12290;/ <SPAN class=extract>Saturation advertising and sales promotion brainwashed physicians into believing the drug was a panacea for everything. &#38138;&#22825;&#30422;&#22320;&#30340;&#24191;&#21578;&#21644;&#20419;&#38144;&#27963;&#21160;&#32473;&#21307;&#29983;&#20204;&#27927;&#20102;&#33041;&#31563;&#65292;&#20351;&#24471;&#20182;&#20204;&#30456;&#20449;&#36825;&#31181;&#33647;&#26159;&#21253;&#27835;&#30334;&#30149;&#30340;&#19975;&#28789;&#31070;&#33647;&#12290;</SPAN>/ Current 3-D displays, which show each eye a piecemeal image and trick the brain into combining them, can cause headaches and nausea. &#30446;&#21069;&#20351;&#29992;&#30340;&#19977;&#32500;&#26174;&#31034;&#65292;&#21521;&#27599;&#21482;&#30524;&#30555;&#25552;&#20379;&#19968;&#20010;&#20998;&#21035;&#30340;&#22270;&#20687;&#65292;&#28982;&#21518;&#21700;&#22823;&#33041;&#25226;&#22270;&#20687;&#32508;&#21512;&#36215;&#26469;&#65292;&#36825;&#21487;&#33021;&#24341;&#36215;&#22836;&#30140;&#21644;&#24694;&#24515;&#12290;/ They inveigled the customers into looking more favourably on the product. &#20182;&#20204;&#33945;&#39575;&#39038;&#23458;&#65292;&#20351;&#20043;&#23545;&#20135;&#21697;&#20135;&#29983;&#26356;&#22823;&#30340;&#22909;&#24863;&#12290;/ The local tyrants coerced the population into executing their orders. &#22303;&#35946;&#38376;&#24378;&#36843;&#23621;&#27665;&#25191;&#34892;&#20182;&#20204;&#30340;&#21629;&#20196;&#12290;/ They hounded people into joining the army. &#20182;&#20204;&#36214;&#20154;&#20204;&#21442;&#21152;&#20891;&#38431;&#12290;/ <SPAN class=extract>The robber scared his victims into coughing up whatever he demanded. &#21163;&#21290;&#24656;&#21523;&#21463;&#23475;&#20154;&#25343;&#20986;&#20182;&#25152;&#35201;&#30340;&#19968;&#20999;&#12290;/</SPAN> <SPAN class=extract>This trick fooled outsiders into thinking that everything there was real. &#36825;&#20010;&#38556;&#30524;&#27861;&#33945;&#39575;&#20102;&#23616;&#22806;&#20154;&#65292;&#20351;&#20182;&#20204;&#20197;&#20026;&#37027;&#37324;&#19968;&#20999;&#37117;&#26159;&#30495;&#30340;&#12290;/ </SPAN>Zarawi, who personally performed beheadings for the video camera, terrorized people into silence. (Newsweek, June 19, 2006, p. 25) &#25166;&#21345;&#32500;&#20146;&#33258;&#22312;&#24405;&#20687;&#26426;&#21069;&#23454;&#34892;&#26025;&#39318;&#65292;&#21523;&#24471;&#20154;&#20204;&#19981;&#25954;&#22768;&#24352;&#12290;/ They will never be starved into submission. &#20182;&#20204;&#20915;&#19981;&#20250;&#22240;&#39269;&#39295;&#32780;&#23624;&#26381;&#12290;/ Your pituitary has to produce more TSH in an effort to stimulate your thyroid gland into producing more thyroid hormone. &#20320;&#30340;&#22402;&#20307;&#21482;&#22909;&#21046;&#36896;&#26356;&#22810;&#30340;&#20419;&#30002;&#29366;&#33146;&#28608;&#32032;&#65292;&#20197;&#20415;&#21050;&#28608;&#30002;&#29366;&#33146;&#21046;&#36896;&#20986;&#26356;&#22810;&#30340;&#30002;&#29366;&#33146;&#28608;&#32032;&#12290;/ Clergymen, like psychiatrists, often flatter themselves into believing that their magic has turned around the hardest cases. (Froma Harrop, in The Daily Gazette, Jan. 2, 2008, A7) &#31070;&#32844;&#20154;&#21592;&#20687;&#24515;&#29702;&#21307;&#29983;&#19968;&#26679;&#65292;&#24120;&#24120;&#33258;&#25105;&#38518;&#37257;&#65292;&#30456;&#20449;&#33258;&#24049;&#30340;&#39764;&#27861;&#33021;&#22815;&#23558;&#26368;&#38590;&#21150;&#30340;&#20107;&#24577;&#25197;&#36716;&#36807;&#26469;&#12290;/ They brainwashed, bribed and blackmailed him into testifying in their favor. &#20182;&#20204;&#23545;&#20182;&#21152;&#20197;&#27927;&#33041;&#12289;&#25910;&#20080;&#12289;&#32961;&#36843;&#65292;&#20351;&#20182;&#26367;&#20182;&#20204;&#20316;&#20102;&#35777;&#12290;</P>
<P></P><SPAN class=extract>
<P>&#22312;&#21069;&#38754;&#21516;into&#25645;&#37197;&#30340;&#21160;&#35789;&#65292;&#21253;&#23481;&#24615;&#21313;&#20998;&#24191;&#65292;&#29978;&#33267;&#21487;&#20197;&#25343;&#21517;&#35789;&#26469;&#20511;&#29992;&#20026;&#21160;&#35789;&#12290;&#12304;&#20363;&#22914;&#12305;He brushed off worries about inflation, strong-arming businesses into freezing prices and ordering an underling to doctor the consumer-price index. (The Economist, May 3, 2008, p. 46) &#20182;&#25226;&#23545;&#20110;&#36890;&#36135;&#33192;&#32960;&#30340;&#39038;&#34385;&#19968;&#31508;&#21246;&#38144;&#65292;&#29992;&#38081;&#33109;&#25163;&#27573;&#24378;&#36843;&#20225;&#19994;&#20923;&#32467;&#20215;&#26684;&#65292;&#24182;&#21629;&#20196;&#19968;&#20301;&#19979;&#23646;&#21435;&#31713;&#25913;&#28040;&#36153;&#29289;&#20215;&#25351;&#25968;&#12290;/ The goal is to blitzkrieg the bad stem cells into nonexistence in a few days. &#30446;&#30340;&#26159;&#35201;&#22312;&#20960;&#22825;&#20043;&#20869;&#20197;&#38378;&#30005;&#25112;&#30340;&#26041;&#24335;&#25226;&#22351;&#30340;&#24178;&#32454;&#32990;&#28040;&#28781;&#25481;&#12290;</P>
<P></SPAN>
<P></P><SPAN class=extract>&#26377;&#26102;&#20505;&#21069;&#38754;&#30340;&#37027;&#20010;&#21160;&#35789;&#21487;&#20197;&#26412;&#26469;&#26159;&#19981;&#21450;&#29289;&#21160;&#35789;&#32780;&#20511;&#29992;&#20316;&#21450;&#29289;&#21160;&#35789;&#12290;&#12304;&#20363;&#22914;&#12305;She tried to talk him into taking a week's vacation. &#22905;&#21147;&#22270;&#35828;&#26381;&#20182;&#21435;&#24230;&#19968;&#20010;&#26143;&#26399;&#30340;&#20551;&#12290;/ They reasoned him into agreeing to the plan. &#20182;&#20204;&#20197;&#29702;&#35828;&#26381;&#20102;&#20182;&#21516;&#24847;&#37027;&#20010;&#35745;&#21010;&#12290;</SPAN> 
<P></P>
<P>
<P>&#26377;&#26102;&#20505;&#21518;&#38754;&#19981;&#26159;&#21160;&#21517;&#35789;&#32780;&#26159;&#21517;&#35789;&#65292;&#20294;&#21069;&#38754;&#20173;&#28982;&#21487;&#20197;&#23558;&#19981;&#21450;&#29289;&#21160;&#35789;&#20511;&#29992;&#20026;&#21450;&#29289;&#21160;&#35789;&#12290;&#12304;&#20363;&#22914;&#12305;But we were supposed to be looking for WMDs! Where are they? We were lied into war! &#25105;&#20204;&#26412;&#26469;&#26159;&#35201;&#25214;&#22823;&#35268;&#27169;&#27585;&#28781;&#24615;&#27494;&#22120;&#30340;&#21568;&#65281;&#25105;&#20204;&#26159;&#34987;&#39575;&#36827;&#25112;&#20105;&#20043;&#20013;&#30340;&#65281;</P>
<P>
<P><SPAN class=extract>&#21518;&#38754;&#30340;&#21160;&#35789;&#29992;to inf. &#36824;&#26159;&#29992;into + -ing&#65292;&#26377;&#26102;&#20505;&#24847;&#20041;&#19981;&#21516;&#12290;&#20363;&#22914;pressure somebody to inf. &#21487;&#33021;&#26159;&#8220;&#26045;&#21152;&#21387;&#21147;&#20294;&#32467;&#26524;&#26410;&#26126;&#8221;&#65292;&#32780;pressure somebody into + -ing&#21017;&#26159;&#8220;&#26045;&#21152;&#21387;&#21147;&#36798;&#21040;&#20102;&#32467;&#26524;&#8221;&#12290;&#35814;&#35265;pressure&#26465;&#12290;</SPAN></P>
<P></P><SPAN class=extract>
<P>&#21453;&#20043;&#65292;&#22914;&#26524;&#19981;&#29992;into + -ing&#32780;&#29992;out of + -ing,&#21017;&#26159;&#30456;&#21453;&#30340;&#24847;&#24605;&#12290;&#12304;&#20363;&#22914;&#12305;His doctor tried to talk him out of smoking. &#20182;&#30340;&#21307;&#29983;&#21147;&#22270;&#35828;&#26381;&#20182;&#21035;&#25277;&#28895;&#12290;</P>
<P></SPAN>
<P></P>2.<SPAN class=extract>into&#21516;&#21069;&#38754;&#30340;&#21160;&#35789;&#30456;&#37197;&#21512;&#65292;&#21487;&#20197;&#26354;&#25240;&#20135;&#29983;&#20986;&#26032;&#30340;&#24847;&#20041;&#12290;&#12304;&#20363;&#22914;&#12305;He talked himself into the job. &#20182;&#20105;&#21462;&#21040;&#20102;&#37027;&#20010;&#32844;&#20301;&#12290;</SPAN> 
<P></P>
<P>
<P>3. <SPAN class=extract>into&#36824;&#26377;&#26102;&#38388;&#19978;&#30340;&#24847;&#20041;&#65292;&#34920;&#31034;&#20174;&#21069;&#38754;&#19968;&#27573;&#26102;&#38388;&#24310;&#38271;&#21040;&#21518;&#38754;&#19968;&#27573;&#26102;&#38388;&#20043;&#20013;&#12290;&#12304;&#20363;&#22914;&#12305;They talked far into the night. &#20182;&#20204;&#19968;&#30452;&#35848;&#21040;&#28145;&#22812;&#12290;/ Through the remainder of 1960, and into 1961, she immersed herself in teaching the sales force how to sell. &#20174;1960&#24180;&#30340;&#19979;&#21322;&#27573;&#30452;&#21040;1961&#24180;&#65292;&#22905;&#19968;&#30452;&#22475;&#22836;&#20110;&#25945;&#25512;&#38144;&#20154;&#21592;&#22914;&#20309;&#21435;&#25512;&#38144;&#12290;/ The antagonism between them persisted into the future. &#20182;&#20204;&#20043;&#38388;&#30340;&#23545;&#31435;&#65292;&#19968;&#30452;&#24310;&#32493;&#21040;&#21518;&#26469;&#12290;/ His colleagues were aware of his lifelong habit of sleeping late into the day. &#20182;&#30340;&#21516;&#20107;&#20204;&#37117;&#30693;&#36947;&#20182;&#19968;&#36744;&#23376;&#26377;&#30561;&#21040;&#26085;&#19978;&#19977;&#31487;&#30340;&#20064;&#24815;&#12290;/ Crews worked into the night to restore power, but many customers were expected to remain in the dark through the weekend and into next week. &#24037;&#20316;&#20154;&#21592;&#36830;&#22812;&#25250;&#20462;&#20379;&#30005;&#65292;&#20294;&#26159;&#20272;&#35745;&#35768;&#22810;&#29992;&#25143;&#25972;&#20010;&#21608;&#26411;&#30452;&#21040;&#19979;&#21608;&#37117;&#20250;&#19968;&#30452;&#27809;&#26377;&#30005;&#12290;</SPAN></P>
<P></P><SPAN class=extract>
<P>&#20063;&#21487;&#20197;&#19981;&#34920;&#31034;&#26576;&#36807;&#31243;&#20174;&#20197;&#21069;&#24310;&#32493;&#21040;&#26576;&#19968;&#26102;&#27573;&#65292;&#32780;&#21482;&#26159;&#34920;&#31034;&#26576;&#20107;&#21457;&#29983;&#22312;&#26576;&#26102;&#27573;&#65288;&#30456;&#24403;&#20110;&#8220;&#22810;&#38271;&#26102;&#38388;after the beginning of&#8221;&#65289;&#24320;&#22987;&#21518;&#22810;&#20037;&#30340;&#19968;&#20010;&#26102;&#38388;&#28857;&#12290;&#12304;&#20363;&#22914;&#12305;She died just two years into their marriage. &#20182;&#20204;&#23130;&#21518;&#20004;&#24180;&#65292;&#22905;&#23601;&#21435;&#19990;&#20102;&#12290;/ Ten minutes into the debate, he wondered how he could have been worried at all. &#36777;&#35770;&#24320;&#22987;&#21518;&#21313;&#20998;&#38047;&#65292;&#20182;&#23601;&#24863;&#21040;&#33258;&#24049;&#21407;&#26469;&#20309;&#24517;&#22914;&#27492;&#25285;&#24515;&#12290;</P>
<P></SPAN>
<P></P>3. <SPAN class=extract>into&#36824;&#26377;&#19968;&#20010;&#32972;&#31163;&#20102;&#8220;&#36827;&#20837;&#37324;&#38754;&#8221;&#30340;&#21407;&#20041;&#30340;&#24847;&#20041;&#65292;&#26159;&#8220;&#30896;&#21040;&#8221;&#12289;&#8220;&#30896;&#25758;&#8221;&#65288;&#37117;&#26159;&#22806;&#37096;&#23545;&#22806;&#37096;&#30340;&#65289;&#65292;&#27492;&#26102;&#23427;&#24120;&#21516;&#21160;&#35789;bump, jump, crash, knock, go, run&#31561;&#19968;&#36215;&#20351;&#29992;&#12290;&#12304;&#20363;&#22914;&#12305;He turned on the lamp so that he could find his way without bumping into anything. &#20182;&#25226;&#28783;&#28857;&#30528;&#65292;&#36825;&#26679;&#23601;&#33021;&#22815;&#30475;&#36335;&#65292;&#19981;&#20250;&#30896;&#21040;&#20160;&#20040;&#19996;&#35199;&#12290;/ The man bumped into me as he came out of the shop. &#37027;&#20010;&#20154;&#20174;&#24215;&#37324;&#36208;&#20986;&#26469;&#30340;&#26102;&#20505;&#21516;&#25105;&#25758;&#20102;&#20010;&#28385;&#24576;&#12290;/ I ran into your aunt yesterday. &#25105;&#26152;&#22825;&#30896;&#35265;&#20102;&#20320;&#30340;&#23016;&#22920;&#12290;/ The bus crashed into a truck. &#20844;&#20849;&#27773;&#36710;&#25758;&#21040;&#20102;&#19968;&#36742;&#21345;&#36710;&#37027;&#37324;&#12290;/ They crashed into a wall. &#20182;&#20204;&#30896;&#21040;&#20102;&#22681;&#22721;&#12290;</SPAN>