<strong><font color="blue"> : </font></strong>

<P>
<P>settle
<P>v
<P>make one's permanent home in (a country, etc) as a colonist &#22312;&#65288;&#26576;&#22269;&#31561;&#65289;&#27542;&#27665;&#65306;
<P>The Dutch settled in South Africa.&#33655;&#20848;&#20154;&#22312;&#21335;&#38750;&#27542;&#27665;&#12290;
<P>This area was settled by immigrants over a century ago.&#36825;&#19968;&#24102;&#22312;&#19968;&#20010;&#19990;&#32426;&#20197;&#21069;&#26159;&#31227;&#27665;&#30340;&#27542;&#27665;&#22320;&#12290;
<P>&nbsp;
<P>make one's home in a place &#23450;&#23621;&#65307;&#23433;&#23478;&#33853;&#25143;&#65306;
<P>After years of travel, we decided to settle here.&#25105;&#20204;&#26053;&#34892;&#22810;&#24180;&#21518;&#65292;&#20915;&#23450;&#22312;&#27492;&#23450;&#23621;&#12290;
<P>settle in London, in Canada, in the country, near the coast&#22312;&#20262;&#25958;&#12289;&#22312;&#21152;&#25343;&#22823;&#12289;&#22312;&#20065;&#26449;&#12289;&#22312;&#27839;&#28023;&#23433;&#23478;&#12290;
<P>&nbsp;
<P>settle (on/over sth) come to rest on sth; stay for some time on sth &#22312;&#26576;&#22788;&#20572;&#27463;&#25110;&#20572;&#30041;&#19968;&#26102;&#65306;
<P>Will the snow settle?Will it remain on the ground without melting?&#36825;&#38634;&#21574;&#24471;&#20303;&#21527;? &#65288;&#33021;&#33853;&#22312;&#22320;&#19978;&#19981;&#34701;&#21270;&#21527;? &#65289;
<P>The bird settled on a branch.&#37027;&#21482;&#40479;&#33853;&#22312;&#26641;&#26525;&#19978;&#20102;&#12290;
<P>Clouds have settled over the mountain tops.&#37027;&#20123;&#20113;&#24425;&#22312;&#23665;&#39030;&#19978;&#31354;&#20572;&#30041;&#19981;&#25955;&#12290;
<P>The dust had settled on everything.&#21040;&#22788;&#37117;&#26159;&#31215;&#23576;&#12290;
<P>The cold has settled on my chestIt is making me cough, etc.&#25105;&#24739;&#24863;&#20882;&#24050;&#24341;&#36215;&#33016;&#37096;&#19981;&#36866;&#65288;&#21683;&#22013;&#31561;&#65289;&#12290;
<P>A tense silence had settled over the waiting crowd.&#22312;&#31561;&#20505;&#30340;&#20154;&#32676;&#20013;&#26377;&#19968;&#31181;&#32039;&#24352;&#30340;&#23490;&#38745;&#24863;&#12290;
<P>&nbsp;
<P>settle (back) make (sb/oneself) comfortable in a new position &#20351;&#65288;&#26576;&#20154;&#65339;&#33258;&#24049;&#65341;&#65289;&#22312;&#26032;&#20301;&#32622;&#19978;&#35273;&#24471;&#33298;&#36866;&#65306;
<P>settle (back) in one's armchair&#33298;&#36866;&#22320;&#65288;&#20208;&#65289;&#22352;&#22312;&#21333;&#24231;&#27801;&#21457;&#19978;
<P>The nurse settled her patient for the nightmade him comfortable, gave him medicine, etc.&#25252;&#22763;&#23433;&#39039;&#30149;&#20154;&#36807;&#22812;&#65288;&#35753;&#20182;&#33298;&#36866;&#12289;&#32473;&#20182;&#33647;&#31561;&#65289;&#12290;
<P>He settled himself on the sofa to watch TV.&#20182;&#33298;&#33298;&#26381;&#26381;&#22320;&#22352;&#22312;&#38271;&#27801;&#21457;&#19978;&#30475;&#30005;&#35270;&#12290;
<P>&nbsp;
<P>(cause sb/sth to) become calm, composed or relaxed &#65288;&#20351;&#26576;&#20154;&#65339;&#26576;&#20107;&#29289;&#65341;&#65289;&#24179;&#38745;&#12289;&#38215;&#38745;&#25110;&#25918;&#26494;&#65306;
<P>Wait until all the excitement has settled.&#31561;&#21040;&#28608;&#21160;&#24773;&#32490;&#24179;&#38745;&#19979;&#26469;&#20877;&#35828;&#12290;
<P>Have a drink to settle your stomach.&#21917;&#28857;&#39278;&#26009;&#32963;&#21475;&#23601;&#33298;&#26381;&#20123;&#12290;
<P>The thunderstorm may settle the weather.&#36825;&#22330;&#38647;&#26292;&#36807;&#21518;&#22825;&#27668;&#21487;&#33021;&#21453;&#32780;&#22909;&#20123;&#12290;
<P>This pill will help to settle your nerves.&#20320;&#21507;&#20102;&#36825;&#29255;&#33647;&#31070;&#32463;&#23601;&#19981;&#37027;&#20040;&#32039;&#24352;&#20102;&#12290;
<P>He had been quite anxious, but I managed to settle his mind.&#20182;&#21407;&#26469;&#24456;&#30528;&#24613;&#65292;&#25105;&#24635;&#31639;&#25226;&#20182;&#30340;&#24773;&#32490;&#31283;&#23450;&#19979;&#26469;&#20102;&#12290;
<P>TnTn.prTfTwsettle sth (with sb) make an agreement about sth; arrange sth finally or satisfactorily; deal with sth &#23545;&#26576;&#20107;&#29289;&#36798;&#25104;&#19968;&#33268;&#24847;&#35265;&#65307;&#32456;&#20110;&#25110;&#28385;&#24847;&#22320;&#23433;&#25490;&#22909;&#26576;&#20107;&#29289;&#65307;&#35299;&#20915;&#65307;&#22788;&#29702;&#65306;
<P>settle a dispute, an argument, an issue, etc&#35299;&#20915;&#19968;&#20105;&#31471;&#12289;&#20105;&#35770;&#12289;&#38382;&#39064;&#31561;
<P>That settles the matter.&#20107;&#24773;&#23601;&#37027;&#26679;&#35299;&#20915;&#20102;&#12290;
<P>Nothing is settled yet.&#20160;&#20040;&#20063;&#27809;&#23450;&#19979;&#26469;&#12290;
<P>You should settle your affairs (by making a will) before you leave.&#20320;&#24212;&#35813;&#25226;&#20320;&#30340;&#20107;&#24773;&#22788;&#29702;&#22909;&#20877;&#36208;&#65288;&#22914;&#20808;&#20889;&#22909;&#36951;&#22065;&#65289;&#12290;
<P>It's time you settled your dispute with him.&#29616;&#22312;&#20320;&#35813;&#36319;&#20182;&#25226;&#20105;&#31471;&#35299;&#20915;&#20102;&#12290;
<P>We have settled that we will leave next week.&#25105;&#20204;&#24050;&#32463;&#23433;&#25490;&#22909;&#19979;&#26143;&#26399;&#36208;&#12290;
<P>Have you settled how it will be done?&#23545;&#20110;&#22914;&#20309;&#22788;&#29702;&#36825;&#20214;&#20107;&#65292;&#20320;&#20204;&#26159;&#21542;&#24050;&#36798;&#25104;&#21327;&#35758;&#20102;?
<P>IIprsettle (with sb) resolve a legal dispute by mutual agreement &#30456;&#20114;&#21516;&#24847;&#35299;&#20915;&#19968;&#27861;&#24459;&#19978;&#30340;&#20105;&#31471;&#65306;
<P>The parties in the lawsuit settled (with each other) out of courtreached an agreement before the case was heard in court.&#28041;&#35772;&#21452;&#26041;&#65288;&#30456;&#20114;&#65289;&#36798;&#25104;&#21327;&#35758;&#24237;&#22806;&#21644;&#35299;&#12290;
<P>IIprIpTnsettle (up) (with sb) pay (what is owed, a bill, etc) &#20607;&#20184;&#65292;&#32467;&#31639;&#65288;&#27424;&#20538;&#12289;&#24080;&#21333;&#31561;&#65289;&#65306;
<P>You owe a lot, and it's now time to settle (with your creditors).&#20320;&#27424;&#20102;&#24456;&#22810;&#20538;&#65292;&#29616;&#22312;&#35813;&#20607;&#36824;&#65288;&#32473;&#20538;&#26435;&#20154;&#65289;&#20102;&#12290;
<P>Have you settled (up) with her for the goods?&#20320;&#36319;&#22905;&#32467;&#31639;&#36135;&#27454;&#20102;&#21527;?
<P>If you pay for both of us now, we can settle up later.&#20320;&#35201;&#26159;&#29616;&#22312;&#20808;&#20184;&#28165;&#21681;&#20204;&#20004;&#20154;&#30340;&#24080;&#65292;&#20107;&#21518;&#21681;&#20204;&#20457;&#20877;&#32454;&#31639;&#12290;
<P>The insurance company has settled her claim.&#20445;&#38505;&#20844;&#21496;&#24050;&#32463;&#28165;&#20607;&#20102;&#22905;&#30340;&#32034;&#36180;&#27454;&#39069;&#12290;
<P>Please settle your bill before leaving the hotel.&#31163;&#24320;&#26053;&#39302;&#21069;&#35831;&#20808;&#32467;&#24080;&#12290;
<P>IprTnTn.prsettle (sth) (with sb) fig punish sb for (an injury, insult, etc that one has suffered) &#20026;&#65288;&#25152;&#21463;&#30340;&#20260;&#23475;&#12289;&#20398;&#36785;&#31561;&#65289;&#24809;&#32602;&#26576;&#20154;&#65306;
<P>He thinks he can laugh at me, but I'll settle with him soon.&#20182;&#20197;&#20026;&#20182;&#22066;&#31505;&#25105;&#20043;&#21518;&#23601;&#31639;&#23436;&#20107;&#20102;&#65292;&#25105;&#39532;&#19978;&#23601;&#35201;&#25214;&#20182;&#31639;&#36825;&#31508;&#24080;&#12290;
<P>settle a score, grievance, etc&#28165;&#31639;&#26087;&#20167;&#12289;&#31215;&#24616;&#31561;&#12290;
<P>ITn(cause sth to) sink to a lower level &#65288;&#20351;&#26576;&#29289;&#65289;&#19979;&#27785;&#65292;&#19979;&#38477;&#65306;
<P>The dregs have settled at the bottom of the bottle.&#28195;&#28371;&#37117;&#27785;&#21040;&#29942;&#24213;&#20102;&#12290;
<P>Stir the coffee to settle the grounds.&#25226;&#21654;&#21857;&#25605;&#19968;&#25605;&#22909;&#35753;&#28195;&#28371;&#27785;&#28096;&#12290;
<P>The shower of rain has settled the dust.&#36825;&#19968;&#38453;&#38632;&#25226;&#23576;&#22303;&#37117;&#36214;&#21040;&#22320;&#19978;&#20102;&#12290;
<P>ITn(cause sth to) become clear as solid matter sinks &#65288;&#20351;&#26576;&#29289;&#65289;&#28165;&#28552;&#65288;&#22240;&#22266;&#20307;&#19979;&#27785;&#25152;&#33268;&#65289;&#65306;
<P>Has the beer settled?&#21860;&#37202;&#28548;&#28165;&#20102;&#21527;?
<P>Leave the wine on a shelf for a week to settle it.&#25226;&#37202;&#25601;&#22312;&#26550;&#23376;&#19978;&#25918;&#19968;&#20010;&#26143;&#26399;&#22909;&#35753;&#23427;&#28548;&#28165;&#12290;
<P>Ibecome more compact; subside &#21464;&#24471;&#26356;&#32039;&#23454;&#25110;&#22362;&#23454;&#65307;&#19979;&#38519;&#65306;
<P>The wall sagged as the earth beneath it settled.&#30001;&#20110;&#22681;&#22522;&#30340;&#22303;&#19979;&#38519;&#65292;&#22681;&#20063;&#20985;&#38519;&#20102;&#12290;