If this seems strange, think again. Recall the diagrams of the previous section. The C compiler has no choice here, since an array name is a label it replaces<SPAN>&nbsp;</SPAN><EM>at compile time</EM><SPAN>&nbsp;</SPAN>with the address it represents. But a function isn't called at compile time, it's called<SPAN>&nbsp;</SPAN><EM>at run time</EM>, where something should be placed on the stack to be considered as an argument. The compiler can't just treat array references inside a function as labels and replace them with addresses, because it has no idea what actual array will be passed in at run time 
<P></P>
<P>&#20026;&#20160;&#20040;&#25968;&#32452;&#31867;&#22411;&#30340;&#24418;&#24335;&#21442;&#25968;&#65292;&#23454;&#38469;&#22312;&#20989;&#25968;&#20013;&#20351;&#29992;&#26102;&#21644;&#25351;&#38024;&#23436;&#20840;&#19968;&#26679;&#21602;&#65311;&#36825;&#26159;&#30001;&#20110; C &#20013;&#30340;&#25968;&#32452;&#21517;&#31216;&#23454;&#38469;&#19978;&#26159;&#39318;&#20803;&#32032;&#30340;&#22320;&#22336;&#26631;&#31614;&#32780;&#19981;&#26159;&#30495;&#27491;&#30340;&#21464;&#37327;&#65292;&#21152;&#36733;&#26102;&#20250;&#30452;&#25509;&#23558;&#25968;&#32452;&#21517;&#25442;&#25104;&#39318;&#20803;&#32032;&#30340;&#22320;&#22336;&#12290;&#32780;&#22914;&#26524;&#24819;&#35201;&#35753;&#20989;&#25968;&#30340;&#24418;&#24335;&#21442;&#25968;&#25104;&#20026;&#30495;&#27491;&#30340;&#25968;&#32452;&#31867;&#22411;&#65292;&#23601;&#38656;&#35201;&#22312;&#21152;&#36733;&#26102;&#23558;&#35813;&#24418;&#24335;&#21442;&#25968;&#26367;&#25442;&#20026;&#30495;&#27491;&#30340;&#22320;&#22336;&#65292;&#21487;&#26159;&#26368;&#20851;&#38190;&#30340;&#38382;&#39064;&#22312;&#20110;&#65292;&#21482;&#26377;&#22312;&#36816;&#34892;&#26102;&#25191;&#34892;&#20989;&#25968;&#35843;&#29992;&#26102;&#25165;&#33021;&#30830;&#23450;&#24418;&#24335;&#21442;&#25968;&#30340;&#20540;&#65292;&#22312;&#21152;&#36733;&#26102;&#26159;&#30830;&#23450;&#19981;&#20102;&#30340;&#12290;</P>
<P>&#26368;&#26681;&#26412;&#30340;&#21407;&#22240;&#26159; C &#30340;&#25968;&#32452;&#21517;&#26159;&#19968;&#20010;&#22320;&#22336;&#26631;&#31614;&#32780;&#38750;&#21464;&#37327;</P>
<P><SPAN class=extract>&#26412;&#36136;&#19978;&#65292;C &#20013;&#30340;&#25968;&#32452;&#21517;&#26159;&#20160;&#20040;&#19996;&#35199;&#65311;&#22320;&#22336;&#26631;&#31614;</SPAN></P>
<P><SPAN class=extract>C &#20013;&#30340;&#25968;&#32452;&#26159;&#21464;&#37327;&#21527;&#65311;&#19981;&#26159;&#65292;&#26159;&#22320;&#22336;&#26631;&#31614;</SPAN>